module.exports = [{
    "id": 110000,
    "label": "北京市",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 110100,
        "label": "市辖区",
        "level": 2,
        "pid": 110000,

        "children": [{
            "id": 110101,
            "label": "东城区",
            "level": 3,
            "pid": 110100,


        }, {
            "id": 110102,
            "label": "西城区",
            "level": 3,
            "pid": 110100,


        }, {
            "id": 110105,
            "label": "朝阳区",
            "level": 3,
            "pid": 110100,


        }, {
            "id": 110106,
            "label": "丰台区",
            "level": 3,
            "pid": 110100,


        }, {
            "id": 110107,
            "label": "石景山区",
            "level": 3,
            "pid": 110100,


        }, {
            "id": 110108,
            "label": "海淀区",
            "level": 3,
            "pid": 110100,


        }, {
            "id": 110109,
            "label": "门头沟区",
            "level": 3,
            "pid": 110100,


        }, {
            "id": 110111,
            "label": "房山区",
            "level": 3,
            "pid": 110100,


        }, {
            "id": 110112,
            "label": "通州区",
            "level": 3,
            "pid": 110100,


        }, {
            "id": 110113,
            "label": "顺义区",
            "level": 3,
            "pid": 110100,


        }, {
            "id": 110114,
            "label": "昌平区",
            "level": 3,
            "pid": 110100,


        }, {
            "id": 110115,
            "label": "大兴区",
            "level": 3,
            "pid": 110100,


        }, {
            "id": 110116,
            "label": "怀柔区",
            "level": 3,
            "pid": 110100,


        }, {
            "id": 110117,
            "label": "平谷区",
            "level": 3,
            "pid": 110100,


        }, {
            "id": 110228,
            "label": "密云县",
            "level": 3,
            "pid": 110100,


        }, {
            "id": 110229,
            "label": "延庆县",
            "level": 3,
            "pid": 110100,


        }]
    }]
}, {
    "id": 120000,
    "label": "天津市",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 120100,
        "label": "市辖区",
        "level": 2,
        "pid": 120000,

        "children": [{
            "id": 120101,
            "label": "和平区",
            "level": 3,
            "pid": 120100,


        }, {
            "id": 120102,
            "label": "河东区",
            "level": 3,
            "pid": 120100,


        }, {
            "id": 120103,
            "label": "河西区",
            "level": 3,
            "pid": 120100,


        }, {
            "id": 120104,
            "label": "南开区",
            "level": 3,
            "pid": 120100,


        }, {
            "id": 120105,
            "label": "河北区",
            "level": 3,
            "pid": 120100,


        }, {
            "id": 120106,
            "label": "红桥区",
            "level": 3,
            "pid": 120100,


        }, {
            "id": 120110,
            "label": "东丽区",
            "level": 3,
            "pid": 120100,


        }, {
            "id": 120111,
            "label": "西青区",
            "level": 3,
            "pid": 120100,


        }, {
            "id": 120112,
            "label": "津南区",
            "level": 3,
            "pid": 120100,


        }, {
            "id": 120113,
            "label": "北辰区",
            "level": 3,
            "pid": 120100,


        }, {
            "id": 120114,
            "label": "武清区",
            "level": 3,
            "pid": 120100,


        }, {
            "id": 120115,
            "label": "宝坻区",
            "level": 3,
            "pid": 120100,


        }, {
            "id": 120116,
            "label": "滨海新区",
            "level": 3,
            "pid": 120100,


        }, {
            "id": 120221,
            "label": "宁河县",
            "level": 3,
            "pid": 120100,


        }, {
            "id": 120223,
            "label": "静海县",
            "level": 3,
            "pid": 120100,


        }, {
            "id": 120225,
            "label": "蓟县",
            "level": 3,
            "pid": 120100,


        }]
    }]
}, {
    "id": 130000,
    "label": "河北省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 130100,
        "label": "石家庄市",
        "level": 2,
        "pid": 130000,

        "children": [{
            "id": 130102,
            "label": "长安区",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130104,
            "label": "桥西区",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130105,
            "label": "新华区",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130107,
            "label": "井陉矿区",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130108,
            "label": "裕华区",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130109,
            "label": "藁城区",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130110,
            "label": "鹿泉区",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130111,
            "label": "栾城区",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130121,
            "label": "井陉县",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130123,
            "label": "正定县",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130125,
            "label": "行唐县",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130126,
            "label": "灵寿县",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130127,
            "label": "高邑县",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130128,
            "label": "深泽县",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130129,
            "label": "赞皇县",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130130,
            "label": "无极县",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130131,
            "label": "平山县",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130132,
            "label": "元氏县",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130133,
            "label": "赵县",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130181,
            "label": "辛集市",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130183,
            "label": "晋州市",
            "level": 3,
            "pid": 130100,


        }, {
            "id": 130184,
            "label": "新乐市",
            "level": 3,
            "pid": 130100,


        }]
    }, {
        "id": 130200,
        "label": "唐山市",
        "level": 2,
        "pid": 130000,

        "children": [{
            "id": 130202,
            "label": "路南区",
            "level": 3,
            "pid": 130200,


        }, {
            "id": 130203,
            "label": "路北区",
            "level": 3,
            "pid": 130200,


        }, {
            "id": 130204,
            "label": "古冶区",
            "level": 3,
            "pid": 130200,


        }, {
            "id": 130205,
            "label": "开平区",
            "level": 3,
            "pid": 130200,


        }, {
            "id": 130207,
            "label": "丰南区",
            "level": 3,
            "pid": 130200,


        }, {
            "id": 130208,
            "label": "丰润区",
            "level": 3,
            "pid": 130200,


        }, {
            "id": 130209,
            "label": "曹妃甸区",
            "level": 3,
            "pid": 130200,


        }, {
            "id": 130223,
            "label": "滦县",
            "level": 3,
            "pid": 130200,


        }, {
            "id": 130224,
            "label": "滦南县",
            "level": 3,
            "pid": 130200,


        }, {
            "id": 130225,
            "label": "乐亭县",
            "level": 3,
            "pid": 130200,


        }, {
            "id": 130227,
            "label": "迁西县",
            "level": 3,
            "pid": 130200,


        }, {
            "id": 130229,
            "label": "玉田县",
            "level": 3,
            "pid": 130200,


        }, {
            "id": 130281,
            "label": "遵化市",
            "level": 3,
            "pid": 130200,


        }, {
            "id": 130283,
            "label": "迁安市",
            "level": 3,
            "pid": 130200,


        }]
    }, {
        "id": 130300,
        "label": "秦皇岛市",
        "level": 2,
        "pid": 130000,

        "children": [{
            "id": 130302,
            "label": "海港区",
            "level": 3,
            "pid": 130300,


        }, {
            "id": 130303,
            "label": "山海关区",
            "level": 3,
            "pid": 130300,


        }, {
            "id": 130304,
            "label": "北戴河区",
            "level": 3,
            "pid": 130300,


        }, {
            "id": 130321,
            "label": "青龙满族自治县",
            "level": 3,
            "pid": 130300,


        }, {
            "id": 130322,
            "label": "昌黎县",
            "level": 3,
            "pid": 130300,


        }, {
            "id": 130323,
            "label": "抚宁县",
            "level": 3,
            "pid": 130300,


        }, {
            "id": 130324,
            "label": "卢龙县",
            "level": 3,
            "pid": 130300,


        }]
    }, {
        "id": 130400,
        "label": "邯郸市",
        "level": 2,
        "pid": 130000,

        "children": [{
            "id": 130402,
            "label": "邯山区",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130403,
            "label": "丛台区",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130404,
            "label": "复兴区",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130406,
            "label": "峰峰矿区",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130421,
            "label": "邯郸县",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130423,
            "label": "临漳县",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130424,
            "label": "成安县",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130425,
            "label": "大名县",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130426,
            "label": "涉县",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130427,
            "label": "磁县",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130428,
            "label": "肥乡县",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130429,
            "label": "永年县",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130430,
            "label": "邱县",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130431,
            "label": "鸡泽县",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130432,
            "label": "广平县",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130433,
            "label": "馆陶县",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130434,
            "label": "魏县",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130435,
            "label": "曲周县",
            "level": 3,
            "pid": 130400,


        }, {
            "id": 130481,
            "label": "武安市",
            "level": 3,
            "pid": 130400,


        }]
    }, {
        "id": 130500,
        "label": "邢台市",
        "level": 2,
        "pid": 130000,

        "children": [{
            "id": 130502,
            "label": "桥东区",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130503,
            "label": "桥西区",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130521,
            "label": "邢台县",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130522,
            "label": "临城县",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130523,
            "label": "内丘县",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130524,
            "label": "柏乡县",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130525,
            "label": "隆尧县",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130526,
            "label": "任县",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130527,
            "label": "南和县",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130528,
            "label": "宁晋县",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130529,
            "label": "巨鹿县",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130530,
            "label": "新河县",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130531,
            "label": "广宗县",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130532,
            "label": "平乡县",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130533,
            "label": "威县",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130534,
            "label": "清河县",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130535,
            "label": "临西县",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130581,
            "label": "南宫市",
            "level": 3,
            "pid": 130500,


        }, {
            "id": 130582,
            "label": "沙河市",
            "level": 3,
            "pid": 130500,


        }]
    }, {
        "id": 130600,
        "label": "保定市",
        "level": 2,
        "pid": 130000,

        "children": [{
            "id": 130602,
            "label": "新市区",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130603,
            "label": "北市区",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130604,
            "label": "南市区",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130621,
            "label": "满城县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130622,
            "label": "清苑县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130623,
            "label": "涞水县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130624,
            "label": "阜平县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130625,
            "label": "徐水县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130626,
            "label": "定兴县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130627,
            "label": "唐县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130628,
            "label": "高阳县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130629,
            "label": "容城县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130630,
            "label": "涞源县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130631,
            "label": "望都县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130632,
            "label": "安新县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130633,
            "label": "易县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130634,
            "label": "曲阳县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130635,
            "label": "蠡县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130636,
            "label": "顺平县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130637,
            "label": "博野县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130638,
            "label": "雄县",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130681,
            "label": "涿州市",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130682,
            "label": "定州市",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130683,
            "label": "安国市",
            "level": 3,
            "pid": 130600,


        }, {
            "id": 130684,
            "label": "高碑店市",
            "level": 3,
            "pid": 130600,


        }]
    }, {
        "id": 130700,
        "label": "张家口市",
        "level": 2,
        "pid": 130000,

        "children": [{
            "id": 130702,
            "label": "桥东区",
            "level": 3,
            "pid": 130700,


        }, {
            "id": 130703,
            "label": "桥西区",
            "level": 3,
            "pid": 130700,


        }, {
            "id": 130705,
            "label": "宣化区",
            "level": 3,
            "pid": 130700,


        }, {
            "id": 130706,
            "label": "下花园区",
            "level": 3,
            "pid": 130700,


        }, {
            "id": 130721,
            "label": "宣化县",
            "level": 3,
            "pid": 130700,


        }, {
            "id": 130722,
            "label": "张北县",
            "level": 3,
            "pid": 130700,


        }, {
            "id": 130723,
            "label": "康保县",
            "level": 3,
            "pid": 130700,


        }, {
            "id": 130724,
            "label": "沽源县",
            "level": 3,
            "pid": 130700,


        }, {
            "id": 130725,
            "label": "尚义县",
            "level": 3,
            "pid": 130700,


        }, {
            "id": 130726,
            "label": "蔚县",
            "level": 3,
            "pid": 130700,


        }, {
            "id": 130727,
            "label": "阳原县",
            "level": 3,
            "pid": 130700,


        }, {
            "id": 130728,
            "label": "怀安县",
            "level": 3,
            "pid": 130700,


        }, {
            "id": 130729,
            "label": "万全县",
            "level": 3,
            "pid": 130700,


        }, {
            "id": 130730,
            "label": "怀来县",
            "level": 3,
            "pid": 130700,


        }, {
            "id": 130731,
            "label": "涿鹿县",
            "level": 3,
            "pid": 130700,


        }, {
            "id": 130732,
            "label": "赤城县",
            "level": 3,
            "pid": 130700,


        }, {
            "id": 130733,
            "label": "崇礼县",
            "level": 3,
            "pid": 130700,


        }]
    }, {
        "id": 130800,
        "label": "承德市",
        "level": 2,
        "pid": 130000,

        "children": [{
            "id": 130802,
            "label": "双桥区",
            "level": 3,
            "pid": 130800,


        }, {
            "id": 130803,
            "label": "双滦区",
            "level": 3,
            "pid": 130800,


        }, {
            "id": 130804,
            "label": "鹰手营子矿区",
            "level": 3,
            "pid": 130800,


        }, {
            "id": 130821,
            "label": "承德县",
            "level": 3,
            "pid": 130800,


        }, {
            "id": 130822,
            "label": "兴隆县",
            "level": 3,
            "pid": 130800,


        }, {
            "id": 130823,
            "label": "平泉县",
            "level": 3,
            "pid": 130800,


        }, {
            "id": 130824,
            "label": "滦平县",
            "level": 3,
            "pid": 130800,


        }, {
            "id": 130825,
            "label": "隆化县",
            "level": 3,
            "pid": 130800,


        }, {
            "id": 130826,
            "label": "丰宁满族自治县",
            "level": 3,
            "pid": 130800,


        }, {
            "id": 130827,
            "label": "宽城满族自治县",
            "level": 3,
            "pid": 130800,


        }, {
            "id": 130828,
            "label": "围场满族蒙古族自治县",
            "level": 3,
            "pid": 130800,


        }]
    }, {
        "id": 130900,
        "label": "沧州市",
        "level": 2,
        "pid": 130000,

        "children": [{
            "id": 130902,
            "label": "新华区",
            "level": 3,
            "pid": 130900,


        }, {
            "id": 130903,
            "label": "运河区",
            "level": 3,
            "pid": 130900,


        }, {
            "id": 130921,
            "label": "沧县",
            "level": 3,
            "pid": 130900,


        }, {
            "id": 130922,
            "label": "青县",
            "level": 3,
            "pid": 130900,


        }, {
            "id": 130923,
            "label": "东光县",
            "level": 3,
            "pid": 130900,


        }, {
            "id": 130924,
            "label": "海兴县",
            "level": 3,
            "pid": 130900,


        }, {
            "id": 130925,
            "label": "盐山县",
            "level": 3,
            "pid": 130900,


        }, {
            "id": 130926,
            "label": "肃宁县",
            "level": 3,
            "pid": 130900,


        }, {
            "id": 130927,
            "label": "南皮县",
            "level": 3,
            "pid": 130900,


        }, {
            "id": 130928,
            "label": "吴桥县",
            "level": 3,
            "pid": 130900,


        }, {
            "id": 130929,
            "label": "献县",
            "level": 3,
            "pid": 130900,


        }, {
            "id": 130930,
            "label": "孟村回族自治县",
            "level": 3,
            "pid": 130900,


        }, {
            "id": 130981,
            "label": "泊头市",
            "level": 3,
            "pid": 130900,


        }, {
            "id": 130982,
            "label": "任丘市",
            "level": 3,
            "pid": 130900,


        }, {
            "id": 130983,
            "label": "黄骅市",
            "level": 3,
            "pid": 130900,


        }, {
            "id": 130984,
            "label": "河间市",
            "level": 3,
            "pid": 130900,


        }]
    }, {
        "id": 131000,
        "label": "廊坊市",
        "level": 2,
        "pid": 130000,

        "children": [{
            "id": 131002,
            "label": "安次区",
            "level": 3,
            "pid": 131000,


        }, {
            "id": 131003,
            "label": "广阳区",
            "level": 3,
            "pid": 131000,


        }, {
            "id": 131022,
            "label": "固安县",
            "level": 3,
            "pid": 131000,


        }, {
            "id": 131023,
            "label": "永清县",
            "level": 3,
            "pid": 131000,


        }, {
            "id": 131024,
            "label": "香河县",
            "level": 3,
            "pid": 131000,


        }, {
            "id": 131025,
            "label": "大城县",
            "level": 3,
            "pid": 131000,


        }, {
            "id": 131026,
            "label": "文安县",
            "level": 3,
            "pid": 131000,


        }, {
            "id": 131028,
            "label": "大厂回族自治县",
            "level": 3,
            "pid": 131000,


        }, {
            "id": 131081,
            "label": "霸州市",
            "level": 3,
            "pid": 131000,


        }, {
            "id": 131082,
            "label": "三河市",
            "level": 3,
            "pid": 131000,


        }]
    }, {
        "id": 131100,
        "label": "衡水市",
        "level": 2,
        "pid": 130000,

        "children": [{
            "id": 131102,
            "label": "桃城区",
            "level": 3,
            "pid": 131100,


        }, {
            "id": 131121,
            "label": "枣强县",
            "level": 3,
            "pid": 131100,


        }, {
            "id": 131122,
            "label": "武邑县",
            "level": 3,
            "pid": 131100,


        }, {
            "id": 131123,
            "label": "武强县",
            "level": 3,
            "pid": 131100,


        }, {
            "id": 131124,
            "label": "饶阳县",
            "level": 3,
            "pid": 131100,


        }, {
            "id": 131125,
            "label": "安平县",
            "level": 3,
            "pid": 131100,


        }, {
            "id": 131126,
            "label": "故城县",
            "level": 3,
            "pid": 131100,


        }, {
            "id": 131127,
            "label": "景县",
            "level": 3,
            "pid": 131100,


        }, {
            "id": 131128,
            "label": "阜城县",
            "level": 3,
            "pid": 131100,


        }, {
            "id": 131181,
            "label": "冀州市",
            "level": 3,
            "pid": 131100,


        }, {
            "id": 131182,
            "label": "深州市",
            "level": 3,
            "pid": 131100,


        }]
    }]
}, {
    "id": 140000,
    "label": "山西省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 140100,
        "label": "太原市",
        "level": 2,
        "pid": 140000,

        "children": [{
            "id": 140105,
            "label": "小店区",
            "level": 3,
            "pid": 140100,


        }, {
            "id": 140106,
            "label": "迎泽区",
            "level": 3,
            "pid": 140100,


        }, {
            "id": 140107,
            "label": "杏花岭区",
            "level": 3,
            "pid": 140100,


        }, {
            "id": 140108,
            "label": "尖草坪区",
            "level": 3,
            "pid": 140100,


        }, {
            "id": 140109,
            "label": "万柏林区",
            "level": 3,
            "pid": 140100,


        }, {
            "id": 140110,
            "label": "晋源区",
            "level": 3,
            "pid": 140100,


        }, {
            "id": 140121,
            "label": "清徐县",
            "level": 3,
            "pid": 140100,


        }, {
            "id": 140122,
            "label": "阳曲县",
            "level": 3,
            "pid": 140100,


        }, {
            "id": 140123,
            "label": "娄烦县",
            "level": 3,
            "pid": 140100,


        }, {
            "id": 140181,
            "label": "古交市",
            "level": 3,
            "pid": 140100,


        }]
    }, {
        "id": 140200,
        "label": "大同市",
        "level": 2,
        "pid": 140000,

        "children": [{
            "id": 140202,
            "label": "城区",
            "level": 3,
            "pid": 140200,


        }, {
            "id": 140203,
            "label": "矿区",
            "level": 3,
            "pid": 140200,


        }, {
            "id": 140211,
            "label": "南郊区",
            "level": 3,
            "pid": 140200,


        }, {
            "id": 140212,
            "label": "新荣区",
            "level": 3,
            "pid": 140200,


        }, {
            "id": 140221,
            "label": "阳高县",
            "level": 3,
            "pid": 140200,


        }, {
            "id": 140222,
            "label": "天镇县",
            "level": 3,
            "pid": 140200,


        }, {
            "id": 140223,
            "label": "广灵县",
            "level": 3,
            "pid": 140200,


        }, {
            "id": 140224,
            "label": "灵丘县",
            "level": 3,
            "pid": 140200,


        }, {
            "id": 140225,
            "label": "浑源县",
            "level": 3,
            "pid": 140200,


        }, {
            "id": 140226,
            "label": "左云县",
            "level": 3,
            "pid": 140200,


        }, {
            "id": 140227,
            "label": "大同县",
            "level": 3,
            "pid": 140200,


        }]
    }, {
        "id": 140300,
        "label": "阳泉市",
        "level": 2,
        "pid": 140000,

        "children": [{
            "id": 140302,
            "label": "城区",
            "level": 3,
            "pid": 140300,


        }, {
            "id": 140303,
            "label": "矿区",
            "level": 3,
            "pid": 140300,


        }, {
            "id": 140311,
            "label": "郊区",
            "level": 3,
            "pid": 140300,


        }, {
            "id": 140321,
            "label": "平定县",
            "level": 3,
            "pid": 140300,


        }, {
            "id": 140322,
            "label": "盂县",
            "level": 3,
            "pid": 140300,


        }]
    }, {
        "id": 140400,
        "label": "长治市",
        "level": 2,
        "pid": 140000,

        "children": [{
            "id": 140402,
            "label": "城区",
            "level": 3,
            "pid": 140400,


        }, {
            "id": 140411,
            "label": "郊区",
            "level": 3,
            "pid": 140400,


        }, {
            "id": 140421,
            "label": "长治县",
            "level": 3,
            "pid": 140400,


        }, {
            "id": 140423,
            "label": "襄垣县",
            "level": 3,
            "pid": 140400,


        }, {
            "id": 140424,
            "label": "屯留县",
            "level": 3,
            "pid": 140400,


        }, {
            "id": 140425,
            "label": "平顺县",
            "level": 3,
            "pid": 140400,


        }, {
            "id": 140426,
            "label": "黎城县",
            "level": 3,
            "pid": 140400,


        }, {
            "id": 140427,
            "label": "壶关县",
            "level": 3,
            "pid": 140400,


        }, {
            "id": 140428,
            "label": "长子县",
            "level": 3,
            "pid": 140400,


        }, {
            "id": 140429,
            "label": "武乡县",
            "level": 3,
            "pid": 140400,


        }, {
            "id": 140430,
            "label": "沁县",
            "level": 3,
            "pid": 140400,


        }, {
            "id": 140431,
            "label": "沁源县",
            "level": 3,
            "pid": 140400,


        }, {
            "id": 140481,
            "label": "潞城市",
            "level": 3,
            "pid": 140400,


        }]
    }, {
        "id": 140500,
        "label": "晋城市",
        "level": 2,
        "pid": 140000,

        "children": [{
            "id": 140502,
            "label": "城区",
            "level": 3,
            "pid": 140500,


        }, {
            "id": 140521,
            "label": "沁水县",
            "level": 3,
            "pid": 140500,


        }, {
            "id": 140522,
            "label": "阳城县",
            "level": 3,
            "pid": 140500,


        }, {
            "id": 140524,
            "label": "陵川县",
            "level": 3,
            "pid": 140500,


        }, {
            "id": 140525,
            "label": "泽州县",
            "level": 3,
            "pid": 140500,


        }, {
            "id": 140581,
            "label": "高平市",
            "level": 3,
            "pid": 140500,


        }]
    }, {
        "id": 140600,
        "label": "朔州市",
        "level": 2,
        "pid": 140000,

        "children": [{
            "id": 140602,
            "label": "朔城区",
            "level": 3,
            "pid": 140600,


        }, {
            "id": 140603,
            "label": "平鲁区",
            "level": 3,
            "pid": 140600,


        }, {
            "id": 140621,
            "label": "山阴县",
            "level": 3,
            "pid": 140600,


        }, {
            "id": 140622,
            "label": "应县",
            "level": 3,
            "pid": 140600,


        }, {
            "id": 140623,
            "label": "右玉县",
            "level": 3,
            "pid": 140600,


        }, {
            "id": 140624,
            "label": "怀仁县",
            "level": 3,
            "pid": 140600,


        }]
    }, {
        "id": 140700,
        "label": "晋中市",
        "level": 2,
        "pid": 140000,

        "children": [{
            "id": 140702,
            "label": "榆次区",
            "level": 3,
            "pid": 140700,


        }, {
            "id": 140721,
            "label": "榆社县",
            "level": 3,
            "pid": 140700,


        }, {
            "id": 140722,
            "label": "左权县",
            "level": 3,
            "pid": 140700,


        }, {
            "id": 140723,
            "label": "和顺县",
            "level": 3,
            "pid": 140700,


        }, {
            "id": 140724,
            "label": "昔阳县",
            "level": 3,
            "pid": 140700,


        }, {
            "id": 140725,
            "label": "寿阳县",
            "level": 3,
            "pid": 140700,


        }, {
            "id": 140726,
            "label": "太谷县",
            "level": 3,
            "pid": 140700,


        }, {
            "id": 140727,
            "label": "祁县",
            "level": 3,
            "pid": 140700,


        }, {
            "id": 140728,
            "label": "平遥县",
            "level": 3,
            "pid": 140700,


        }, {
            "id": 140729,
            "label": "灵石县",
            "level": 3,
            "pid": 140700,


        }, {
            "id": 140781,
            "label": "介休市",
            "level": 3,
            "pid": 140700,


        }]
    }, {
        "id": 140800,
        "label": "运城市",
        "level": 2,
        "pid": 140000,

        "children": [{
            "id": 140802,
            "label": "盐湖区",
            "level": 3,
            "pid": 140800,


        }, {
            "id": 140821,
            "label": "临猗县",
            "level": 3,
            "pid": 140800,


        }, {
            "id": 140822,
            "label": "万荣县",
            "level": 3,
            "pid": 140800,


        }, {
            "id": 140823,
            "label": "闻喜县",
            "level": 3,
            "pid": 140800,


        }, {
            "id": 140824,
            "label": "稷山县",
            "level": 3,
            "pid": 140800,


        }, {
            "id": 140825,
            "label": "新绛县",
            "level": 3,
            "pid": 140800,


        }, {
            "id": 140826,
            "label": "绛县",
            "level": 3,
            "pid": 140800,


        }, {
            "id": 140827,
            "label": "垣曲县",
            "level": 3,
            "pid": 140800,


        }, {
            "id": 140828,
            "label": "夏县",
            "level": 3,
            "pid": 140800,


        }, {
            "id": 140829,
            "label": "平陆县",
            "level": 3,
            "pid": 140800,


        }, {
            "id": 140830,
            "label": "芮城县",
            "level": 3,
            "pid": 140800,


        }, {
            "id": 140881,
            "label": "永济市",
            "level": 3,
            "pid": 140800,


        }, {
            "id": 140882,
            "label": "河津市",
            "level": 3,
            "pid": 140800,


        }]
    }, {
        "id": 140900,
        "label": "忻州市",
        "level": 2,
        "pid": 140000,

        "children": [{
            "id": 140902,
            "label": "忻府区",
            "level": 3,
            "pid": 140900,


        }, {
            "id": 140921,
            "label": "定襄县",
            "level": 3,
            "pid": 140900,


        }, {
            "id": 140922,
            "label": "五台县",
            "level": 3,
            "pid": 140900,


        }, {
            "id": 140923,
            "label": "代县",
            "level": 3,
            "pid": 140900,


        }, {
            "id": 140924,
            "label": "繁峙县",
            "level": 3,
            "pid": 140900,


        }, {
            "id": 140925,
            "label": "宁武县",
            "level": 3,
            "pid": 140900,


        }, {
            "id": 140926,
            "label": "静乐县",
            "level": 3,
            "pid": 140900,


        }, {
            "id": 140927,
            "label": "神池县",
            "level": 3,
            "pid": 140900,


        }, {
            "id": 140928,
            "label": "五寨县",
            "level": 3,
            "pid": 140900,


        }, {
            "id": 140929,
            "label": "岢岚县",
            "level": 3,
            "pid": 140900,


        }, {
            "id": 140930,
            "label": "河曲县",
            "level": 3,
            "pid": 140900,


        }, {
            "id": 140931,
            "label": "保德县",
            "level": 3,
            "pid": 140900,


        }, {
            "id": 140932,
            "label": "偏关县",
            "level": 3,
            "pid": 140900,


        }, {
            "id": 140981,
            "label": "原平市",
            "level": 3,
            "pid": 140900,


        }]
    }, {
        "id": 141000,
        "label": "临汾市",
        "level": 2,
        "pid": 140000,

        "children": [{
            "id": 141002,
            "label": "尧都区",
            "level": 3,
            "pid": 141000,


        }, {
            "id": 141021,
            "label": "曲沃县",
            "level": 3,
            "pid": 141000,


        }, {
            "id": 141022,
            "label": "翼城县",
            "level": 3,
            "pid": 141000,


        }, {
            "id": 141023,
            "label": "襄汾县",
            "level": 3,
            "pid": 141000,


        }, {
            "id": 141024,
            "label": "洪洞县",
            "level": 3,
            "pid": 141000,


        }, {
            "id": 141025,
            "label": "古县",
            "level": 3,
            "pid": 141000,


        }, {
            "id": 141026,
            "label": "安泽县",
            "level": 3,
            "pid": 141000,


        }, {
            "id": 141027,
            "label": "浮山县",
            "level": 3,
            "pid": 141000,


        }, {
            "id": 141028,
            "label": "吉县",
            "level": 3,
            "pid": 141000,


        }, {
            "id": 141029,
            "label": "乡宁县",
            "level": 3,
            "pid": 141000,


        }, {
            "id": 141030,
            "label": "大宁县",
            "level": 3,
            "pid": 141000,


        }, {
            "id": 141031,
            "label": "隰县",
            "level": 3,
            "pid": 141000,


        }, {
            "id": 141032,
            "label": "永和县",
            "level": 3,
            "pid": 141000,


        }, {
            "id": 141033,
            "label": "蒲县",
            "level": 3,
            "pid": 141000,


        }, {
            "id": 141034,
            "label": "汾西县",
            "level": 3,
            "pid": 141000,


        }, {
            "id": 141081,
            "label": "侯马市",
            "level": 3,
            "pid": 141000,


        }, {
            "id": 141082,
            "label": "霍州市",
            "level": 3,
            "pid": 141000,


        }]
    }, {
        "id": 141100,
        "label": "吕梁市",
        "level": 2,
        "pid": 140000,

        "children": [{
            "id": 141102,
            "label": "离石区",
            "level": 3,
            "pid": 141100,


        }, {
            "id": 141121,
            "label": "文水县",
            "level": 3,
            "pid": 141100,


        }, {
            "id": 141122,
            "label": "交城县",
            "level": 3,
            "pid": 141100,


        }, {
            "id": 141123,
            "label": "兴县",
            "level": 3,
            "pid": 141100,


        }, {
            "id": 141124,
            "label": "临县",
            "level": 3,
            "pid": 141100,


        }, {
            "id": 141125,
            "label": "柳林县",
            "level": 3,
            "pid": 141100,


        }, {
            "id": 141126,
            "label": "石楼县",
            "level": 3,
            "pid": 141100,


        }, {
            "id": 141127,
            "label": "岚县",
            "level": 3,
            "pid": 141100,


        }, {
            "id": 141128,
            "label": "方山县",
            "level": 3,
            "pid": 141100,


        }, {
            "id": 141129,
            "label": "中阳县",
            "level": 3,
            "pid": 141100,


        }, {
            "id": 141130,
            "label": "交口县",
            "level": 3,
            "pid": 141100,


        }, {
            "id": 141181,
            "label": "孝义市",
            "level": 3,
            "pid": 141100,


        }, {
            "id": 141182,
            "label": "汾阳市",
            "level": 3,
            "pid": 141100,


        }]
    }]
}, {
    "id": 150000,
    "label": "内蒙古自治区",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 150100,
        "label": "呼和浩特市",
        "level": 2,
        "pid": 150000,

        "children": [{
            "id": 150102,
            "label": "新城区",
            "level": 3,
            "pid": 150100,


        }, {
            "id": 150103,
            "label": "回民区",
            "level": 3,
            "pid": 150100,


        }, {
            "id": 150104,
            "label": "玉泉区",
            "level": 3,
            "pid": 150100,


        }, {
            "id": 150105,
            "label": "赛罕区",
            "level": 3,
            "pid": 150100,


        }, {
            "id": 150121,
            "label": "土默特左旗",
            "level": 3,
            "pid": 150100,


        }, {
            "id": 150122,
            "label": "托克托县",
            "level": 3,
            "pid": 150100,


        }, {
            "id": 150123,
            "label": "和林格尔县",
            "level": 3,
            "pid": 150100,


        }, {
            "id": 150124,
            "label": "清水河县",
            "level": 3,
            "pid": 150100,


        }, {
            "id": 150125,
            "label": "武川县",
            "level": 3,
            "pid": 150100,


        }]
    }, {
        "id": 150200,
        "label": "包头市",
        "level": 2,
        "pid": 150000,

        "children": [{
            "id": 150202,
            "label": "东河区",
            "level": 3,
            "pid": 150200,


        }, {
            "id": 150203,
            "label": "昆都仑区",
            "level": 3,
            "pid": 150200,


        }, {
            "id": 150204,
            "label": "青山区",
            "level": 3,
            "pid": 150200,


        }, {
            "id": 150205,
            "label": "石拐区",
            "level": 3,
            "pid": 150200,


        }, {
            "id": 150206,
            "label": "白云鄂博矿区",
            "level": 3,
            "pid": 150200,


        }, {
            "id": 150207,
            "label": "九原区",
            "level": 3,
            "pid": 150200,


        }, {
            "id": 150221,
            "label": "土默特右旗",
            "level": 3,
            "pid": 150200,


        }, {
            "id": 150222,
            "label": "固阳县",
            "level": 3,
            "pid": 150200,


        }, {
            "id": 150223,
            "label": "达尔罕茂明安联合旗",
            "level": 3,
            "pid": 150200,


        }]
    }, {
        "id": 150300,
        "label": "乌海市",
        "level": 2,
        "pid": 150000,

        "children": [{
            "id": 150302,
            "label": "海勃湾区",
            "level": 3,
            "pid": 150300,


        }, {
            "id": 150303,
            "label": "海南区",
            "level": 3,
            "pid": 150300,


        }, {
            "id": 150304,
            "label": "乌达区",
            "level": 3,
            "pid": 150300,


        }]
    }, {
        "id": 150400,
        "label": "赤峰市",
        "level": 2,
        "pid": 150000,

        "children": [{
            "id": 150402,
            "label": "红山区",
            "level": 3,
            "pid": 150400,


        }, {
            "id": 150403,
            "label": "元宝山区",
            "level": 3,
            "pid": 150400,


        }, {
            "id": 150404,
            "label": "松山区",
            "level": 3,
            "pid": 150400,


        }, {
            "id": 150421,
            "label": "阿鲁科尔沁旗",
            "level": 3,
            "pid": 150400,


        }, {
            "id": 150422,
            "label": "巴林左旗",
            "level": 3,
            "pid": 150400,


        }, {
            "id": 150423,
            "label": "巴林右旗",
            "level": 3,
            "pid": 150400,


        }, {
            "id": 150424,
            "label": "林西县",
            "level": 3,
            "pid": 150400,


        }, {
            "id": 150425,
            "label": "克什克腾旗",
            "level": 3,
            "pid": 150400,


        }, {
            "id": 150426,
            "label": "翁牛特旗",
            "level": 3,
            "pid": 150400,


        }, {
            "id": 150428,
            "label": "喀喇沁旗",
            "level": 3,
            "pid": 150400,


        }, {
            "id": 150429,
            "label": "宁城县",
            "level": 3,
            "pid": 150400,


        }, {
            "id": 150430,
            "label": "敖汉旗",
            "level": 3,
            "pid": 150400,


        }]
    }, {
        "id": 150500,
        "label": "通辽市",
        "level": 2,
        "pid": 150000,

        "children": [{
            "id": 150502,
            "label": "科尔沁区",
            "level": 3,
            "pid": 150500,


        }, {
            "id": 150521,
            "label": "科尔沁左翼中旗",
            "level": 3,
            "pid": 150500,


        }, {
            "id": 150522,
            "label": "科尔沁左翼后旗",
            "level": 3,
            "pid": 150500,


        }, {
            "id": 150523,
            "label": "开鲁县",
            "level": 3,
            "pid": 150500,


        }, {
            "id": 150524,
            "label": "库伦旗",
            "level": 3,
            "pid": 150500,


        }, {
            "id": 150525,
            "label": "奈曼旗",
            "level": 3,
            "pid": 150500,


        }, {
            "id": 150526,
            "label": "扎鲁特旗",
            "level": 3,
            "pid": 150500,


        }, {
            "id": 150581,
            "label": "霍林郭勒市",
            "level": 3,
            "pid": 150500,


        }]
    }, {
        "id": 150600,
        "label": "鄂尔多斯市",
        "level": 2,
        "pid": 150000,

        "children": [{
            "id": 150602,
            "label": "东胜区",
            "level": 3,
            "pid": 150600,


        }, {
            "id": 150621,
            "label": "达拉特旗",
            "level": 3,
            "pid": 150600,


        }, {
            "id": 150622,
            "label": "准格尔旗",
            "level": 3,
            "pid": 150600,


        }, {
            "id": 150623,
            "label": "鄂托克前旗",
            "level": 3,
            "pid": 150600,


        }, {
            "id": 150624,
            "label": "鄂托克旗",
            "level": 3,
            "pid": 150600,


        }, {
            "id": 150625,
            "label": "杭锦旗",
            "level": 3,
            "pid": 150600,


        }, {
            "id": 150626,
            "label": "乌审旗",
            "level": 3,
            "pid": 150600,


        }, {
            "id": 150627,
            "label": "伊金霍洛旗",
            "level": 3,
            "pid": 150600,


        }]
    }, {
        "id": 150700,
        "label": "呼伦贝尔市",
        "level": 2,
        "pid": 150000,

        "children": [{
            "id": 150702,
            "label": "海拉尔区",
            "level": 3,
            "pid": 150700,


        }, {
            "id": 150703,
            "label": "扎赉诺尔区",
            "level": 3,
            "pid": 150700,


        }, {
            "id": 150721,
            "label": "阿荣旗",
            "level": 3,
            "pid": 150700,


        }, {
            "id": 150722,
            "label": "莫力达瓦达斡尔族自治旗",
            "level": 3,
            "pid": 150700,


        }, {
            "id": 150723,
            "label": "鄂伦春自治旗",
            "level": 3,
            "pid": 150700,


        }, {
            "id": 150724,
            "label": "鄂温克族自治旗",
            "level": 3,
            "pid": 150700,


        }, {
            "id": 150725,
            "label": "陈巴尔虎旗",
            "level": 3,
            "pid": 150700,


        }, {
            "id": 150726,
            "label": "新巴尔虎左旗",
            "level": 3,
            "pid": 150700,


        }, {
            "id": 150727,
            "label": "新巴尔虎右旗",
            "level": 3,
            "pid": 150700,


        }, {
            "id": 150781,
            "label": "满洲里市",
            "level": 3,
            "pid": 150700,


        }, {
            "id": 150782,
            "label": "牙克石市",
            "level": 3,
            "pid": 150700,


        }, {
            "id": 150783,
            "label": "扎兰屯市",
            "level": 3,
            "pid": 150700,


        }, {
            "id": 150784,
            "label": "额尔古纳市",
            "level": 3,
            "pid": 150700,


        }, {
            "id": 150785,
            "label": "根河市",
            "level": 3,
            "pid": 150700,


        }]
    }, {
        "id": 150800,
        "label": "巴彦淖尔市",
        "level": 2,
        "pid": 150000,

        "children": [{
            "id": 150802,
            "label": "临河区",
            "level": 3,
            "pid": 150800,


        }, {
            "id": 150821,
            "label": "五原县",
            "level": 3,
            "pid": 150800,


        }, {
            "id": 150822,
            "label": "磴口县",
            "level": 3,
            "pid": 150800,


        }, {
            "id": 150823,
            "label": "乌拉特前旗",
            "level": 3,
            "pid": 150800,


        }, {
            "id": 150824,
            "label": "乌拉特中旗",
            "level": 3,
            "pid": 150800,


        }, {
            "id": 150825,
            "label": "乌拉特后旗",
            "level": 3,
            "pid": 150800,


        }, {
            "id": 150826,
            "label": "杭锦后旗",
            "level": 3,
            "pid": 150800,


        }]
    }, {
        "id": 150900,
        "label": "乌兰察布市",
        "level": 2,
        "pid": 150000,

        "children": [{
            "id": 150902,
            "label": "集宁区",
            "level": 3,
            "pid": 150900,


        }, {
            "id": 150921,
            "label": "卓资县",
            "level": 3,
            "pid": 150900,


        }, {
            "id": 150922,
            "label": "化德县",
            "level": 3,
            "pid": 150900,


        }, {
            "id": 150923,
            "label": "商都县",
            "level": 3,
            "pid": 150900,


        }, {
            "id": 150924,
            "label": "兴和县",
            "level": 3,
            "pid": 150900,


        }, {
            "id": 150925,
            "label": "凉城县",
            "level": 3,
            "pid": 150900,


        }, {
            "id": 150926,
            "label": "察哈尔右翼前旗",
            "level": 3,
            "pid": 150900,


        }, {
            "id": 150927,
            "label": "察哈尔右翼中旗",
            "level": 3,
            "pid": 150900,


        }, {
            "id": 150928,
            "label": "察哈尔右翼后旗",
            "level": 3,
            "pid": 150900,


        }, {
            "id": 150929,
            "label": "四子王旗",
            "level": 3,
            "pid": 150900,


        }, {
            "id": 150981,
            "label": "丰镇市",
            "level": 3,
            "pid": 150900,


        }]
    }, {
        "id": 152200,
        "label": "兴安盟",
        "level": 2,
        "pid": 150000,

        "children": [{
            "id": 152201,
            "label": "乌兰浩特市",
            "level": 3,
            "pid": 152200,


        }, {
            "id": 152202,
            "label": "阿尔山市",
            "level": 3,
            "pid": 152200,


        }, {
            "id": 152221,
            "label": "科尔沁右翼前旗",
            "level": 3,
            "pid": 152200,


        }, {
            "id": 152222,
            "label": "科尔沁右翼中旗",
            "level": 3,
            "pid": 152200,


        }, {
            "id": 152223,
            "label": "扎赉特旗",
            "level": 3,
            "pid": 152200,


        }, {
            "id": 152224,
            "label": "突泉县",
            "level": 3,
            "pid": 152200,


        }]
    }, {
        "id": 152500,
        "label": "锡林郭勒盟",
        "level": 2,
        "pid": 150000,

        "children": [{
            "id": 152501,
            "label": "二连浩特市",
            "level": 3,
            "pid": 152500,


        }, {
            "id": 152502,
            "label": "锡林浩特市",
            "level": 3,
            "pid": 152500,


        }, {
            "id": 152522,
            "label": "阿巴嘎旗",
            "level": 3,
            "pid": 152500,


        }, {
            "id": 152523,
            "label": "苏尼特左旗",
            "level": 3,
            "pid": 152500,


        }, {
            "id": 152524,
            "label": "苏尼特右旗",
            "level": 3,
            "pid": 152500,


        }, {
            "id": 152525,
            "label": "东乌珠穆沁旗",
            "level": 3,
            "pid": 152500,


        }, {
            "id": 152526,
            "label": "西乌珠穆沁旗",
            "level": 3,
            "pid": 152500,


        }, {
            "id": 152527,
            "label": "太仆寺旗",
            "level": 3,
            "pid": 152500,


        }, {
            "id": 152528,
            "label": "镶黄旗",
            "level": 3,
            "pid": 152500,


        }, {
            "id": 152529,
            "label": "正镶白旗",
            "level": 3,
            "pid": 152500,


        }, {
            "id": 152530,
            "label": "正蓝旗",
            "level": 3,
            "pid": 152500,


        }, {
            "id": 152531,
            "label": "多伦县",
            "level": 3,
            "pid": 152500,


        }]
    }, {
        "id": 152900,
        "label": "阿拉善盟",
        "level": 2,
        "pid": 150000,

        "children": [{
            "id": 152921,
            "label": "阿拉善左旗",
            "level": 3,
            "pid": 152900,


        }, {
            "id": 152922,
            "label": "阿拉善右旗",
            "level": 3,
            "pid": 152900,


        }, {
            "id": 152923,
            "label": "额济纳旗",
            "level": 3,
            "pid": 152900,


        }]
    }]
}, {
    "id": 210000,
    "label": "辽宁省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 210100,
        "label": "沈阳市",
        "level": 2,
        "pid": 210000,

        "children": [{
            "id": 210102,
            "label": "和平区",
            "level": 3,
            "pid": 210100,


        }, {
            "id": 210103,
            "label": "沈河区",
            "level": 3,
            "pid": 210100,


        }, {
            "id": 210104,
            "label": "大东区",
            "level": 3,
            "pid": 210100,


        }, {
            "id": 210105,
            "label": "皇姑区",
            "level": 3,
            "pid": 210100,


        }, {
            "id": 210106,
            "label": "铁西区",
            "level": 3,
            "pid": 210100,


        }, {
            "id": 210111,
            "label": "苏家屯区",
            "level": 3,
            "pid": 210100,


        }, {
            "id": 210112,
            "label": "浑南区",
            "level": 3,
            "pid": 210100,


        }, {
            "id": 210113,
            "label": "沈北新区",
            "level": 3,
            "pid": 210100,


        }, {
            "id": 210114,
            "label": "于洪区",
            "level": 3,
            "pid": 210100,


        }, {
            "id": 210122,
            "label": "辽中县",
            "level": 3,
            "pid": 210100,


        }, {
            "id": 210123,
            "label": "康平县",
            "level": 3,
            "pid": 210100,


        }, {
            "id": 210124,
            "label": "法库县",
            "level": 3,
            "pid": 210100,


        }, {
            "id": 210181,
            "label": "新民市",
            "level": 3,
            "pid": 210100,


        }]
    }, {
        "id": 210200,
        "label": "大连市",
        "level": 2,
        "pid": 210000,

        "children": [{
            "id": 210202,
            "label": "中山区",
            "level": 3,
            "pid": 210200,


        }, {
            "id": 210203,
            "label": "西岗区",
            "level": 3,
            "pid": 210200,


        }, {
            "id": 210204,
            "label": "沙河口区",
            "level": 3,
            "pid": 210200,


        }, {
            "id": 210211,
            "label": "甘井子区",
            "level": 3,
            "pid": 210200,


        }, {
            "id": 210212,
            "label": "旅顺口区",
            "level": 3,
            "pid": 210200,


        }, {
            "id": 210213,
            "label": "金州区",
            "level": 3,
            "pid": 210200,


        }, {
            "id": 210224,
            "label": "长海县",
            "level": 3,
            "pid": 210200,


        }, {
            "id": 210281,
            "label": "瓦房店市",
            "level": 3,
            "pid": 210200,


        }, {
            "id": 210282,
            "label": "普兰店市",
            "level": 3,
            "pid": 210200,


        }, {
            "id": 210283,
            "label": "庄河市",
            "level": 3,
            "pid": 210200,


        }]
    }, {
        "id": 210300,
        "label": "鞍山市",
        "level": 2,
        "pid": 210000,

        "children": [{
            "id": 210302,
            "label": "铁东区",
            "level": 3,
            "pid": 210300,


        }, {
            "id": 210303,
            "label": "铁西区",
            "level": 3,
            "pid": 210300,


        }, {
            "id": 210304,
            "label": "立山区",
            "level": 3,
            "pid": 210300,


        }, {
            "id": 210311,
            "label": "千山区",
            "level": 3,
            "pid": 210300,


        }, {
            "id": 210321,
            "label": "台安县",
            "level": 3,
            "pid": 210300,


        }, {
            "id": 210323,
            "label": "岫岩满族自治县",
            "level": 3,
            "pid": 210300,


        }, {
            "id": 210381,
            "label": "海城市",
            "level": 3,
            "pid": 210300,


        }]
    }, {
        "id": 210400,
        "label": "抚顺市",
        "level": 2,
        "pid": 210000,

        "children": [{
            "id": 210402,
            "label": "新抚区",
            "level": 3,
            "pid": 210400,


        }, {
            "id": 210403,
            "label": "东洲区",
            "level": 3,
            "pid": 210400,


        }, {
            "id": 210404,
            "label": "望花区",
            "level": 3,
            "pid": 210400,


        }, {
            "id": 210411,
            "label": "顺城区",
            "level": 3,
            "pid": 210400,


        }, {
            "id": 210421,
            "label": "抚顺县",
            "level": 3,
            "pid": 210400,


        }, {
            "id": 210422,
            "label": "新宾满族自治县",
            "level": 3,
            "pid": 210400,


        }, {
            "id": 210423,
            "label": "清原满族自治县",
            "level": 3,
            "pid": 210400,


        }]
    }, {
        "id": 210500,
        "label": "本溪市",
        "level": 2,
        "pid": 210000,

        "children": [{
            "id": 210502,
            "label": "平山区",
            "level": 3,
            "pid": 210500,


        }, {
            "id": 210503,
            "label": "溪湖区",
            "level": 3,
            "pid": 210500,


        }, {
            "id": 210504,
            "label": "明山区",
            "level": 3,
            "pid": 210500,


        }, {
            "id": 210505,
            "label": "南芬区",
            "level": 3,
            "pid": 210500,


        }, {
            "id": 210521,
            "label": "本溪满族自治县",
            "level": 3,
            "pid": 210500,


        }, {
            "id": 210522,
            "label": "桓仁满族自治县",
            "level": 3,
            "pid": 210500,


        }]
    }, {
        "id": 210600,
        "label": "丹东市",
        "level": 2,
        "pid": 210000,

        "children": [{
            "id": 210602,
            "label": "元宝区",
            "level": 3,
            "pid": 210600,


        }, {
            "id": 210603,
            "label": "振兴区",
            "level": 3,
            "pid": 210600,


        }, {
            "id": 210604,
            "label": "振安区",
            "level": 3,
            "pid": 210600,


        }, {
            "id": 210624,
            "label": "宽甸满族自治县",
            "level": 3,
            "pid": 210600,


        }, {
            "id": 210681,
            "label": "东港市",
            "level": 3,
            "pid": 210600,


        }, {
            "id": 210682,
            "label": "凤城市",
            "level": 3,
            "pid": 210600,


        }]
    }, {
        "id": 210700,
        "label": "锦州市",
        "level": 2,
        "pid": 210000,

        "children": [{
            "id": 210702,
            "label": "古塔区",
            "level": 3,
            "pid": 210700,


        }, {
            "id": 210703,
            "label": "凌河区",
            "level": 3,
            "pid": 210700,


        }, {
            "id": 210711,
            "label": "太和区",
            "level": 3,
            "pid": 210700,


        }, {
            "id": 210726,
            "label": "黑山县",
            "level": 3,
            "pid": 210700,


        }, {
            "id": 210727,
            "label": "义县",
            "level": 3,
            "pid": 210700,


        }, {
            "id": 210781,
            "label": "凌海市",
            "level": 3,
            "pid": 210700,


        }, {
            "id": 210782,
            "label": "北镇市",
            "level": 3,
            "pid": 210700,


        }]
    }, {
        "id": 210800,
        "label": "营口市",
        "level": 2,
        "pid": 210000,

        "children": [{
            "id": 210802,
            "label": "站前区",
            "level": 3,
            "pid": 210800,


        }, {
            "id": 210803,
            "label": "西市区",
            "level": 3,
            "pid": 210800,


        }, {
            "id": 210804,
            "label": "鲅鱼圈区",
            "level": 3,
            "pid": 210800,


        }, {
            "id": 210811,
            "label": "老边区",
            "level": 3,
            "pid": 210800,


        }, {
            "id": 210881,
            "label": "盖州市",
            "level": 3,
            "pid": 210800,


        }, {
            "id": 210882,
            "label": "大石桥市",
            "level": 3,
            "pid": 210800,


        }]
    }, {
        "id": 210900,
        "label": "阜新市",
        "level": 2,
        "pid": 210000,

        "children": [{
            "id": 210902,
            "label": "海州区",
            "level": 3,
            "pid": 210900,


        }, {
            "id": 210903,
            "label": "新邱区",
            "level": 3,
            "pid": 210900,


        }, {
            "id": 210904,
            "label": "太平区",
            "level": 3,
            "pid": 210900,


        }, {
            "id": 210905,
            "label": "清河门区",
            "level": 3,
            "pid": 210900,


        }, {
            "id": 210911,
            "label": "细河区",
            "level": 3,
            "pid": 210900,


        }, {
            "id": 210921,
            "label": "阜新蒙古族自治县",
            "level": 3,
            "pid": 210900,


        }, {
            "id": 210922,
            "label": "彰武县",
            "level": 3,
            "pid": 210900,


        }]
    }, {
        "id": 211000,
        "label": "辽阳市",
        "level": 2,
        "pid": 210000,

        "children": [{
            "id": 211002,
            "label": "白塔区",
            "level": 3,
            "pid": 211000,


        }, {
            "id": 211003,
            "label": "文圣区",
            "level": 3,
            "pid": 211000,


        }, {
            "id": 211004,
            "label": "宏伟区",
            "level": 3,
            "pid": 211000,


        }, {
            "id": 211005,
            "label": "弓长岭区",
            "level": 3,
            "pid": 211000,


        }, {
            "id": 211011,
            "label": "太子河区",
            "level": 3,
            "pid": 211000,


        }, {
            "id": 211021,
            "label": "辽阳县",
            "level": 3,
            "pid": 211000,


        }, {
            "id": 211081,
            "label": "灯塔市",
            "level": 3,
            "pid": 211000,


        }]
    }, {
        "id": 211100,
        "label": "盘锦市",
        "level": 2,
        "pid": 210000,

        "children": [{
            "id": 211102,
            "label": "双台子区",
            "level": 3,
            "pid": 211100,


        }, {
            "id": 211103,
            "label": "兴隆台区",
            "level": 3,
            "pid": 211100,


        }, {
            "id": 211121,
            "label": "大洼县",
            "level": 3,
            "pid": 211100,


        }, {
            "id": 211122,
            "label": "盘山县",
            "level": 3,
            "pid": 211100,


        }]
    }, {
        "id": 211200,
        "label": "铁岭市",
        "level": 2,
        "pid": 210000,

        "children": [{
            "id": 211202,
            "label": "银州区",
            "level": 3,
            "pid": 211200,


        }, {
            "id": 211204,
            "label": "清河区",
            "level": 3,
            "pid": 211200,


        }, {
            "id": 211221,
            "label": "铁岭县",
            "level": 3,
            "pid": 211200,


        }, {
            "id": 211223,
            "label": "西丰县",
            "level": 3,
            "pid": 211200,


        }, {
            "id": 211224,
            "label": "昌图县",
            "level": 3,
            "pid": 211200,


        }, {
            "id": 211281,
            "label": "调兵山市",
            "level": 3,
            "pid": 211200,


        }, {
            "id": 211282,
            "label": "开原市",
            "level": 3,
            "pid": 211200,


        }]
    }, {
        "id": 211300,
        "label": "朝阳市",
        "level": 2,
        "pid": 210000,

        "children": [{
            "id": 211302,
            "label": "双塔区",
            "level": 3,
            "pid": 211300,


        }, {
            "id": 211303,
            "label": "龙城区",
            "level": 3,
            "pid": 211300,


        }, {
            "id": 211321,
            "label": "朝阳县",
            "level": 3,
            "pid": 211300,


        }, {
            "id": 211322,
            "label": "建平县",
            "level": 3,
            "pid": 211300,


        }, {
            "id": 211324,
            "label": "喀喇沁左翼蒙古族自治县",
            "level": 3,
            "pid": 211300,


        }, {
            "id": 211381,
            "label": "北票市",
            "level": 3,
            "pid": 211300,


        }, {
            "id": 211382,
            "label": "凌源市",
            "level": 3,
            "pid": 211300,


        }]
    }, {
        "id": 211400,
        "label": "葫芦岛市",
        "level": 2,
        "pid": 210000,

        "children": [{
            "id": 211402,
            "label": "连山区",
            "level": 3,
            "pid": 211400,


        }, {
            "id": 211403,
            "label": "龙港区",
            "level": 3,
            "pid": 211400,


        }, {
            "id": 211404,
            "label": "南票区",
            "level": 3,
            "pid": 211400,


        }, {
            "id": 211421,
            "label": "绥中县",
            "level": 3,
            "pid": 211400,


        }, {
            "id": 211422,
            "label": "建昌县",
            "level": 3,
            "pid": 211400,


        }, {
            "id": 211481,
            "label": "兴城市",
            "level": 3,
            "pid": 211400,


        }]
    }, {
        "id": 211500,
        "label": "金普新区",
        "level": 2,
        "pid": 210000,

        "children": [{
            "id": 211501,
            "label": "金州新区",
            "level": 3,
            "pid": 211500,


        }, {
            "id": 211502,
            "label": "普湾新区",
            "level": 3,
            "pid": 211500,


        }, {
            "id": 211503,
            "label": "保税区",
            "level": 3,
            "pid": 211500,


        }]
    }]
}, {
    "id": 220000,
    "label": "吉林省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 220100,
        "label": "长春市",
        "level": 2,
        "pid": 220000,

        "children": [{
            "id": 220102,
            "label": "南关区",
            "level": 3,
            "pid": 220100,


        }, {
            "id": 220103,
            "label": "宽城区",
            "level": 3,
            "pid": 220100,


        }, {
            "id": 220104,
            "label": "朝阳区",
            "level": 3,
            "pid": 220100,


        }, {
            "id": 220105,
            "label": "二道区",
            "level": 3,
            "pid": 220100,


        }, {
            "id": 220106,
            "label": "绿园区",
            "level": 3,
            "pid": 220100,


        }, {
            "id": 220112,
            "label": "双阳区",
            "level": 3,
            "pid": 220100,


        }, {
            "id": 220113,
            "label": "九台区",
            "level": 3,
            "pid": 220100,


        }, {
            "id": 220122,
            "label": "农安县",
            "level": 3,
            "pid": 220100,


        }, {
            "id": 220182,
            "label": "榆树市",
            "level": 3,
            "pid": 220100,


        }, {
            "id": 220183,
            "label": "德惠市",
            "level": 3,
            "pid": 220100,


        }]
    }, {
        "id": 220200,
        "label": "吉林市",
        "level": 2,
        "pid": 220000,

        "children": [{
            "id": 220202,
            "label": "昌邑区",
            "level": 3,
            "pid": 220200,


        }, {
            "id": 220203,
            "label": "龙潭区",
            "level": 3,
            "pid": 220200,


        }, {
            "id": 220204,
            "label": "船营区",
            "level": 3,
            "pid": 220200,


        }, {
            "id": 220211,
            "label": "丰满区",
            "level": 3,
            "pid": 220200,


        }, {
            "id": 220221,
            "label": "永吉县",
            "level": 3,
            "pid": 220200,


        }, {
            "id": 220281,
            "label": "蛟河市",
            "level": 3,
            "pid": 220200,


        }, {
            "id": 220282,
            "label": "桦甸市",
            "level": 3,
            "pid": 220200,


        }, {
            "id": 220283,
            "label": "舒兰市",
            "level": 3,
            "pid": 220200,


        }, {
            "id": 220284,
            "label": "磐石市",
            "level": 3,
            "pid": 220200,


        }]
    }, {
        "id": 220300,
        "label": "四平市",
        "level": 2,
        "pid": 220000,

        "children": [{
            "id": 220302,
            "label": "铁西区",
            "level": 3,
            "pid": 220300,


        }, {
            "id": 220303,
            "label": "铁东区",
            "level": 3,
            "pid": 220300,


        }, {
            "id": 220322,
            "label": "梨树县",
            "level": 3,
            "pid": 220300,


        }, {
            "id": 220323,
            "label": "伊通满族自治县",
            "level": 3,
            "pid": 220300,


        }, {
            "id": 220381,
            "label": "公主岭市",
            "level": 3,
            "pid": 220300,


        }, {
            "id": 220382,
            "label": "双辽市",
            "level": 3,
            "pid": 220300,


        }]
    }, {
        "id": 220400,
        "label": "辽源市",
        "level": 2,
        "pid": 220000,

        "children": [{
            "id": 220402,
            "label": "龙山区",
            "level": 3,
            "pid": 220400,


        }, {
            "id": 220403,
            "label": "西安区",
            "level": 3,
            "pid": 220400,


        }, {
            "id": 220421,
            "label": "东丰县",
            "level": 3,
            "pid": 220400,


        }, {
            "id": 220422,
            "label": "东辽县",
            "level": 3,
            "pid": 220400,


        }]
    }, {
        "id": 220500,
        "label": "通化市",
        "level": 2,
        "pid": 220000,

        "children": [{
            "id": 220502,
            "label": "东昌区",
            "level": 3,
            "pid": 220500,


        }, {
            "id": 220503,
            "label": "二道江区",
            "level": 3,
            "pid": 220500,


        }, {
            "id": 220521,
            "label": "通化县",
            "level": 3,
            "pid": 220500,


        }, {
            "id": 220523,
            "label": "辉南县",
            "level": 3,
            "pid": 220500,


        }, {
            "id": 220524,
            "label": "柳河县",
            "level": 3,
            "pid": 220500,


        }, {
            "id": 220581,
            "label": "梅河口市",
            "level": 3,
            "pid": 220500,


        }, {
            "id": 220582,
            "label": "集安市",
            "level": 3,
            "pid": 220500,


        }]
    }, {
        "id": 220600,
        "label": "白山市",
        "level": 2,
        "pid": 220000,

        "children": [{
            "id": 220602,
            "label": "浑江区",
            "level": 3,
            "pid": 220600,


        }, {
            "id": 220605,
            "label": "江源区",
            "level": 3,
            "pid": 220600,


        }, {
            "id": 220621,
            "label": "抚松县",
            "level": 3,
            "pid": 220600,


        }, {
            "id": 220622,
            "label": "靖宇县",
            "level": 3,
            "pid": 220600,


        }, {
            "id": 220623,
            "label": "长白朝鲜族自治县",
            "level": 3,
            "pid": 220600,


        }, {
            "id": 220681,
            "label": "临江市",
            "level": 3,
            "pid": 220600,


        }]
    }, {
        "id": 220700,
        "label": "松原市",
        "level": 2,
        "pid": 220000,

        "children": [{
            "id": 220702,
            "label": "宁江区",
            "level": 3,
            "pid": 220700,


        }, {
            "id": 220721,
            "label": "前郭尔罗斯蒙古族自治县",
            "level": 3,
            "pid": 220700,


        }, {
            "id": 220722,
            "label": "长岭县",
            "level": 3,
            "pid": 220700,


        }, {
            "id": 220723,
            "label": "乾安县",
            "level": 3,
            "pid": 220700,


        }, {
            "id": 220781,
            "label": "扶余市",
            "level": 3,
            "pid": 220700,


        }]
    }, {
        "id": 220800,
        "label": "白城市",
        "level": 2,
        "pid": 220000,

        "children": [{
            "id": 220802,
            "label": "洮北区",
            "level": 3,
            "pid": 220800,


        }, {
            "id": 220821,
            "label": "镇赉县",
            "level": 3,
            "pid": 220800,


        }, {
            "id": 220822,
            "label": "通榆县",
            "level": 3,
            "pid": 220800,


        }, {
            "id": 220881,
            "label": "洮南市",
            "level": 3,
            "pid": 220800,


        }, {
            "id": 220882,
            "label": "大安市",
            "level": 3,
            "pid": 220800,


        }]
    }, {
        "id": 222400,
        "label": "延边朝鲜族自治州",
        "level": 2,
        "pid": 220000,

        "children": [{
            "id": 222401,
            "label": "延吉市",
            "level": 3,
            "pid": 222400,


        }, {
            "id": 222402,
            "label": "图们市",
            "level": 3,
            "pid": 222400,


        }, {
            "id": 222403,
            "label": "敦化市",
            "level": 3,
            "pid": 222400,


        }, {
            "id": 222404,
            "label": "珲春市",
            "level": 3,
            "pid": 222400,


        }, {
            "id": 222405,
            "label": "龙井市",
            "level": 3,
            "pid": 222400,


        }, {
            "id": 222406,
            "label": "和龙市",
            "level": 3,
            "pid": 222400,


        }, {
            "id": 222424,
            "label": "汪清县",
            "level": 3,
            "pid": 222400,


        }, {
            "id": 222426,
            "label": "安图县",
            "level": 3,
            "pid": 222400,


        }]
    }]
}, {
    "id": 230000,
    "label": "黑龙江省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 230100,
        "label": "哈尔滨市",
        "level": 2,
        "pid": 230000,

        "children": [{
            "id": 230102,
            "label": "道里区",
            "level": 3,
            "pid": 230100,


        }, {
            "id": 230103,
            "label": "南岗区",
            "level": 3,
            "pid": 230100,


        }, {
            "id": 230104,
            "label": "道外区",
            "level": 3,
            "pid": 230100,


        }, {
            "id": 230108,
            "label": "平房区",
            "level": 3,
            "pid": 230100,


        }, {
            "id": 230109,
            "label": "松北区",
            "level": 3,
            "pid": 230100,


        }, {
            "id": 230110,
            "label": "香坊区",
            "level": 3,
            "pid": 230100,


        }, {
            "id": 230111,
            "label": "呼兰区",
            "level": 3,
            "pid": 230100,


        }, {
            "id": 230112,
            "label": "阿城区",
            "level": 3,
            "pid": 230100,


        }, {
            "id": 230113,
            "label": "双城区",
            "level": 3,
            "pid": 230100,


        }, {
            "id": 230123,
            "label": "依兰县",
            "level": 3,
            "pid": 230100,


        }, {
            "id": 230124,
            "label": "方正县",
            "level": 3,
            "pid": 230100,


        }, {
            "id": 230125,
            "label": "宾县",
            "level": 3,
            "pid": 230100,


        }, {
            "id": 230126,
            "label": "巴彦县",
            "level": 3,
            "pid": 230100,


        }, {
            "id": 230127,
            "label": "木兰县",
            "level": 3,
            "pid": 230100,


        }, {
            "id": 230128,
            "label": "通河县",
            "level": 3,
            "pid": 230100,


        }, {
            "id": 230129,
            "label": "延寿县",
            "level": 3,
            "pid": 230100,


        }, {
            "id": 230183,
            "label": "尚志市",
            "level": 3,
            "pid": 230100,


        }, {
            "id": 230184,
            "label": "五常市",
            "level": 3,
            "pid": 230100,


        }]
    }, {
        "id": 230200,
        "label": "齐齐哈尔市",
        "level": 2,
        "pid": 230000,

        "children": [{
            "id": 230202,
            "label": "龙沙区",
            "level": 3,
            "pid": 230200,


        }, {
            "id": 230203,
            "label": "建华区",
            "level": 3,
            "pid": 230200,


        }, {
            "id": 230204,
            "label": "铁锋区",
            "level": 3,
            "pid": 230200,


        }, {
            "id": 230205,
            "label": "昂昂溪区",
            "level": 3,
            "pid": 230200,


        }, {
            "id": 230206,
            "label": "富拉尔基区",
            "level": 3,
            "pid": 230200,


        }, {
            "id": 230207,
            "label": "碾子山区",
            "level": 3,
            "pid": 230200,


        }, {
            "id": 230208,
            "label": "梅里斯达斡尔族区",
            "level": 3,
            "pid": 230200,


        }, {
            "id": 230221,
            "label": "龙江县",
            "level": 3,
            "pid": 230200,


        }, {
            "id": 230223,
            "label": "依安县",
            "level": 3,
            "pid": 230200,


        }, {
            "id": 230224,
            "label": "泰来县",
            "level": 3,
            "pid": 230200,


        }, {
            "id": 230225,
            "label": "甘南县",
            "level": 3,
            "pid": 230200,


        }, {
            "id": 230227,
            "label": "富裕县",
            "level": 3,
            "pid": 230200,


        }, {
            "id": 230229,
            "label": "克山县",
            "level": 3,
            "pid": 230200,


        }, {
            "id": 230230,
            "label": "克东县",
            "level": 3,
            "pid": 230200,


        }, {
            "id": 230231,
            "label": "拜泉县",
            "level": 3,
            "pid": 230200,


        }, {
            "id": 230281,
            "label": "讷河市",
            "level": 3,
            "pid": 230200,


        }]
    }, {
        "id": 230300,
        "label": "鸡西市",
        "level": 2,
        "pid": 230000,

        "children": [{
            "id": 230302,
            "label": "鸡冠区",
            "level": 3,
            "pid": 230300,


        }, {
            "id": 230303,
            "label": "恒山区",
            "level": 3,
            "pid": 230300,


        }, {
            "id": 230304,
            "label": "滴道区",
            "level": 3,
            "pid": 230300,


        }, {
            "id": 230305,
            "label": "梨树区",
            "level": 3,
            "pid": 230300,


        }, {
            "id": 230306,
            "label": "城子河区",
            "level": 3,
            "pid": 230300,


        }, {
            "id": 230307,
            "label": "麻山区",
            "level": 3,
            "pid": 230300,


        }, {
            "id": 230321,
            "label": "鸡东县",
            "level": 3,
            "pid": 230300,


        }, {
            "id": 230381,
            "label": "虎林市",
            "level": 3,
            "pid": 230300,


        }, {
            "id": 230382,
            "label": "密山市",
            "level": 3,
            "pid": 230300,


        }]
    }, {
        "id": 230400,
        "label": "鹤岗市",
        "level": 2,
        "pid": 230000,

        "children": [{
            "id": 230402,
            "label": "向阳区",
            "level": 3,
            "pid": 230400,


        }, {
            "id": 230403,
            "label": "工农区",
            "level": 3,
            "pid": 230400,


        }, {
            "id": 230404,
            "label": "南山区",
            "level": 3,
            "pid": 230400,


        }, {
            "id": 230405,
            "label": "兴安区",
            "level": 3,
            "pid": 230400,


        }, {
            "id": 230406,
            "label": "东山区",
            "level": 3,
            "pid": 230400,


        }, {
            "id": 230407,
            "label": "兴山区",
            "level": 3,
            "pid": 230400,


        }, {
            "id": 230421,
            "label": "萝北县",
            "level": 3,
            "pid": 230400,


        }, {
            "id": 230422,
            "label": "绥滨县",
            "level": 3,
            "pid": 230400,


        }]
    }, {
        "id": 230500,
        "label": "双鸭山市",
        "level": 2,
        "pid": 230000,

        "children": [{
            "id": 230502,
            "label": "尖山区",
            "level": 3,
            "pid": 230500,


        }, {
            "id": 230503,
            "label": "岭东区",
            "level": 3,
            "pid": 230500,


        }, {
            "id": 230505,
            "label": "四方台区",
            "level": 3,
            "pid": 230500,


        }, {
            "id": 230506,
            "label": "宝山区",
            "level": 3,
            "pid": 230500,


        }, {
            "id": 230521,
            "label": "集贤县",
            "level": 3,
            "pid": 230500,


        }, {
            "id": 230522,
            "label": "友谊县",
            "level": 3,
            "pid": 230500,


        }, {
            "id": 230523,
            "label": "宝清县",
            "level": 3,
            "pid": 230500,


        }, {
            "id": 230524,
            "label": "饶河县",
            "level": 3,
            "pid": 230500,


        }]
    }, {
        "id": 230600,
        "label": "大庆市",
        "level": 2,
        "pid": 230000,

        "children": [{
            "id": 230602,
            "label": "萨尔图区",
            "level": 3,
            "pid": 230600,


        }, {
            "id": 230603,
            "label": "龙凤区",
            "level": 3,
            "pid": 230600,


        }, {
            "id": 230604,
            "label": "让胡路区",
            "level": 3,
            "pid": 230600,


        }, {
            "id": 230605,
            "label": "红岗区",
            "level": 3,
            "pid": 230600,


        }, {
            "id": 230606,
            "label": "大同区",
            "level": 3,
            "pid": 230600,


        }, {
            "id": 230621,
            "label": "肇州县",
            "level": 3,
            "pid": 230600,


        }, {
            "id": 230622,
            "label": "肇源县",
            "level": 3,
            "pid": 230600,


        }, {
            "id": 230623,
            "label": "林甸县",
            "level": 3,
            "pid": 230600,


        }, {
            "id": 230624,
            "label": "杜尔伯特蒙古族自治县",
            "level": 3,
            "pid": 230600,


        }]
    }, {
        "id": 230700,
        "label": "伊春市",
        "level": 2,
        "pid": 230000,

        "children": [{
            "id": 230702,
            "label": "伊春区",
            "level": 3,
            "pid": 230700,


        }, {
            "id": 230703,
            "label": "南岔区",
            "level": 3,
            "pid": 230700,


        }, {
            "id": 230704,
            "label": "友好区",
            "level": 3,
            "pid": 230700,


        }, {
            "id": 230705,
            "label": "西林区",
            "level": 3,
            "pid": 230700,


        }, {
            "id": 230706,
            "label": "翠峦区",
            "level": 3,
            "pid": 230700,


        }, {
            "id": 230707,
            "label": "新青区",
            "level": 3,
            "pid": 230700,


        }, {
            "id": 230708,
            "label": "美溪区",
            "level": 3,
            "pid": 230700,


        }, {
            "id": 230709,
            "label": "金山屯区",
            "level": 3,
            "pid": 230700,


        }, {
            "id": 230710,
            "label": "五营区",
            "level": 3,
            "pid": 230700,


        }, {
            "id": 230711,
            "label": "乌马河区",
            "level": 3,
            "pid": 230700,


        }, {
            "id": 230712,
            "label": "汤旺河区",
            "level": 3,
            "pid": 230700,


        }, {
            "id": 230713,
            "label": "带岭区",
            "level": 3,
            "pid": 230700,


        }, {
            "id": 230714,
            "label": "乌伊岭区",
            "level": 3,
            "pid": 230700,


        }, {
            "id": 230715,
            "label": "红星区",
            "level": 3,
            "pid": 230700,


        }, {
            "id": 230716,
            "label": "上甘岭区",
            "level": 3,
            "pid": 230700,


        }, {
            "id": 230722,
            "label": "嘉荫县",
            "level": 3,
            "pid": 230700,


        }, {
            "id": 230781,
            "label": "铁力市",
            "level": 3,
            "pid": 230700,


        }]
    }, {
        "id": 230800,
        "label": "佳木斯市",
        "level": 2,
        "pid": 230000,

        "children": [{
            "id": 230803,
            "label": "向阳区",
            "level": 3,
            "pid": 230800,


        }, {
            "id": 230804,
            "label": "前进区",
            "level": 3,
            "pid": 230800,


        }, {
            "id": 230805,
            "label": "东风区",
            "level": 3,
            "pid": 230800,


        }, {
            "id": 230811,
            "label": "郊区",
            "level": 3,
            "pid": 230800,


        }, {
            "id": 230822,
            "label": "桦南县",
            "level": 3,
            "pid": 230800,


        }, {
            "id": 230826,
            "label": "桦川县",
            "level": 3,
            "pid": 230800,


        }, {
            "id": 230828,
            "label": "汤原县",
            "level": 3,
            "pid": 230800,


        }, {
            "id": 230833,
            "label": "抚远县",
            "level": 3,
            "pid": 230800,


        }, {
            "id": 230881,
            "label": "同江市",
            "level": 3,
            "pid": 230800,


        }, {
            "id": 230882,
            "label": "富锦市",
            "level": 3,
            "pid": 230800,


        }]
    }, {
        "id": 230900,
        "label": "七台河市",
        "level": 2,
        "pid": 230000,

        "children": [{
            "id": 230902,
            "label": "新兴区",
            "level": 3,
            "pid": 230900,


        }, {
            "id": 230903,
            "label": "桃山区",
            "level": 3,
            "pid": 230900,


        }, {
            "id": 230904,
            "label": "茄子河区",
            "level": 3,
            "pid": 230900,


        }, {
            "id": 230921,
            "label": "勃利县",
            "level": 3,
            "pid": 230900,


        }]
    }, {
        "id": 231000,
        "label": "牡丹江市",
        "level": 2,
        "pid": 230000,

        "children": [{
            "id": 231002,
            "label": "东安区",
            "level": 3,
            "pid": 231000,


        }, {
            "id": 231003,
            "label": "阳明区",
            "level": 3,
            "pid": 231000,


        }, {
            "id": 231004,
            "label": "爱民区",
            "level": 3,
            "pid": 231000,


        }, {
            "id": 231005,
            "label": "西安区",
            "level": 3,
            "pid": 231000,


        }, {
            "id": 231024,
            "label": "东宁县",
            "level": 3,
            "pid": 231000,


        }, {
            "id": 231025,
            "label": "林口县",
            "level": 3,
            "pid": 231000,


        }, {
            "id": 231081,
            "label": "绥芬河市",
            "level": 3,
            "pid": 231000,


        }, {
            "id": 231083,
            "label": "海林市",
            "level": 3,
            "pid": 231000,


        }, {
            "id": 231084,
            "label": "宁安市",
            "level": 3,
            "pid": 231000,


        }, {
            "id": 231085,
            "label": "穆棱市",
            "level": 3,
            "pid": 231000,


        }]
    }, {
        "id": 231100,
        "label": "黑河市",
        "level": 2,
        "pid": 230000,

        "children": [{
            "id": 231102,
            "label": "爱辉区",
            "level": 3,
            "pid": 231100,


        }, {
            "id": 231121,
            "label": "嫩江县",
            "level": 3,
            "pid": 231100,


        }, {
            "id": 231123,
            "label": "逊克县",
            "level": 3,
            "pid": 231100,


        }, {
            "id": 231124,
            "label": "孙吴县",
            "level": 3,
            "pid": 231100,


        }, {
            "id": 231181,
            "label": "北安市",
            "level": 3,
            "pid": 231100,


        }, {
            "id": 231182,
            "label": "五大连池市",
            "level": 3,
            "pid": 231100,


        }]
    }, {
        "id": 231200,
        "label": "绥化市",
        "level": 2,
        "pid": 230000,

        "children": [{
            "id": 231202,
            "label": "北林区",
            "level": 3,
            "pid": 231200,


        }, {
            "id": 231221,
            "label": "望奎县",
            "level": 3,
            "pid": 231200,


        }, {
            "id": 231222,
            "label": "兰西县",
            "level": 3,
            "pid": 231200,


        }, {
            "id": 231223,
            "label": "青冈县",
            "level": 3,
            "pid": 231200,


        }, {
            "id": 231224,
            "label": "庆安县",
            "level": 3,
            "pid": 231200,


        }, {
            "id": 231225,
            "label": "明水县",
            "level": 3,
            "pid": 231200,


        }, {
            "id": 231226,
            "label": "绥棱县",
            "level": 3,
            "pid": 231200,


        }, {
            "id": 231281,
            "label": "安达市",
            "level": 3,
            "pid": 231200,


        }, {
            "id": 231282,
            "label": "肇东市",
            "level": 3,
            "pid": 231200,


        }, {
            "id": 231283,
            "label": "海伦市",
            "level": 3,
            "pid": 231200,


        }]
    }, {
        "id": 232700,
        "label": "大兴安岭地区",
        "level": 2,
        "pid": 230000,

        "children": [{
            "id": 232701,
            "label": "加格达奇区",
            "level": 3,
            "pid": 232700,


        }, {
            "id": 232702,
            "label": "新林区",
            "level": 3,
            "pid": 232700,


        }, {
            "id": 232703,
            "label": "松岭区",
            "level": 3,
            "pid": 232700,


        }, {
            "id": 232704,
            "label": "呼中区",
            "level": 3,
            "pid": 232700,


        }, {
            "id": 232721,
            "label": "呼玛县",
            "level": 3,
            "pid": 232700,


        }, {
            "id": 232722,
            "label": "塔河县",
            "level": 3,
            "pid": 232700,


        }, {
            "id": 232723,
            "label": "漠河县",
            "level": 3,
            "pid": 232700,


        }]
    }]
}, {
    "id": 310000,
    "label": "上海市",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 310100,
        "label": "市辖区",
        "level": 2,
        "pid": 310000,

        "children": [{
            "id": 310101,
            "label": "黄浦区",
            "level": 3,
            "pid": 310100,


        }, {
            "id": 310104,
            "label": "徐汇区",
            "level": 3,
            "pid": 310100,


        }, {
            "id": 310105,
            "label": "长宁区",
            "level": 3,
            "pid": 310100,


        }, {
            "id": 310106,
            "label": "静安区",
            "level": 3,
            "pid": 310100,


        }, {
            "id": 310107,
            "label": "普陀区",
            "level": 3,
            "pid": 310100,


        }, {
            "id": 310108,
            "label": "闸北区",
            "level": 3,
            "pid": 310100,


        }, {
            "id": 310109,
            "label": "虹口区",
            "level": 3,
            "pid": 310100,


        }, {
            "id": 310110,
            "label": "杨浦区",
            "level": 3,
            "pid": 310100,


        }, {
            "id": 310112,
            "label": "闵行区",
            "level": 3,
            "pid": 310100,


        }, {
            "id": 310113,
            "label": "宝山区",
            "level": 3,
            "pid": 310100,


        }, {
            "id": 310114,
            "label": "嘉定区",
            "level": 3,
            "pid": 310100,


        }, {
            "id": 310115,
            "label": "浦东新区",
            "level": 3,
            "pid": 310100,


        }, {
            "id": 310116,
            "label": "金山区",
            "level": 3,
            "pid": 310100,


        }, {
            "id": 310117,
            "label": "松江区",
            "level": 3,
            "pid": 310100,


        }, {
            "id": 310118,
            "label": "青浦区",
            "level": 3,
            "pid": 310100,


        }, {
            "id": 310120,
            "label": "奉贤区",
            "level": 3,
            "pid": 310100,


        }, {
            "id": 310230,
            "label": "崇明县",
            "level": 3,
            "pid": 310100,


        }]
    }]
}, {
    "id": 320000,
    "label": "江苏省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 320100,
        "label": "南京市",
        "level": 2,
        "pid": 320000,

        "children": [{
            "id": 320102,
            "label": "玄武区",
            "level": 3,
            "pid": 320100,


        }, {
            "id": 320104,
            "label": "秦淮区",
            "level": 3,
            "pid": 320100,


        }, {
            "id": 320105,
            "label": "建邺区",
            "level": 3,
            "pid": 320100,


        }, {
            "id": 320106,
            "label": "鼓楼区",
            "level": 3,
            "pid": 320100,


        }, {
            "id": 320111,
            "label": "浦口区",
            "level": 3,
            "pid": 320100,


        }, {
            "id": 320113,
            "label": "栖霞区",
            "level": 3,
            "pid": 320100,


        }, {
            "id": 320114,
            "label": "雨花台区",
            "level": 3,
            "pid": 320100,


        }, {
            "id": 320115,
            "label": "江宁区",
            "level": 3,
            "pid": 320100,


        }, {
            "id": 320116,
            "label": "六合区",
            "level": 3,
            "pid": 320100,


        }, {
            "id": 320117,
            "label": "溧水区",
            "level": 3,
            "pid": 320100,


        }, {
            "id": 320118,
            "label": "高淳区",
            "level": 3,
            "pid": 320100,


        }]
    }, {
        "id": 320200,
        "label": "无锡市",
        "level": 2,
        "pid": 320000,

        "children": [{
            "id": 320202,
            "label": "崇安区",
            "level": 3,
            "pid": 320200,


        }, {
            "id": 320203,
            "label": "南长区",
            "level": 3,
            "pid": 320200,


        }, {
            "id": 320204,
            "label": "北塘区",
            "level": 3,
            "pid": 320200,


        }, {
            "id": 320205,
            "label": "锡山区",
            "level": 3,
            "pid": 320200,


        }, {
            "id": 320206,
            "label": "惠山区",
            "level": 3,
            "pid": 320200,


        }, {
            "id": 320211,
            "label": "滨湖区",
            "level": 3,
            "pid": 320200,


        }, {
            "id": 320281,
            "label": "江阴市",
            "level": 3,
            "pid": 320200,


        }, {
            "id": 320282,
            "label": "宜兴市",
            "level": 3,
            "pid": 320200,


        }]
    }, {
        "id": 320300,
        "label": "徐州市",
        "level": 2,
        "pid": 320000,

        "children": [{
            "id": 320302,
            "label": "鼓楼区",
            "level": 3,
            "pid": 320300,


        }, {
            "id": 320303,
            "label": "云龙区",
            "level": 3,
            "pid": 320300,


        }, {
            "id": 320305,
            "label": "贾汪区",
            "level": 3,
            "pid": 320300,


        }, {
            "id": 320311,
            "label": "泉山区",
            "level": 3,
            "pid": 320300,


        }, {
            "id": 320312,
            "label": "铜山区",
            "level": 3,
            "pid": 320300,


        }, {
            "id": 320321,
            "label": "丰县",
            "level": 3,
            "pid": 320300,


        }, {
            "id": 320322,
            "label": "沛县",
            "level": 3,
            "pid": 320300,


        }, {
            "id": 320324,
            "label": "睢宁县",
            "level": 3,
            "pid": 320300,


        }, {
            "id": 320381,
            "label": "新沂市",
            "level": 3,
            "pid": 320300,


        }, {
            "id": 320382,
            "label": "邳州市",
            "level": 3,
            "pid": 320300,


        }]
    }, {
        "id": 320400,
        "label": "常州市",
        "level": 2,
        "pid": 320000,

        "children": [{
            "id": 320402,
            "label": "天宁区",
            "level": 3,
            "pid": 320400,


        }, {
            "id": 320404,
            "label": "钟楼区",
            "level": 3,
            "pid": 320400,


        }, {
            "id": 320405,
            "label": "戚墅堰区",
            "level": 3,
            "pid": 320400,


        }, {
            "id": 320411,
            "label": "新北区",
            "level": 3,
            "pid": 320400,


        }, {
            "id": 320412,
            "label": "武进区",
            "level": 3,
            "pid": 320400,


        }, {
            "id": 320481,
            "label": "溧阳市",
            "level": 3,
            "pid": 320400,


        }, {
            "id": 320482,
            "label": "金坛市",
            "level": 3,
            "pid": 320400,


        }]
    }, {
        "id": 320500,
        "label": "苏州市",
        "level": 2,
        "pid": 320000,

        "children": [{
            "id": 320505,
            "label": "虎丘区",
            "level": 3,
            "pid": 320500,


        }, {
            "id": 320506,
            "label": "吴中区",
            "level": 3,
            "pid": 320500,


        }, {
            "id": 320507,
            "label": "相城区",
            "level": 3,
            "pid": 320500,


        }, {
            "id": 320508,
            "label": "姑苏区",
            "level": 3,
            "pid": 320500,


        }, {
            "id": 320509,
            "label": "吴江区",
            "level": 3,
            "pid": 320500,


        }, {
            "id": 320581,
            "label": "常熟市",
            "level": 3,
            "pid": 320500,


        }, {
            "id": 320582,
            "label": "张家港市",
            "level": 3,
            "pid": 320500,


        }, {
            "id": 320583,
            "label": "昆山市",
            "level": 3,
            "pid": 320500,


        }, {
            "id": 320585,
            "label": "太仓市",
            "level": 3,
            "pid": 320500,


        }]
    }, {
        "id": 320600,
        "label": "南通市",
        "level": 2,
        "pid": 320000,

        "children": [{
            "id": 320602,
            "label": "崇川区",
            "level": 3,
            "pid": 320600,


        }, {
            "id": 320611,
            "label": "港闸区",
            "level": 3,
            "pid": 320600,


        }, {
            "id": 320612,
            "label": "通州区",
            "level": 3,
            "pid": 320600,


        }, {
            "id": 320621,
            "label": "海安县",
            "level": 3,
            "pid": 320600,


        }, {
            "id": 320623,
            "label": "如东县",
            "level": 3,
            "pid": 320600,


        }, {
            "id": 320681,
            "label": "启东市",
            "level": 3,
            "pid": 320600,


        }, {
            "id": 320682,
            "label": "如皋市",
            "level": 3,
            "pid": 320600,


        }, {
            "id": 320684,
            "label": "海门市",
            "level": 3,
            "pid": 320600,


        }]
    }, {
        "id": 320700,
        "label": "连云港市",
        "level": 2,
        "pid": 320000,

        "children": [{
            "id": 320703,
            "label": "连云区",
            "level": 3,
            "pid": 320700,


        }, {
            "id": 320706,
            "label": "海州区",
            "level": 3,
            "pid": 320700,


        }, {
            "id": 320707,
            "label": "赣榆区",
            "level": 3,
            "pid": 320700,


        }, {
            "id": 320722,
            "label": "东海县",
            "level": 3,
            "pid": 320700,


        }, {
            "id": 320723,
            "label": "灌云县",
            "level": 3,
            "pid": 320700,


        }, {
            "id": 320724,
            "label": "灌南县",
            "level": 3,
            "pid": 320700,


        }]
    }, {
        "id": 320800,
        "label": "淮安市",
        "level": 2,
        "pid": 320000,

        "children": [{
            "id": 320802,
            "label": "清河区",
            "level": 3,
            "pid": 320800,


        }, {
            "id": 320803,
            "label": "淮安区",
            "level": 3,
            "pid": 320800,


        }, {
            "id": 320804,
            "label": "淮阴区",
            "level": 3,
            "pid": 320800,


        }, {
            "id": 320811,
            "label": "清浦区",
            "level": 3,
            "pid": 320800,


        }, {
            "id": 320826,
            "label": "涟水县",
            "level": 3,
            "pid": 320800,


        }, {
            "id": 320829,
            "label": "洪泽县",
            "level": 3,
            "pid": 320800,


        }, {
            "id": 320830,
            "label": "盱眙县",
            "level": 3,
            "pid": 320800,


        }, {
            "id": 320831,
            "label": "金湖县",
            "level": 3,
            "pid": 320800,


        }]
    }, {
        "id": 320900,
        "label": "盐城市",
        "level": 2,
        "pid": 320000,

        "children": [{
            "id": 320902,
            "label": "亭湖区",
            "level": 3,
            "pid": 320900,


        }, {
            "id": 320903,
            "label": "盐都区",
            "level": 3,
            "pid": 320900,


        }, {
            "id": 320921,
            "label": "响水县",
            "level": 3,
            "pid": 320900,


        }, {
            "id": 320922,
            "label": "滨海县",
            "level": 3,
            "pid": 320900,


        }, {
            "id": 320923,
            "label": "阜宁县",
            "level": 3,
            "pid": 320900,


        }, {
            "id": 320924,
            "label": "射阳县",
            "level": 3,
            "pid": 320900,


        }, {
            "id": 320925,
            "label": "建湖县",
            "level": 3,
            "pid": 320900,


        }, {
            "id": 320981,
            "label": "东台市",
            "level": 3,
            "pid": 320900,


        }, {
            "id": 320982,
            "label": "大丰市",
            "level": 3,
            "pid": 320900,


        }]
    }, {
        "id": 321000,
        "label": "扬州市",
        "level": 2,
        "pid": 320000,

        "children": [{
            "id": 321002,
            "label": "广陵区",
            "level": 3,
            "pid": 321000,


        }, {
            "id": 321003,
            "label": "邗江区",
            "level": 3,
            "pid": 321000,


        }, {
            "id": 321012,
            "label": "江都区",
            "level": 3,
            "pid": 321000,


        }, {
            "id": 321023,
            "label": "宝应县",
            "level": 3,
            "pid": 321000,


        }, {
            "id": 321081,
            "label": "仪征市",
            "level": 3,
            "pid": 321000,


        }, {
            "id": 321084,
            "label": "高邮市",
            "level": 3,
            "pid": 321000,


        }]
    }, {
        "id": 321100,
        "label": "镇江市",
        "level": 2,
        "pid": 320000,

        "children": [{
            "id": 321102,
            "label": "京口区",
            "level": 3,
            "pid": 321100,


        }, {
            "id": 321111,
            "label": "润州区",
            "level": 3,
            "pid": 321100,


        }, {
            "id": 321112,
            "label": "丹徒区",
            "level": 3,
            "pid": 321100,


        }, {
            "id": 321181,
            "label": "丹阳市",
            "level": 3,
            "pid": 321100,


        }, {
            "id": 321182,
            "label": "扬中市",
            "level": 3,
            "pid": 321100,


        }, {
            "id": 321183,
            "label": "句容市",
            "level": 3,
            "pid": 321100,


        }]
    }, {
        "id": 321200,
        "label": "泰州市",
        "level": 2,
        "pid": 320000,

        "children": [{
            "id": 321202,
            "label": "海陵区",
            "level": 3,
            "pid": 321200,


        }, {
            "id": 321203,
            "label": "高港区",
            "level": 3,
            "pid": 321200,


        }, {
            "id": 321204,
            "label": "姜堰区",
            "level": 3,
            "pid": 321200,


        }, {
            "id": 321281,
            "label": "兴化市",
            "level": 3,
            "pid": 321200,


        }, {
            "id": 321282,
            "label": "靖江市",
            "level": 3,
            "pid": 321200,


        }, {
            "id": 321283,
            "label": "泰兴市",
            "level": 3,
            "pid": 321200,


        }]
    }, {
        "id": 321300,
        "label": "宿迁市",
        "level": 2,
        "pid": 320000,

        "children": [{
            "id": 321302,
            "label": "宿城区",
            "level": 3,
            "pid": 321300,


        }, {
            "id": 321311,
            "label": "宿豫区",
            "level": 3,
            "pid": 321300,


        }, {
            "id": 321322,
            "label": "沭阳县",
            "level": 3,
            "pid": 321300,


        }, {
            "id": 321323,
            "label": "泗阳县",
            "level": 3,
            "pid": 321300,


        }, {
            "id": 321324,
            "label": "泗洪县",
            "level": 3,
            "pid": 321300,


        }]
    }]
}, {
    "id": 330000,
    "label": "浙江省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 330100,
        "label": "杭州市",
        "level": 2,
        "pid": 330000,

        "children": [{
            "id": 330102,
            "label": "上城区",
            "level": 3,
            "pid": 330100,


        }, {
            "id": 330103,
            "label": "下城区",
            "level": 3,
            "pid": 330100,


        }, {
            "id": 330104,
            "label": "江干区",
            "level": 3,
            "pid": 330100,


        }, {
            "id": 330105,
            "label": "拱墅区",
            "level": 3,
            "pid": 330100,


        }, {
            "id": 330106,
            "label": "西湖区",
            "level": 3,
            "pid": 330100,


        }, {
            "id": 330108,
            "label": "滨江区",
            "level": 3,
            "pid": 330100,


        }, {
            "id": 330109,
            "label": "萧山区",
            "level": 3,
            "pid": 330100,


        }, {
            "id": 330110,
            "label": "余杭区",
            "level": 3,
            "pid": 330100,


        }, {
            "id": 330122,
            "label": "桐庐县",
            "level": 3,
            "pid": 330100,


        }, {
            "id": 330127,
            "label": "淳安县",
            "level": 3,
            "pid": 330100,


        }, {
            "id": 330182,
            "label": "建德市",
            "level": 3,
            "pid": 330100,


        }, {
            "id": 330183,
            "label": "富阳区",
            "level": 3,
            "pid": 330100,


        }, {
            "id": 330185,
            "label": "临安市",
            "level": 3,
            "pid": 330100,


        }]
    }, {
        "id": 330200,
        "label": "宁波市",
        "level": 2,
        "pid": 330000,

        "children": [{
            "id": 330203,
            "label": "海曙区",
            "level": 3,
            "pid": 330200,


        }, {
            "id": 330204,
            "label": "江东区",
            "level": 3,
            "pid": 330200,


        }, {
            "id": 330205,
            "label": "江北区",
            "level": 3,
            "pid": 330200,


        }, {
            "id": 330206,
            "label": "北仑区",
            "level": 3,
            "pid": 330200,


        }, {
            "id": 330211,
            "label": "镇海区",
            "level": 3,
            "pid": 330200,


        }, {
            "id": 330212,
            "label": "鄞州区",
            "level": 3,
            "pid": 330200,


        }, {
            "id": 330225,
            "label": "象山县",
            "level": 3,
            "pid": 330200,


        }, {
            "id": 330226,
            "label": "宁海县",
            "level": 3,
            "pid": 330200,


        }, {
            "id": 330281,
            "label": "余姚市",
            "level": 3,
            "pid": 330200,


        }, {
            "id": 330282,
            "label": "慈溪市",
            "level": 3,
            "pid": 330200,


        }, {
            "id": 330283,
            "label": "奉化市",
            "level": 3,
            "pid": 330200,


        }]
    }, {
        "id": 330300,
        "label": "温州市",
        "level": 2,
        "pid": 330000,

        "children": [{
            "id": 330302,
            "label": "鹿城区",
            "level": 3,
            "pid": 330300,


        }, {
            "id": 330303,
            "label": "龙湾区",
            "level": 3,
            "pid": 330300,


        }, {
            "id": 330304,
            "label": "瓯海区",
            "level": 3,
            "pid": 330300,


        }, {
            "id": 330322,
            "label": "洞头县",
            "level": 3,
            "pid": 330300,


        }, {
            "id": 330324,
            "label": "永嘉县",
            "level": 3,
            "pid": 330300,


        }, {
            "id": 330326,
            "label": "平阳县",
            "level": 3,
            "pid": 330300,


        }, {
            "id": 330327,
            "label": "苍南县",
            "level": 3,
            "pid": 330300,


        }, {
            "id": 330328,
            "label": "文成县",
            "level": 3,
            "pid": 330300,


        }, {
            "id": 330329,
            "label": "泰顺县",
            "level": 3,
            "pid": 330300,


        }, {
            "id": 330381,
            "label": "瑞安市",
            "level": 3,
            "pid": 330300,


        }, {
            "id": 330382,
            "label": "乐清市",
            "level": 3,
            "pid": 330300,


        }]
    }, {
        "id": 330400,
        "label": "嘉兴市",
        "level": 2,
        "pid": 330000,

        "children": [{
            "id": 330402,
            "label": "南湖区",
            "level": 3,
            "pid": 330400,


        }, {
            "id": 330411,
            "label": "秀洲区",
            "level": 3,
            "pid": 330400,


        }, {
            "id": 330421,
            "label": "嘉善县",
            "level": 3,
            "pid": 330400,


        }, {
            "id": 330424,
            "label": "海盐县",
            "level": 3,
            "pid": 330400,


        }, {
            "id": 330481,
            "label": "海宁市",
            "level": 3,
            "pid": 330400,


        }, {
            "id": 330482,
            "label": "平湖市",
            "level": 3,
            "pid": 330400,


        }, {
            "id": 330483,
            "label": "桐乡市",
            "level": 3,
            "pid": 330400,


        }]
    }, {
        "id": 330500,
        "label": "湖州市",
        "level": 2,
        "pid": 330000,

        "children": [{
            "id": 330502,
            "label": "吴兴区",
            "level": 3,
            "pid": 330500,


        }, {
            "id": 330503,
            "label": "南浔区",
            "level": 3,
            "pid": 330500,


        }, {
            "id": 330521,
            "label": "德清县",
            "level": 3,
            "pid": 330500,


        }, {
            "id": 330522,
            "label": "长兴县",
            "level": 3,
            "pid": 330500,


        }, {
            "id": 330523,
            "label": "安吉县",
            "level": 3,
            "pid": 330500,


        }]
    }, {
        "id": 330600,
        "label": "绍兴市",
        "level": 2,
        "pid": 330000,

        "children": [{
            "id": 330602,
            "label": "越城区",
            "level": 3,
            "pid": 330600,


        }, {
            "id": 330603,
            "label": "柯桥区",
            "level": 3,
            "pid": 330600,


        }, {
            "id": 330604,
            "label": "上虞区",
            "level": 3,
            "pid": 330600,


        }, {
            "id": 330624,
            "label": "新昌县",
            "level": 3,
            "pid": 330600,


        }, {
            "id": 330681,
            "label": "诸暨市",
            "level": 3,
            "pid": 330600,


        }, {
            "id": 330683,
            "label": "嵊州市",
            "level": 3,
            "pid": 330600,


        }]
    }, {
        "id": 330700,
        "label": "金华市",
        "level": 2,
        "pid": 330000,

        "children": [{
            "id": 330702,
            "label": "婺城区",
            "level": 3,
            "pid": 330700,


        }, {
            "id": 330703,
            "label": "金东区",
            "level": 3,
            "pid": 330700,


        }, {
            "id": 330723,
            "label": "武义县",
            "level": 3,
            "pid": 330700,


        }, {
            "id": 330726,
            "label": "浦江县",
            "level": 3,
            "pid": 330700,


        }, {
            "id": 330727,
            "label": "磐安县",
            "level": 3,
            "pid": 330700,


        }, {
            "id": 330781,
            "label": "兰溪市",
            "level": 3,
            "pid": 330700,


        }, {
            "id": 330782,
            "label": "义乌市",
            "level": 3,
            "pid": 330700,


        }, {
            "id": 330783,
            "label": "东阳市",
            "level": 3,
            "pid": 330700,


        }, {
            "id": 330784,
            "label": "永康市",
            "level": 3,
            "pid": 330700,


        }]
    }, {
        "id": 330800,
        "label": "衢州市",
        "level": 2,
        "pid": 330000,

        "children": [{
            "id": 330802,
            "label": "柯城区",
            "level": 3,
            "pid": 330800,


        }, {
            "id": 330803,
            "label": "衢江区",
            "level": 3,
            "pid": 330800,


        }, {
            "id": 330822,
            "label": "常山县",
            "level": 3,
            "pid": 330800,


        }, {
            "id": 330824,
            "label": "开化县",
            "level": 3,
            "pid": 330800,


        }, {
            "id": 330825,
            "label": "龙游县",
            "level": 3,
            "pid": 330800,


        }, {
            "id": 330881,
            "label": "江山市",
            "level": 3,
            "pid": 330800,


        }]
    }, {
        "id": 330900,
        "label": "舟山市",
        "level": 2,
        "pid": 330000,

        "children": [{
            "id": 330902,
            "label": "定海区",
            "level": 3,
            "pid": 330900,


        }, {
            "id": 330903,
            "label": "普陀区",
            "level": 3,
            "pid": 330900,


        }, {
            "id": 330921,
            "label": "岱山县",
            "level": 3,
            "pid": 330900,


        }, {
            "id": 330922,
            "label": "嵊泗县",
            "level": 3,
            "pid": 330900,


        }]
    }, {
        "id": 331000,
        "label": "台州市",
        "level": 2,
        "pid": 330000,

        "children": [{
            "id": 331002,
            "label": "椒江区",
            "level": 3,
            "pid": 331000,


        }, {
            "id": 331003,
            "label": "黄岩区",
            "level": 3,
            "pid": 331000,


        }, {
            "id": 331004,
            "label": "路桥区",
            "level": 3,
            "pid": 331000,


        }, {
            "id": 331021,
            "label": "玉环县",
            "level": 3,
            "pid": 331000,


        }, {
            "id": 331022,
            "label": "三门县",
            "level": 3,
            "pid": 331000,


        }, {
            "id": 331023,
            "label": "天台县",
            "level": 3,
            "pid": 331000,


        }, {
            "id": 331024,
            "label": "仙居县",
            "level": 3,
            "pid": 331000,


        }, {
            "id": 331081,
            "label": "温岭市",
            "level": 3,
            "pid": 331000,


        }, {
            "id": 331082,
            "label": "临海市",
            "level": 3,
            "pid": 331000,


        }]
    }, {
        "id": 331100,
        "label": "丽水市",
        "level": 2,
        "pid": 330000,

        "children": [{
            "id": 331102,
            "label": "莲都区",
            "level": 3,
            "pid": 331100,


        }, {
            "id": 331121,
            "label": "青田县",
            "level": 3,
            "pid": 331100,


        }, {
            "id": 331122,
            "label": "缙云县",
            "level": 3,
            "pid": 331100,


        }, {
            "id": 331123,
            "label": "遂昌县",
            "level": 3,
            "pid": 331100,


        }, {
            "id": 331124,
            "label": "松阳县",
            "level": 3,
            "pid": 331100,


        }, {
            "id": 331125,
            "label": "云和县",
            "level": 3,
            "pid": 331100,


        }, {
            "id": 331126,
            "label": "庆元县",
            "level": 3,
            "pid": 331100,


        }, {
            "id": 331127,
            "label": "景宁畲族自治县",
            "level": 3,
            "pid": 331100,


        }, {
            "id": 331181,
            "label": "龙泉市",
            "level": 3,
            "pid": 331100,


        }]
    }, {
        "id": 331200,
        "label": "舟山群岛新区",
        "level": 2,
        "pid": 330000,

        "children": [{
            "id": 331201,
            "label": "金塘岛",
            "level": 3,
            "pid": 331200,


        }, {
            "id": 331202,
            "label": "六横岛",
            "level": 3,
            "pid": 331200,


        }, {
            "id": 331203,
            "label": "衢山岛",
            "level": 3,
            "pid": 331200,


        }, {
            "id": 331204,
            "label": "舟山本岛西北部",
            "level": 3,
            "pid": 331200,


        }, {
            "id": 331205,
            "label": "岱山岛西南部",
            "level": 3,
            "pid": 331200,


        }, {
            "id": 331206,
            "label": "泗礁岛",
            "level": 3,
            "pid": 331200,


        }, {
            "id": 331207,
            "label": "朱家尖岛",
            "level": 3,
            "pid": 331200,


        }, {
            "id": 331208,
            "label": "洋山岛",
            "level": 3,
            "pid": 331200,


        }, {
            "id": 331209,
            "label": "长涂岛",
            "level": 3,
            "pid": 331200,


        }, {
            "id": 331210,
            "label": "虾峙岛",
            "level": 3,
            "pid": 331200,


        }]
    }]
}, {
    "id": 340000,
    "label": "安徽省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 340100,
        "label": "合肥市",
        "level": 2,
        "pid": 340000,

        "children": [{
            "id": 340102,
            "label": "瑶海区",
            "level": 3,
            "pid": 340100,


        }, {
            "id": 340103,
            "label": "庐阳区",
            "level": 3,
            "pid": 340100,


        }, {
            "id": 340104,
            "label": "蜀山区",
            "level": 3,
            "pid": 340100,


        }, {
            "id": 340111,
            "label": "包河区",
            "level": 3,
            "pid": 340100,


        }, {
            "id": 340121,
            "label": "长丰县",
            "level": 3,
            "pid": 340100,


        }, {
            "id": 340122,
            "label": "肥东县",
            "level": 3,
            "pid": 340100,


        }, {
            "id": 340123,
            "label": "肥西县",
            "level": 3,
            "pid": 340100,


        }, {
            "id": 340124,
            "label": "庐江县",
            "level": 3,
            "pid": 340100,


        }, {
            "id": 340181,
            "label": "巢湖市",
            "level": 3,
            "pid": 340100,


        }]
    }, {
        "id": 340200,
        "label": "芜湖市",
        "level": 2,
        "pid": 340000,

        "children": [{
            "id": 340202,
            "label": "镜湖区",
            "level": 3,
            "pid": 340200,


        }, {
            "id": 340203,
            "label": "弋江区",
            "level": 3,
            "pid": 340200,


        }, {
            "id": 340207,
            "label": "鸠江区",
            "level": 3,
            "pid": 340200,


        }, {
            "id": 340208,
            "label": "三山区",
            "level": 3,
            "pid": 340200,


        }, {
            "id": 340221,
            "label": "芜湖县",
            "level": 3,
            "pid": 340200,


        }, {
            "id": 340222,
            "label": "繁昌县",
            "level": 3,
            "pid": 340200,


        }, {
            "id": 340223,
            "label": "南陵县",
            "level": 3,
            "pid": 340200,


        }, {
            "id": 340225,
            "label": "无为县",
            "level": 3,
            "pid": 340200,


        }]
    }, {
        "id": 340300,
        "label": "蚌埠市",
        "level": 2,
        "pid": 340000,

        "children": [{
            "id": 340302,
            "label": "龙子湖区",
            "level": 3,
            "pid": 340300,


        }, {
            "id": 340303,
            "label": "蚌山区",
            "level": 3,
            "pid": 340300,


        }, {
            "id": 340304,
            "label": "禹会区",
            "level": 3,
            "pid": 340300,


        }, {
            "id": 340311,
            "label": "淮上区",
            "level": 3,
            "pid": 340300,


        }, {
            "id": 340321,
            "label": "怀远县",
            "level": 3,
            "pid": 340300,


        }, {
            "id": 340322,
            "label": "五河县",
            "level": 3,
            "pid": 340300,


        }, {
            "id": 340323,
            "label": "固镇县",
            "level": 3,
            "pid": 340300,


        }]
    }, {
        "id": 340400,
        "label": "淮南市",
        "level": 2,
        "pid": 340000,

        "children": [{
            "id": 340402,
            "label": "大通区",
            "level": 3,
            "pid": 340400,


        }, {
            "id": 340403,
            "label": "田家庵区",
            "level": 3,
            "pid": 340400,


        }, {
            "id": 340404,
            "label": "谢家集区",
            "level": 3,
            "pid": 340400,


        }, {
            "id": 340405,
            "label": "八公山区",
            "level": 3,
            "pid": 340400,


        }, {
            "id": 340406,
            "label": "潘集区",
            "level": 3,
            "pid": 340400,


        }, {
            "id": 340421,
            "label": "凤台县",
            "level": 3,
            "pid": 340400,


        }]
    }, {
        "id": 340500,
        "label": "马鞍山市",
        "level": 2,
        "pid": 340000,

        "children": [{
            "id": 340503,
            "label": "花山区",
            "level": 3,
            "pid": 340500,


        }, {
            "id": 340504,
            "label": "雨山区",
            "level": 3,
            "pid": 340500,


        }, {
            "id": 340506,
            "label": "博望区",
            "level": 3,
            "pid": 340500,


        }, {
            "id": 340521,
            "label": "当涂县",
            "level": 3,
            "pid": 340500,


        }, {
            "id": 340522,
            "label": "含山县",
            "level": 3,
            "pid": 340500,


        }, {
            "id": 340523,
            "label": "和县",
            "level": 3,
            "pid": 340500,


        }]
    }, {
        "id": 340600,
        "label": "淮北市",
        "level": 2,
        "pid": 340000,

        "children": [{
            "id": 340602,
            "label": "杜集区",
            "level": 3,
            "pid": 340600,


        }, {
            "id": 340603,
            "label": "相山区",
            "level": 3,
            "pid": 340600,


        }, {
            "id": 340604,
            "label": "烈山区",
            "level": 3,
            "pid": 340600,


        }, {
            "id": 340621,
            "label": "濉溪县",
            "level": 3,
            "pid": 340600,


        }]
    }, {
        "id": 340700,
        "label": "铜陵市",
        "level": 2,
        "pid": 340000,

        "children": [{
            "id": 340702,
            "label": "铜官山区",
            "level": 3,
            "pid": 340700,


        }, {
            "id": 340703,
            "label": "狮子山区",
            "level": 3,
            "pid": 340700,


        }, {
            "id": 340711,
            "label": "郊区",
            "level": 3,
            "pid": 340700,


        }, {
            "id": 340721,
            "label": "铜陵县",
            "level": 3,
            "pid": 340700,


        }]
    }, {
        "id": 340800,
        "label": "安庆市",
        "level": 2,
        "pid": 340000,

        "children": [{
            "id": 340802,
            "label": "迎江区",
            "level": 3,
            "pid": 340800,


        }, {
            "id": 340803,
            "label": "大观区",
            "level": 3,
            "pid": 340800,


        }, {
            "id": 340811,
            "label": "宜秀区",
            "level": 3,
            "pid": 340800,


        }, {
            "id": 340822,
            "label": "怀宁县",
            "level": 3,
            "pid": 340800,


        }, {
            "id": 340823,
            "label": "枞阳县",
            "level": 3,
            "pid": 340800,


        }, {
            "id": 340824,
            "label": "潜山县",
            "level": 3,
            "pid": 340800,


        }, {
            "id": 340825,
            "label": "太湖县",
            "level": 3,
            "pid": 340800,


        }, {
            "id": 340826,
            "label": "宿松县",
            "level": 3,
            "pid": 340800,


        }, {
            "id": 340827,
            "label": "望江县",
            "level": 3,
            "pid": 340800,


        }, {
            "id": 340828,
            "label": "岳西县",
            "level": 3,
            "pid": 340800,


        }, {
            "id": 340881,
            "label": "桐城市",
            "level": 3,
            "pid": 340800,


        }]
    }, {
        "id": 341000,
        "label": "黄山市",
        "level": 2,
        "pid": 340000,

        "children": [{
            "id": 341002,
            "label": "屯溪区",
            "level": 3,
            "pid": 341000,


        }, {
            "id": 341003,
            "label": "黄山区",
            "level": 3,
            "pid": 341000,


        }, {
            "id": 341004,
            "label": "徽州区",
            "level": 3,
            "pid": 341000,


        }, {
            "id": 341021,
            "label": "歙县",
            "level": 3,
            "pid": 341000,


        }, {
            "id": 341022,
            "label": "休宁县",
            "level": 3,
            "pid": 341000,


        }, {
            "id": 341023,
            "label": "黟县",
            "level": 3,
            "pid": 341000,


        }, {
            "id": 341024,
            "label": "祁门县",
            "level": 3,
            "pid": 341000,


        }]
    }, {
        "id": 341100,
        "label": "滁州市",
        "level": 2,
        "pid": 340000,

        "children": [{
            "id": 341102,
            "label": "琅琊区",
            "level": 3,
            "pid": 341100,


        }, {
            "id": 341103,
            "label": "南谯区",
            "level": 3,
            "pid": 341100,


        }, {
            "id": 341122,
            "label": "来安县",
            "level": 3,
            "pid": 341100,


        }, {
            "id": 341124,
            "label": "全椒县",
            "level": 3,
            "pid": 341100,


        }, {
            "id": 341125,
            "label": "定远县",
            "level": 3,
            "pid": 341100,


        }, {
            "id": 341126,
            "label": "凤阳县",
            "level": 3,
            "pid": 341100,


        }, {
            "id": 341181,
            "label": "天长市",
            "level": 3,
            "pid": 341100,


        }, {
            "id": 341182,
            "label": "明光市",
            "level": 3,
            "pid": 341100,


        }]
    }, {
        "id": 341200,
        "label": "阜阳市",
        "level": 2,
        "pid": 340000,

        "children": [{
            "id": 341202,
            "label": "颍州区",
            "level": 3,
            "pid": 341200,


        }, {
            "id": 341203,
            "label": "颍东区",
            "level": 3,
            "pid": 341200,


        }, {
            "id": 341204,
            "label": "颍泉区",
            "level": 3,
            "pid": 341200,


        }, {
            "id": 341221,
            "label": "临泉县",
            "level": 3,
            "pid": 341200,


        }, {
            "id": 341222,
            "label": "太和县",
            "level": 3,
            "pid": 341200,


        }, {
            "id": 341225,
            "label": "阜南县",
            "level": 3,
            "pid": 341200,


        }, {
            "id": 341226,
            "label": "颍上县",
            "level": 3,
            "pid": 341200,


        }, {
            "id": 341282,
            "label": "界首市",
            "level": 3,
            "pid": 341200,


        }]
    }, {
        "id": 341300,
        "label": "宿州市",
        "level": 2,
        "pid": 340000,

        "children": [{
            "id": 341302,
            "label": "埇桥区",
            "level": 3,
            "pid": 341300,


        }, {
            "id": 341321,
            "label": "砀山县",
            "level": 3,
            "pid": 341300,


        }, {
            "id": 341322,
            "label": "萧县",
            "level": 3,
            "pid": 341300,


        }, {
            "id": 341323,
            "label": "灵璧县",
            "level": 3,
            "pid": 341300,


        }, {
            "id": 341324,
            "label": "泗县",
            "level": 3,
            "pid": 341300,


        }]
    }, {
        "id": 341500,
        "label": "六安市",
        "level": 2,
        "pid": 340000,

        "children": [{
            "id": 341502,
            "label": "金安区",
            "level": 3,
            "pid": 341500,


        }, {
            "id": 341503,
            "label": "裕安区",
            "level": 3,
            "pid": 341500,


        }, {
            "id": 341521,
            "label": "寿县",
            "level": 3,
            "pid": 341500,


        }, {
            "id": 341522,
            "label": "霍邱县",
            "level": 3,
            "pid": 341500,


        }, {
            "id": 341523,
            "label": "舒城县",
            "level": 3,
            "pid": 341500,


        }, {
            "id": 341524,
            "label": "金寨县",
            "level": 3,
            "pid": 341500,


        }, {
            "id": 341525,
            "label": "霍山县",
            "level": 3,
            "pid": 341500,


        }]
    }, {
        "id": 341600,
        "label": "亳州市",
        "level": 2,
        "pid": 340000,

        "children": [{
            "id": 341602,
            "label": "谯城区",
            "level": 3,
            "pid": 341600,


        }, {
            "id": 341621,
            "label": "涡阳县",
            "level": 3,
            "pid": 341600,


        }, {
            "id": 341622,
            "label": "蒙城县",
            "level": 3,
            "pid": 341600,


        }, {
            "id": 341623,
            "label": "利辛县",
            "level": 3,
            "pid": 341600,


        }]
    }, {
        "id": 341700,
        "label": "池州市",
        "level": 2,
        "pid": 340000,

        "children": [{
            "id": 341702,
            "label": "贵池区",
            "level": 3,
            "pid": 341700,


        }, {
            "id": 341721,
            "label": "东至县",
            "level": 3,
            "pid": 341700,


        }, {
            "id": 341722,
            "label": "石台县",
            "level": 3,
            "pid": 341700,


        }, {
            "id": 341723,
            "label": "青阳县",
            "level": 3,
            "pid": 341700,


        }]
    }, {
        "id": 341800,
        "label": "宣城市",
        "level": 2,
        "pid": 340000,

        "children": [{
            "id": 341802,
            "label": "宣州区",
            "level": 3,
            "pid": 341800,


        }, {
            "id": 341821,
            "label": "郎溪县",
            "level": 3,
            "pid": 341800,


        }, {
            "id": 341822,
            "label": "广德县",
            "level": 3,
            "pid": 341800,


        }, {
            "id": 341823,
            "label": "泾县",
            "level": 3,
            "pid": 341800,


        }, {
            "id": 341824,
            "label": "绩溪县",
            "level": 3,
            "pid": 341800,


        }, {
            "id": 341825,
            "label": "旌德县",
            "level": 3,
            "pid": 341800,


        }, {
            "id": 341881,
            "label": "宁国市",
            "level": 3,
            "pid": 341800,


        }]
    }]
}, {
    "id": 350000,
    "label": "福建省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 350100,
        "label": "福州市",
        "level": 2,
        "pid": 350000,

        "children": [{
            "id": 350102,
            "label": "鼓楼区",
            "level": 3,
            "pid": 350100,


        }, {
            "id": 350103,
            "label": "台江区",
            "level": 3,
            "pid": 350100,


        }, {
            "id": 350104,
            "label": "仓山区",
            "level": 3,
            "pid": 350100,


        }, {
            "id": 350105,
            "label": "马尾区",
            "level": 3,
            "pid": 350100,


        }, {
            "id": 350111,
            "label": "晋安区",
            "level": 3,
            "pid": 350100,


        }, {
            "id": 350121,
            "label": "闽侯县",
            "level": 3,
            "pid": 350100,


        }, {
            "id": 350122,
            "label": "连江县",
            "level": 3,
            "pid": 350100,


        }, {
            "id": 350123,
            "label": "罗源县",
            "level": 3,
            "pid": 350100,


        }, {
            "id": 350124,
            "label": "闽清县",
            "level": 3,
            "pid": 350100,


        }, {
            "id": 350125,
            "label": "永泰县",
            "level": 3,
            "pid": 350100,


        }, {
            "id": 350128,
            "label": "平潭县",
            "level": 3,
            "pid": 350100,


        }, {
            "id": 350181,
            "label": "福清市",
            "level": 3,
            "pid": 350100,


        }, {
            "id": 350182,
            "label": "长乐市",
            "level": 3,
            "pid": 350100,


        }]
    }, {
        "id": 350200,
        "label": "厦门市",
        "level": 2,
        "pid": 350000,

        "children": [{
            "id": 350203,
            "label": "思明区",
            "level": 3,
            "pid": 350200,


        }, {
            "id": 350205,
            "label": "海沧区",
            "level": 3,
            "pid": 350200,


        }, {
            "id": 350206,
            "label": "湖里区",
            "level": 3,
            "pid": 350200,


        }, {
            "id": 350211,
            "label": "集美区",
            "level": 3,
            "pid": 350200,


        }, {
            "id": 350212,
            "label": "同安区",
            "level": 3,
            "pid": 350200,


        }, {
            "id": 350213,
            "label": "翔安区",
            "level": 3,
            "pid": 350200,


        }]
    }, {
        "id": 350300,
        "label": "莆田市",
        "level": 2,
        "pid": 350000,

        "children": [{
            "id": 350302,
            "label": "城厢区",
            "level": 3,
            "pid": 350300,


        }, {
            "id": 350303,
            "label": "涵江区",
            "level": 3,
            "pid": 350300,


        }, {
            "id": 350304,
            "label": "荔城区",
            "level": 3,
            "pid": 350300,


        }, {
            "id": 350305,
            "label": "秀屿区",
            "level": 3,
            "pid": 350300,


        }, {
            "id": 350322,
            "label": "仙游县",
            "level": 3,
            "pid": 350300,


        }]
    }, {
        "id": 350400,
        "label": "三明市",
        "level": 2,
        "pid": 350000,

        "children": [{
            "id": 350402,
            "label": "梅列区",
            "level": 3,
            "pid": 350400,


        }, {
            "id": 350403,
            "label": "三元区",
            "level": 3,
            "pid": 350400,


        }, {
            "id": 350421,
            "label": "明溪县",
            "level": 3,
            "pid": 350400,


        }, {
            "id": 350423,
            "label": "清流县",
            "level": 3,
            "pid": 350400,


        }, {
            "id": 350424,
            "label": "宁化县",
            "level": 3,
            "pid": 350400,


        }, {
            "id": 350425,
            "label": "大田县",
            "level": 3,
            "pid": 350400,


        }, {
            "id": 350426,
            "label": "尤溪县",
            "level": 3,
            "pid": 350400,


        }, {
            "id": 350427,
            "label": "沙县",
            "level": 3,
            "pid": 350400,


        }, {
            "id": 350428,
            "label": "将乐县",
            "level": 3,
            "pid": 350400,


        }, {
            "id": 350429,
            "label": "泰宁县",
            "level": 3,
            "pid": 350400,


        }, {
            "id": 350430,
            "label": "建宁县",
            "level": 3,
            "pid": 350400,


        }, {
            "id": 350481,
            "label": "永安市",
            "level": 3,
            "pid": 350400,


        }]
    }, {
        "id": 350500,
        "label": "泉州市",
        "level": 2,
        "pid": 350000,

        "children": [{
            "id": 350502,
            "label": "鲤城区",
            "level": 3,
            "pid": 350500,


        }, {
            "id": 350503,
            "label": "丰泽区",
            "level": 3,
            "pid": 350500,


        }, {
            "id": 350504,
            "label": "洛江区",
            "level": 3,
            "pid": 350500,


        }, {
            "id": 350505,
            "label": "泉港区",
            "level": 3,
            "pid": 350500,


        }, {
            "id": 350521,
            "label": "惠安县",
            "level": 3,
            "pid": 350500,


        }, {
            "id": 350524,
            "label": "安溪县",
            "level": 3,
            "pid": 350500,


        }, {
            "id": 350525,
            "label": "永春县",
            "level": 3,
            "pid": 350500,


        }, {
            "id": 350526,
            "label": "德化县",
            "level": 3,
            "pid": 350500,


        }, {
            "id": 350527,
            "label": "金门县",
            "level": 3,
            "pid": 350500,


        }, {
            "id": 350581,
            "label": "石狮市",
            "level": 3,
            "pid": 350500,


        }, {
            "id": 350582,
            "label": "晋江市",
            "level": 3,
            "pid": 350500,


        }, {
            "id": 350583,
            "label": "南安市",
            "level": 3,
            "pid": 350500,


        }]
    }, {
        "id": 350600,
        "label": "漳州市",
        "level": 2,
        "pid": 350000,

        "children": [{
            "id": 350602,
            "label": "芗城区",
            "level": 3,
            "pid": 350600,


        }, {
            "id": 350603,
            "label": "龙文区",
            "level": 3,
            "pid": 350600,


        }, {
            "id": 350622,
            "label": "云霄县",
            "level": 3,
            "pid": 350600,


        }, {
            "id": 350623,
            "label": "漳浦县",
            "level": 3,
            "pid": 350600,


        }, {
            "id": 350624,
            "label": "诏安县",
            "level": 3,
            "pid": 350600,


        }, {
            "id": 350625,
            "label": "长泰县",
            "level": 3,
            "pid": 350600,


        }, {
            "id": 350626,
            "label": "东山县",
            "level": 3,
            "pid": 350600,


        }, {
            "id": 350627,
            "label": "南靖县",
            "level": 3,
            "pid": 350600,


        }, {
            "id": 350628,
            "label": "平和县",
            "level": 3,
            "pid": 350600,


        }, {
            "id": 350629,
            "label": "华安县",
            "level": 3,
            "pid": 350600,


        }, {
            "id": 350681,
            "label": "龙海市",
            "level": 3,
            "pid": 350600,


        }]
    }, {
        "id": 350700,
        "label": "南平市",
        "level": 2,
        "pid": 350000,

        "children": [{
            "id": 350702,
            "label": "延平区",
            "level": 3,
            "pid": 350700,


        }, {
            "id": 350703,
            "label": "建阳区",
            "level": 3,
            "pid": 350700,


        }, {
            "id": 350721,
            "label": "顺昌县",
            "level": 3,
            "pid": 350700,


        }, {
            "id": 350722,
            "label": "浦城县",
            "level": 3,
            "pid": 350700,


        }, {
            "id": 350723,
            "label": "光泽县",
            "level": 3,
            "pid": 350700,


        }, {
            "id": 350724,
            "label": "松溪县",
            "level": 3,
            "pid": 350700,


        }, {
            "id": 350725,
            "label": "政和县",
            "level": 3,
            "pid": 350700,


        }, {
            "id": 350781,
            "label": "邵武市",
            "level": 3,
            "pid": 350700,


        }, {
            "id": 350782,
            "label": "武夷山市",
            "level": 3,
            "pid": 350700,


        }, {
            "id": 350783,
            "label": "建瓯市",
            "level": 3,
            "pid": 350700,


        }]
    }, {
        "id": 350800,
        "label": "龙岩市",
        "level": 2,
        "pid": 350000,

        "children": [{
            "id": 350802,
            "label": "新罗区",
            "level": 3,
            "pid": 350800,


        }, {
            "id": 350821,
            "label": "长汀县",
            "level": 3,
            "pid": 350800,


        }, {
            "id": 350822,
            "label": "永定区",
            "level": 3,
            "pid": 350800,


        }, {
            "id": 350823,
            "label": "上杭县",
            "level": 3,
            "pid": 350800,


        }, {
            "id": 350824,
            "label": "武平县",
            "level": 3,
            "pid": 350800,


        }, {
            "id": 350825,
            "label": "连城县",
            "level": 3,
            "pid": 350800,


        }, {
            "id": 350881,
            "label": "漳平市",
            "level": 3,
            "pid": 350800,


        }]
    }, {
        "id": 350900,
        "label": "宁德市",
        "level": 2,
        "pid": 350000,

        "children": [{
            "id": 350902,
            "label": "蕉城区",
            "level": 3,
            "pid": 350900,


        }, {
            "id": 350921,
            "label": "霞浦县",
            "level": 3,
            "pid": 350900,


        }, {
            "id": 350922,
            "label": "古田县",
            "level": 3,
            "pid": 350900,


        }, {
            "id": 350923,
            "label": "屏南县",
            "level": 3,
            "pid": 350900,


        }, {
            "id": 350924,
            "label": "寿宁县",
            "level": 3,
            "pid": 350900,


        }, {
            "id": 350925,
            "label": "周宁县",
            "level": 3,
            "pid": 350900,


        }, {
            "id": 350926,
            "label": "柘荣县",
            "level": 3,
            "pid": 350900,


        }, {
            "id": 350981,
            "label": "福安市",
            "level": 3,
            "pid": 350900,


        }, {
            "id": 350982,
            "label": "福鼎市",
            "level": 3,
            "pid": 350900,


        }]
    }]
}, {
    "id": 360000,
    "label": "江西省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 360100,
        "label": "南昌市",
        "level": 2,
        "pid": 360000,

        "children": [{
            "id": 360102,
            "label": "东湖区",
            "level": 3,
            "pid": 360100,


        }, {
            "id": 360103,
            "label": "西湖区",
            "level": 3,
            "pid": 360100,


        }, {
            "id": 360104,
            "label": "青云谱区",
            "level": 3,
            "pid": 360100,


        }, {
            "id": 360105,
            "label": "湾里区",
            "level": 3,
            "pid": 360100,


        }, {
            "id": 360111,
            "label": "青山湖区",
            "level": 3,
            "pid": 360100,


        }, {
            "id": 360121,
            "label": "南昌县",
            "level": 3,
            "pid": 360100,


        }, {
            "id": 360122,
            "label": "新建县",
            "level": 3,
            "pid": 360100,


        }, {
            "id": 360123,
            "label": "安义县",
            "level": 3,
            "pid": 360100,


        }, {
            "id": 360124,
            "label": "进贤县",
            "level": 3,
            "pid": 360100,


        }]
    }, {
        "id": 360200,
        "label": "景德镇市",
        "level": 2,
        "pid": 360000,

        "children": [{
            "id": 360202,
            "label": "昌江区",
            "level": 3,
            "pid": 360200,


        }, {
            "id": 360203,
            "label": "珠山区",
            "level": 3,
            "pid": 360200,


        }, {
            "id": 360222,
            "label": "浮梁县",
            "level": 3,
            "pid": 360200,


        }, {
            "id": 360281,
            "label": "乐平市",
            "level": 3,
            "pid": 360200,


        }]
    }, {
        "id": 360300,
        "label": "萍乡市",
        "level": 2,
        "pid": 360000,

        "children": [{
            "id": 360302,
            "label": "安源区",
            "level": 3,
            "pid": 360300,


        }, {
            "id": 360313,
            "label": "湘东区",
            "level": 3,
            "pid": 360300,


        }, {
            "id": 360321,
            "label": "莲花县",
            "level": 3,
            "pid": 360300,


        }, {
            "id": 360322,
            "label": "上栗县",
            "level": 3,
            "pid": 360300,


        }, {
            "id": 360323,
            "label": "芦溪县",
            "level": 3,
            "pid": 360300,


        }]
    }, {
        "id": 360400,
        "label": "九江市",
        "level": 2,
        "pid": 360000,

        "children": [{
            "id": 360402,
            "label": "庐山区",
            "level": 3,
            "pid": 360400,


        }, {
            "id": 360403,
            "label": "浔阳区",
            "level": 3,
            "pid": 360400,


        }, {
            "id": 360421,
            "label": "九江县",
            "level": 3,
            "pid": 360400,


        }, {
            "id": 360423,
            "label": "武宁县",
            "level": 3,
            "pid": 360400,


        }, {
            "id": 360424,
            "label": "修水县",
            "level": 3,
            "pid": 360400,


        }, {
            "id": 360425,
            "label": "永修县",
            "level": 3,
            "pid": 360400,


        }, {
            "id": 360426,
            "label": "德安县",
            "level": 3,
            "pid": 360400,


        }, {
            "id": 360427,
            "label": "星子县",
            "level": 3,
            "pid": 360400,


        }, {
            "id": 360428,
            "label": "都昌县",
            "level": 3,
            "pid": 360400,


        }, {
            "id": 360429,
            "label": "湖口县",
            "level": 3,
            "pid": 360400,


        }, {
            "id": 360430,
            "label": "彭泽县",
            "level": 3,
            "pid": 360400,


        }, {
            "id": 360481,
            "label": "瑞昌市",
            "level": 3,
            "pid": 360400,


        }, {
            "id": 360482,
            "label": "共青城市",
            "level": 3,
            "pid": 360400,


        }]
    }, {
        "id": 360500,
        "label": "新余市",
        "level": 2,
        "pid": 360000,

        "children": [{
            "id": 360502,
            "label": "渝水区",
            "level": 3,
            "pid": 360500,


        }, {
            "id": 360521,
            "label": "分宜县",
            "level": 3,
            "pid": 360500,


        }]
    }, {
        "id": 360600,
        "label": "鹰潭市",
        "level": 2,
        "pid": 360000,

        "children": [{
            "id": 360602,
            "label": "月湖区",
            "level": 3,
            "pid": 360600,


        }, {
            "id": 360622,
            "label": "余江县",
            "level": 3,
            "pid": 360600,


        }, {
            "id": 360681,
            "label": "贵溪市",
            "level": 3,
            "pid": 360600,


        }]
    }, {
        "id": 360700,
        "label": "赣州市",
        "level": 2,
        "pid": 360000,

        "children": [{
            "id": 360702,
            "label": "章贡区",
            "level": 3,
            "pid": 360700,


        }, {
            "id": 360703,
            "label": "南康区",
            "level": 3,
            "pid": 360700,


        }, {
            "id": 360721,
            "label": "赣县",
            "level": 3,
            "pid": 360700,


        }, {
            "id": 360722,
            "label": "信丰县",
            "level": 3,
            "pid": 360700,


        }, {
            "id": 360723,
            "label": "大余县",
            "level": 3,
            "pid": 360700,


        }, {
            "id": 360724,
            "label": "上犹县",
            "level": 3,
            "pid": 360700,


        }, {
            "id": 360725,
            "label": "崇义县",
            "level": 3,
            "pid": 360700,


        }, {
            "id": 360726,
            "label": "安远县",
            "level": 3,
            "pid": 360700,


        }, {
            "id": 360727,
            "label": "龙南县",
            "level": 3,
            "pid": 360700,


        }, {
            "id": 360728,
            "label": "定南县",
            "level": 3,
            "pid": 360700,


        }, {
            "id": 360729,
            "label": "全南县",
            "level": 3,
            "pid": 360700,


        }, {
            "id": 360730,
            "label": "宁都县",
            "level": 3,
            "pid": 360700,


        }, {
            "id": 360731,
            "label": "于都县",
            "level": 3,
            "pid": 360700,


        }, {
            "id": 360732,
            "label": "兴国县",
            "level": 3,
            "pid": 360700,


        }, {
            "id": 360733,
            "label": "会昌县",
            "level": 3,
            "pid": 360700,


        }, {
            "id": 360734,
            "label": "寻乌县",
            "level": 3,
            "pid": 360700,


        }, {
            "id": 360735,
            "label": "石城县",
            "level": 3,
            "pid": 360700,


        }, {
            "id": 360781,
            "label": "瑞金市",
            "level": 3,
            "pid": 360700,


        }]
    }, {
        "id": 360800,
        "label": "吉安市",
        "level": 2,
        "pid": 360000,

        "children": [{
            "id": 360802,
            "label": "吉州区",
            "level": 3,
            "pid": 360800,


        }, {
            "id": 360803,
            "label": "青原区",
            "level": 3,
            "pid": 360800,


        }, {
            "id": 360821,
            "label": "吉安县",
            "level": 3,
            "pid": 360800,


        }, {
            "id": 360822,
            "label": "吉水县",
            "level": 3,
            "pid": 360800,


        }, {
            "id": 360823,
            "label": "峡江县",
            "level": 3,
            "pid": 360800,


        }, {
            "id": 360824,
            "label": "新干县",
            "level": 3,
            "pid": 360800,


        }, {
            "id": 360825,
            "label": "永丰县",
            "level": 3,
            "pid": 360800,


        }, {
            "id": 360826,
            "label": "泰和县",
            "level": 3,
            "pid": 360800,


        }, {
            "id": 360827,
            "label": "遂川县",
            "level": 3,
            "pid": 360800,


        }, {
            "id": 360828,
            "label": "万安县",
            "level": 3,
            "pid": 360800,


        }, {
            "id": 360829,
            "label": "安福县",
            "level": 3,
            "pid": 360800,


        }, {
            "id": 360830,
            "label": "永新县",
            "level": 3,
            "pid": 360800,


        }, {
            "id": 360881,
            "label": "井冈山市",
            "level": 3,
            "pid": 360800,


        }]
    }, {
        "id": 360900,
        "label": "宜春市",
        "level": 2,
        "pid": 360000,

        "children": [{
            "id": 360902,
            "label": "袁州区",
            "level": 3,
            "pid": 360900,


        }, {
            "id": 360921,
            "label": "奉新县",
            "level": 3,
            "pid": 360900,


        }, {
            "id": 360922,
            "label": "万载县",
            "level": 3,
            "pid": 360900,


        }, {
            "id": 360923,
            "label": "上高县",
            "level": 3,
            "pid": 360900,


        }, {
            "id": 360924,
            "label": "宜丰县",
            "level": 3,
            "pid": 360900,


        }, {
            "id": 360925,
            "label": "靖安县",
            "level": 3,
            "pid": 360900,


        }, {
            "id": 360926,
            "label": "铜鼓县",
            "level": 3,
            "pid": 360900,


        }, {
            "id": 360981,
            "label": "丰城市",
            "level": 3,
            "pid": 360900,


        }, {
            "id": 360982,
            "label": "樟树市",
            "level": 3,
            "pid": 360900,


        }, {
            "id": 360983,
            "label": "高安市",
            "level": 3,
            "pid": 360900,


        }]
    }, {
        "id": 361000,
        "label": "抚州市",
        "level": 2,
        "pid": 360000,

        "children": [{
            "id": 361002,
            "label": "临川区",
            "level": 3,
            "pid": 361000,


        }, {
            "id": 361021,
            "label": "南城县",
            "level": 3,
            "pid": 361000,


        }, {
            "id": 361022,
            "label": "黎川县",
            "level": 3,
            "pid": 361000,


        }, {
            "id": 361023,
            "label": "南丰县",
            "level": 3,
            "pid": 361000,


        }, {
            "id": 361024,
            "label": "崇仁县",
            "level": 3,
            "pid": 361000,


        }, {
            "id": 361025,
            "label": "乐安县",
            "level": 3,
            "pid": 361000,


        }, {
            "id": 361026,
            "label": "宜黄县",
            "level": 3,
            "pid": 361000,


        }, {
            "id": 361027,
            "label": "金溪县",
            "level": 3,
            "pid": 361000,


        }, {
            "id": 361028,
            "label": "资溪县",
            "level": 3,
            "pid": 361000,


        }, {
            "id": 361029,
            "label": "东乡县",
            "level": 3,
            "pid": 361000,


        }, {
            "id": 361030,
            "label": "广昌县",
            "level": 3,
            "pid": 361000,


        }]
    }, {
        "id": 361100,
        "label": "上饶市",
        "level": 2,
        "pid": 360000,

        "children": [{
            "id": 361102,
            "label": "信州区",
            "level": 3,
            "pid": 361100,


        }, {
            "id": 361121,
            "label": "上饶县",
            "level": 3,
            "pid": 361100,


        }, {
            "id": 361122,
            "label": "广丰县",
            "level": 3,
            "pid": 361100,


        }, {
            "id": 361123,
            "label": "玉山县",
            "level": 3,
            "pid": 361100,


        }, {
            "id": 361124,
            "label": "铅山县",
            "level": 3,
            "pid": 361100,


        }, {
            "id": 361125,
            "label": "横峰县",
            "level": 3,
            "pid": 361100,


        }, {
            "id": 361126,
            "label": "弋阳县",
            "level": 3,
            "pid": 361100,


        }, {
            "id": 361127,
            "label": "余干县",
            "level": 3,
            "pid": 361100,


        }, {
            "id": 361128,
            "label": "鄱阳县",
            "level": 3,
            "pid": 361100,


        }, {
            "id": 361129,
            "label": "万年县",
            "level": 3,
            "pid": 361100,


        }, {
            "id": 361130,
            "label": "婺源县",
            "level": 3,
            "pid": 361100,


        }, {
            "id": 361181,
            "label": "德兴市",
            "level": 3,
            "pid": 361100,


        }]
    }]
}, {
    "id": 370000,
    "label": "山东省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 370100,
        "label": "济南市",
        "level": 2,
        "pid": 370000,

        "children": [{
            "id": 370102,
            "label": "历下区",
            "level": 3,
            "pid": 370100,


        }, {
            "id": 370103,
            "label": "市中区",
            "level": 3,
            "pid": 370100,


        }, {
            "id": 370104,
            "label": "槐荫区",
            "level": 3,
            "pid": 370100,


        }, {
            "id": 370105,
            "label": "天桥区",
            "level": 3,
            "pid": 370100,


        }, {
            "id": 370112,
            "label": "历城区",
            "level": 3,
            "pid": 370100,


        }, {
            "id": 370113,
            "label": "长清区",
            "level": 3,
            "pid": 370100,


        }, {
            "id": 370124,
            "label": "平阴县",
            "level": 3,
            "pid": 370100,


        }, {
            "id": 370125,
            "label": "济阳县",
            "level": 3,
            "pid": 370100,


        }, {
            "id": 370126,
            "label": "商河县",
            "level": 3,
            "pid": 370100,


        }, {
            "id": 370181,
            "label": "章丘市",
            "level": 3,
            "pid": 370100,


        }]
    }, {
        "id": 370200,
        "label": "青岛市",
        "level": 2,
        "pid": 370000,

        "children": [{
            "id": 370202,
            "label": "市南区",
            "level": 3,
            "pid": 370200,


        }, {
            "id": 370203,
            "label": "市北区",
            "level": 3,
            "pid": 370200,


        }, {
            "id": 370211,
            "label": "黄岛区",
            "level": 3,
            "pid": 370200,


        }, {
            "id": 370212,
            "label": "崂山区",
            "level": 3,
            "pid": 370200,


        }, {
            "id": 370213,
            "label": "李沧区",
            "level": 3,
            "pid": 370200,


        }, {
            "id": 370214,
            "label": "城阳区",
            "level": 3,
            "pid": 370200,


        }, {
            "id": 370281,
            "label": "胶州市",
            "level": 3,
            "pid": 370200,


        }, {
            "id": 370282,
            "label": "即墨市",
            "level": 3,
            "pid": 370200,


        }, {
            "id": 370283,
            "label": "平度市",
            "level": 3,
            "pid": 370200,


        }, {
            "id": 370285,
            "label": "莱西市",
            "level": 3,
            "pid": 370200,


        }, {
            "id": 370286,
            "label": "西海岸新区",
            "level": 3,
            "pid": 370200,


        }]
    }, {
        "id": 370300,
        "label": "淄博市",
        "level": 2,
        "pid": 370000,

        "children": [{
            "id": 370302,
            "label": "淄川区",
            "level": 3,
            "pid": 370300,


        }, {
            "id": 370303,
            "label": "张店区",
            "level": 3,
            "pid": 370300,


        }, {
            "id": 370304,
            "label": "博山区",
            "level": 3,
            "pid": 370300,


        }, {
            "id": 370305,
            "label": "临淄区",
            "level": 3,
            "pid": 370300,


        }, {
            "id": 370306,
            "label": "周村区",
            "level": 3,
            "pid": 370300,


        }, {
            "id": 370321,
            "label": "桓台县",
            "level": 3,
            "pid": 370300,


        }, {
            "id": 370322,
            "label": "高青县",
            "level": 3,
            "pid": 370300,


        }, {
            "id": 370323,
            "label": "沂源县",
            "level": 3,
            "pid": 370300,


        }]
    }, {
        "id": 370400,
        "label": "枣庄市",
        "level": 2,
        "pid": 370000,

        "children": [{
            "id": 370402,
            "label": "市中区",
            "level": 3,
            "pid": 370400,


        }, {
            "id": 370403,
            "label": "薛城区",
            "level": 3,
            "pid": 370400,


        }, {
            "id": 370404,
            "label": "峄城区",
            "level": 3,
            "pid": 370400,


        }, {
            "id": 370405,
            "label": "台儿庄区",
            "level": 3,
            "pid": 370400,


        }, {
            "id": 370406,
            "label": "山亭区",
            "level": 3,
            "pid": 370400,


        }, {
            "id": 370481,
            "label": "滕州市",
            "level": 3,
            "pid": 370400,


        }]
    }, {
        "id": 370500,
        "label": "东营市",
        "level": 2,
        "pid": 370000,

        "children": [{
            "id": 370502,
            "label": "东营区",
            "level": 3,
            "pid": 370500,


        }, {
            "id": 370503,
            "label": "河口区",
            "level": 3,
            "pid": 370500,


        }, {
            "id": 370521,
            "label": "垦利县",
            "level": 3,
            "pid": 370500,


        }, {
            "id": 370522,
            "label": "利津县",
            "level": 3,
            "pid": 370500,


        }, {
            "id": 370523,
            "label": "广饶县",
            "level": 3,
            "pid": 370500,


        }]
    }, {
        "id": 370600,
        "label": "烟台市",
        "level": 2,
        "pid": 370000,

        "children": [{
            "id": 370602,
            "label": "芝罘区",
            "level": 3,
            "pid": 370600,


        }, {
            "id": 370611,
            "label": "福山区",
            "level": 3,
            "pid": 370600,


        }, {
            "id": 370612,
            "label": "牟平区",
            "level": 3,
            "pid": 370600,


        }, {
            "id": 370613,
            "label": "莱山区",
            "level": 3,
            "pid": 370600,


        }, {
            "id": 370634,
            "label": "长岛县",
            "level": 3,
            "pid": 370600,


        }, {
            "id": 370681,
            "label": "龙口市",
            "level": 3,
            "pid": 370600,


        }, {
            "id": 370682,
            "label": "莱阳市",
            "level": 3,
            "pid": 370600,


        }, {
            "id": 370683,
            "label": "莱州市",
            "level": 3,
            "pid": 370600,


        }, {
            "id": 370684,
            "label": "蓬莱市",
            "level": 3,
            "pid": 370600,


        }, {
            "id": 370685,
            "label": "招远市",
            "level": 3,
            "pid": 370600,


        }, {
            "id": 370686,
            "label": "栖霞市",
            "level": 3,
            "pid": 370600,


        }, {
            "id": 370687,
            "label": "海阳市",
            "level": 3,
            "pid": 370600,


        }]
    }, {
        "id": 370700,
        "label": "潍坊市",
        "level": 2,
        "pid": 370000,

        "children": [{
            "id": 370702,
            "label": "潍城区",
            "level": 3,
            "pid": 370700,


        }, {
            "id": 370703,
            "label": "寒亭区",
            "level": 3,
            "pid": 370700,


        }, {
            "id": 370704,
            "label": "坊子区",
            "level": 3,
            "pid": 370700,


        }, {
            "id": 370705,
            "label": "奎文区",
            "level": 3,
            "pid": 370700,


        }, {
            "id": 370724,
            "label": "临朐县",
            "level": 3,
            "pid": 370700,


        }, {
            "id": 370725,
            "label": "昌乐县",
            "level": 3,
            "pid": 370700,


        }, {
            "id": 370781,
            "label": "青州市",
            "level": 3,
            "pid": 370700,


        }, {
            "id": 370782,
            "label": "诸城市",
            "level": 3,
            "pid": 370700,


        }, {
            "id": 370783,
            "label": "寿光市",
            "level": 3,
            "pid": 370700,


        }, {
            "id": 370784,
            "label": "安丘市",
            "level": 3,
            "pid": 370700,


        }, {
            "id": 370785,
            "label": "高密市",
            "level": 3,
            "pid": 370700,


        }, {
            "id": 370786,
            "label": "昌邑市",
            "level": 3,
            "pid": 370700,


        }]
    }, {
        "id": 370800,
        "label": "济宁市",
        "level": 2,
        "pid": 370000,

        "children": [{
            "id": 370811,
            "label": "任城区",
            "level": 3,
            "pid": 370800,


        }, {
            "id": 370812,
            "label": "兖州区",
            "level": 3,
            "pid": 370800,


        }, {
            "id": 370826,
            "label": "微山县",
            "level": 3,
            "pid": 370800,


        }, {
            "id": 370827,
            "label": "鱼台县",
            "level": 3,
            "pid": 370800,


        }, {
            "id": 370828,
            "label": "金乡县",
            "level": 3,
            "pid": 370800,


        }, {
            "id": 370829,
            "label": "嘉祥县",
            "level": 3,
            "pid": 370800,


        }, {
            "id": 370830,
            "label": "汶上县",
            "level": 3,
            "pid": 370800,


        }, {
            "id": 370831,
            "label": "泗水县",
            "level": 3,
            "pid": 370800,


        }, {
            "id": 370832,
            "label": "梁山县",
            "level": 3,
            "pid": 370800,


        }, {
            "id": 370881,
            "label": "曲阜市",
            "level": 3,
            "pid": 370800,


        }, {
            "id": 370883,
            "label": "邹城市",
            "level": 3,
            "pid": 370800,


        }]
    }, {
        "id": 370900,
        "label": "泰安市",
        "level": 2,
        "pid": 370000,

        "children": [{
            "id": 370902,
            "label": "泰山区",
            "level": 3,
            "pid": 370900,


        }, {
            "id": 370911,
            "label": "岱岳区",
            "level": 3,
            "pid": 370900,


        }, {
            "id": 370921,
            "label": "宁阳县",
            "level": 3,
            "pid": 370900,


        }, {
            "id": 370923,
            "label": "东平县",
            "level": 3,
            "pid": 370900,


        }, {
            "id": 370982,
            "label": "新泰市",
            "level": 3,
            "pid": 370900,


        }, {
            "id": 370983,
            "label": "肥城市",
            "level": 3,
            "pid": 370900,


        }]
    }, {
        "id": 371000,
        "label": "威海市",
        "level": 2,
        "pid": 370000,

        "children": [{
            "id": 371002,
            "label": "环翠区",
            "level": 3,
            "pid": 371000,


        }, {
            "id": 371003,
            "label": "文登区",
            "level": 3,
            "pid": 371000,


        }, {
            "id": 371082,
            "label": "荣成市",
            "level": 3,
            "pid": 371000,


        }, {
            "id": 371083,
            "label": "乳山市",
            "level": 3,
            "pid": 371000,


        }]
    }, {
        "id": 371100,
        "label": "日照市",
        "level": 2,
        "pid": 370000,

        "children": [{
            "id": 371102,
            "label": "东港区",
            "level": 3,
            "pid": 371100,


        }, {
            "id": 371103,
            "label": "岚山区",
            "level": 3,
            "pid": 371100,


        }, {
            "id": 371121,
            "label": "五莲县",
            "level": 3,
            "pid": 371100,


        }, {
            "id": 371122,
            "label": "莒县",
            "level": 3,
            "pid": 371100,


        }]
    }, {
        "id": 371200,
        "label": "莱芜市",
        "level": 2,
        "pid": 370000,

        "children": [{
            "id": 371202,
            "label": "莱城区",
            "level": 3,
            "pid": 371200,


        }, {
            "id": 371203,
            "label": "钢城区",
            "level": 3,
            "pid": 371200,


        }]
    }, {
        "id": 371300,
        "label": "临沂市",
        "level": 2,
        "pid": 370000,

        "children": [{
            "id": 371302,
            "label": "兰山区",
            "level": 3,
            "pid": 371300,


        }, {
            "id": 371311,
            "label": "罗庄区",
            "level": 3,
            "pid": 371300,


        }, {
            "id": 371312,
            "label": "河东区",
            "level": 3,
            "pid": 371300,


        }, {
            "id": 371321,
            "label": "沂南县",
            "level": 3,
            "pid": 371300,


        }, {
            "id": 371322,
            "label": "郯城县",
            "level": 3,
            "pid": 371300,


        }, {
            "id": 371323,
            "label": "沂水县",
            "level": 3,
            "pid": 371300,


        }, {
            "id": 371324,
            "label": "兰陵县",
            "level": 3,
            "pid": 371300,


        }, {
            "id": 371325,
            "label": "费县",
            "level": 3,
            "pid": 371300,


        }, {
            "id": 371326,
            "label": "平邑县",
            "level": 3,
            "pid": 371300,


        }, {
            "id": 371327,
            "label": "莒南县",
            "level": 3,
            "pid": 371300,


        }, {
            "id": 371328,
            "label": "蒙阴县",
            "level": 3,
            "pid": 371300,


        }, {
            "id": 371329,
            "label": "临沭县",
            "level": 3,
            "pid": 371300,


        }]
    }, {
        "id": 371400,
        "label": "德州市",
        "level": 2,
        "pid": 370000,

        "children": [{
            "id": 371402,
            "label": "德城区",
            "level": 3,
            "pid": 371400,


        }, {
            "id": 371403,
            "label": "陵城区",
            "level": 3,
            "pid": 371400,


        }, {
            "id": 371422,
            "label": "宁津县",
            "level": 3,
            "pid": 371400,


        }, {
            "id": 371423,
            "label": "庆云县",
            "level": 3,
            "pid": 371400,


        }, {
            "id": 371424,
            "label": "临邑县",
            "level": 3,
            "pid": 371400,


        }, {
            "id": 371425,
            "label": "齐河县",
            "level": 3,
            "pid": 371400,


        }, {
            "id": 371426,
            "label": "平原县",
            "level": 3,
            "pid": 371400,


        }, {
            "id": 371427,
            "label": "夏津县",
            "level": 3,
            "pid": 371400,


        }, {
            "id": 371428,
            "label": "武城县",
            "level": 3,
            "pid": 371400,


        }, {
            "id": 371481,
            "label": "乐陵市",
            "level": 3,
            "pid": 371400,


        }, {
            "id": 371482,
            "label": "禹城市",
            "level": 3,
            "pid": 371400,


        }]
    }, {
        "id": 371500,
        "label": "聊城市",
        "level": 2,
        "pid": 370000,

        "children": [{
            "id": 371502,
            "label": "东昌府区",
            "level": 3,
            "pid": 371500,


        }, {
            "id": 371521,
            "label": "阳谷县",
            "level": 3,
            "pid": 371500,


        }, {
            "id": 371522,
            "label": "莘县",
            "level": 3,
            "pid": 371500,


        }, {
            "id": 371523,
            "label": "茌平县",
            "level": 3,
            "pid": 371500,


        }, {
            "id": 371524,
            "label": "东阿县",
            "level": 3,
            "pid": 371500,


        }, {
            "id": 371525,
            "label": "冠县",
            "level": 3,
            "pid": 371500,


        }, {
            "id": 371526,
            "label": "高唐县",
            "level": 3,
            "pid": 371500,


        }, {
            "id": 371581,
            "label": "临清市",
            "level": 3,
            "pid": 371500,


        }]
    }, {
        "id": 371600,
        "label": "滨州市",
        "level": 2,
        "pid": 370000,

        "children": [{
            "id": 371602,
            "label": "滨城区",
            "level": 3,
            "pid": 371600,


        }, {
            "id": 371603,
            "label": "沾化区",
            "level": 3,
            "pid": 371600,


        }, {
            "id": 371621,
            "label": "惠民县",
            "level": 3,
            "pid": 371600,


        }, {
            "id": 371622,
            "label": "阳信县",
            "level": 3,
            "pid": 371600,


        }, {
            "id": 371623,
            "label": "无棣县",
            "level": 3,
            "pid": 371600,


        }, {
            "id": 371625,
            "label": "博兴县",
            "level": 3,
            "pid": 371600,


        }, {
            "id": 371626,
            "label": "邹平县",
            "level": 3,
            "pid": 371600,


        }, {
            "id": 371627,
            "label": "北海新区",
            "level": 3,
            "pid": 371600,


        }]
    }, {
        "id": 371700,
        "label": "菏泽市",
        "level": 2,
        "pid": 370000,

        "children": [{
            "id": 371702,
            "label": "牡丹区",
            "level": 3,
            "pid": 371700,


        }, {
            "id": 371721,
            "label": "曹县",
            "level": 3,
            "pid": 371700,


        }, {
            "id": 371722,
            "label": "单县",
            "level": 3,
            "pid": 371700,


        }, {
            "id": 371723,
            "label": "成武县",
            "level": 3,
            "pid": 371700,


        }, {
            "id": 371724,
            "label": "巨野县",
            "level": 3,
            "pid": 371700,


        }, {
            "id": 371725,
            "label": "郓城县",
            "level": 3,
            "pid": 371700,


        }, {
            "id": 371726,
            "label": "鄄城县",
            "level": 3,
            "pid": 371700,


        }, {
            "id": 371727,
            "label": "定陶县",
            "level": 3,
            "pid": 371700,


        }, {
            "id": 371728,
            "label": "东明县",
            "level": 3,
            "pid": 371700,


        }]
    }]
}, {
    "id": 410000,
    "label": "河南省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 410100,
        "label": "郑州市",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 410102,
            "label": "中原区",
            "level": 3,
            "pid": 410100,


        }, {
            "id": 410103,
            "label": "二七区",
            "level": 3,
            "pid": 410100,


        }, {
            "id": 410104,
            "label": "管城回族区",
            "level": 3,
            "pid": 410100,


        }, {
            "id": 410105,
            "label": "金水区",
            "level": 3,
            "pid": 410100,


        }, {
            "id": 410106,
            "label": "上街区",
            "level": 3,
            "pid": 410100,


        }, {
            "id": 410108,
            "label": "惠济区",
            "level": 3,
            "pid": 410100,


        }, {
            "id": 410122,
            "label": "中牟县",
            "level": 3,
            "pid": 410100,


        }, {
            "id": 410181,
            "label": "巩义市",
            "level": 3,
            "pid": 410100,


        }, {
            "id": 410182,
            "label": "荥阳市",
            "level": 3,
            "pid": 410100,


        }, {
            "id": 410183,
            "label": "新密市",
            "level": 3,
            "pid": 410100,


        }, {
            "id": 410184,
            "label": "新郑市",
            "level": 3,
            "pid": 410100,


        }, {
            "id": 410185,
            "label": "登封市",
            "level": 3,
            "pid": 410100,


        }]
    }, {
        "id": 410200,
        "label": "开封市",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 410202,
            "label": "龙亭区",
            "level": 3,
            "pid": 410200,


        }, {
            "id": 410203,
            "label": "顺河回族区",
            "level": 3,
            "pid": 410200,


        }, {
            "id": 410204,
            "label": "鼓楼区",
            "level": 3,
            "pid": 410200,


        }, {
            "id": 410205,
            "label": "禹王台区",
            "level": 3,
            "pid": 410200,


        }, {
            "id": 410212,
            "label": "祥符区",
            "level": 3,
            "pid": 410200,


        }, {
            "id": 410221,
            "label": "杞县",
            "level": 3,
            "pid": 410200,


        }, {
            "id": 410222,
            "label": "通许县",
            "level": 3,
            "pid": 410200,


        }, {
            "id": 410223,
            "label": "尉氏县",
            "level": 3,
            "pid": 410200,


        }, {
            "id": 410225,
            "label": "兰考县",
            "level": 3,
            "pid": 410200,


        }]
    }, {
        "id": 410300,
        "label": "洛阳市",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 410302,
            "label": "老城区",
            "level": 3,
            "pid": 410300,


        }, {
            "id": 410303,
            "label": "西工区",
            "level": 3,
            "pid": 410300,


        }, {
            "id": 410304,
            "label": "瀍河回族区",
            "level": 3,
            "pid": 410300,


        }, {
            "id": 410305,
            "label": "涧西区",
            "level": 3,
            "pid": 410300,


        }, {
            "id": 410306,
            "label": "吉利区",
            "level": 3,
            "pid": 410300,


        }, {
            "id": 410311,
            "label": "洛龙区",
            "level": 3,
            "pid": 410300,


        }, {
            "id": 410322,
            "label": "孟津县",
            "level": 3,
            "pid": 410300,


        }, {
            "id": 410323,
            "label": "新安县",
            "level": 3,
            "pid": 410300,


        }, {
            "id": 410324,
            "label": "栾川县",
            "level": 3,
            "pid": 410300,


        }, {
            "id": 410325,
            "label": "嵩县",
            "level": 3,
            "pid": 410300,


        }, {
            "id": 410326,
            "label": "汝阳县",
            "level": 3,
            "pid": 410300,


        }, {
            "id": 410327,
            "label": "宜阳县",
            "level": 3,
            "pid": 410300,


        }, {
            "id": 410328,
            "label": "洛宁县",
            "level": 3,
            "pid": 410300,


        }, {
            "id": 410329,
            "label": "伊川县",
            "level": 3,
            "pid": 410300,


        }, {
            "id": 410381,
            "label": "偃师市",
            "level": 3,
            "pid": 410300,


        }]
    }, {
        "id": 410400,
        "label": "平顶山市",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 410402,
            "label": "新华区",
            "level": 3,
            "pid": 410400,


        }, {
            "id": 410403,
            "label": "卫东区",
            "level": 3,
            "pid": 410400,


        }, {
            "id": 410404,
            "label": "石龙区",
            "level": 3,
            "pid": 410400,


        }, {
            "id": 410411,
            "label": "湛河区",
            "level": 3,
            "pid": 410400,


        }, {
            "id": 410421,
            "label": "宝丰县",
            "level": 3,
            "pid": 410400,


        }, {
            "id": 410422,
            "label": "叶县",
            "level": 3,
            "pid": 410400,


        }, {
            "id": 410423,
            "label": "鲁山县",
            "level": 3,
            "pid": 410400,


        }, {
            "id": 410425,
            "label": "郏县",
            "level": 3,
            "pid": 410400,


        }, {
            "id": 410481,
            "label": "舞钢市",
            "level": 3,
            "pid": 410400,


        }, {
            "id": 410482,
            "label": "汝州市",
            "level": 3,
            "pid": 410400,


        }]
    }, {
        "id": 410500,
        "label": "安阳市",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 410502,
            "label": "文峰区",
            "level": 3,
            "pid": 410500,


        }, {
            "id": 410503,
            "label": "北关区",
            "level": 3,
            "pid": 410500,


        }, {
            "id": 410505,
            "label": "殷都区",
            "level": 3,
            "pid": 410500,


        }, {
            "id": 410506,
            "label": "龙安区",
            "level": 3,
            "pid": 410500,


        }, {
            "id": 410522,
            "label": "安阳县",
            "level": 3,
            "pid": 410500,


        }, {
            "id": 410523,
            "label": "汤阴县",
            "level": 3,
            "pid": 410500,


        }, {
            "id": 410526,
            "label": "滑县",
            "level": 3,
            "pid": 410500,


        }, {
            "id": 410527,
            "label": "内黄县",
            "level": 3,
            "pid": 410500,


        }, {
            "id": 410581,
            "label": "林州市",
            "level": 3,
            "pid": 410500,


        }]
    }, {
        "id": 410600,
        "label": "鹤壁市",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 410602,
            "label": "鹤山区",
            "level": 3,
            "pid": 410600,


        }, {
            "id": 410603,
            "label": "山城区",
            "level": 3,
            "pid": 410600,


        }, {
            "id": 410611,
            "label": "淇滨区",
            "level": 3,
            "pid": 410600,


        }, {
            "id": 410621,
            "label": "浚县",
            "level": 3,
            "pid": 410600,


        }, {
            "id": 410622,
            "label": "淇县",
            "level": 3,
            "pid": 410600,


        }]
    }, {
        "id": 410700,
        "label": "新乡市",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 410702,
            "label": "红旗区",
            "level": 3,
            "pid": 410700,


        }, {
            "id": 410703,
            "label": "卫滨区",
            "level": 3,
            "pid": 410700,


        }, {
            "id": 410704,
            "label": "凤泉区",
            "level": 3,
            "pid": 410700,


        }, {
            "id": 410711,
            "label": "牧野区",
            "level": 3,
            "pid": 410700,


        }, {
            "id": 410721,
            "label": "新乡县",
            "level": 3,
            "pid": 410700,


        }, {
            "id": 410724,
            "label": "获嘉县",
            "level": 3,
            "pid": 410700,


        }, {
            "id": 410725,
            "label": "原阳县",
            "level": 3,
            "pid": 410700,


        }, {
            "id": 410726,
            "label": "延津县",
            "level": 3,
            "pid": 410700,


        }, {
            "id": 410727,
            "label": "封丘县",
            "level": 3,
            "pid": 410700,


        }, {
            "id": 410728,
            "label": "长垣县",
            "level": 3,
            "pid": 410700,


        }, {
            "id": 410781,
            "label": "卫辉市",
            "level": 3,
            "pid": 410700,


        }, {
            "id": 410782,
            "label": "辉县市",
            "level": 3,
            "pid": 410700,


        }]
    }, {
        "id": 410800,
        "label": "焦作市",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 410802,
            "label": "解放区",
            "level": 3,
            "pid": 410800,


        }, {
            "id": 410803,
            "label": "中站区",
            "level": 3,
            "pid": 410800,


        }, {
            "id": 410804,
            "label": "马村区",
            "level": 3,
            "pid": 410800,


        }, {
            "id": 410811,
            "label": "山阳区",
            "level": 3,
            "pid": 410800,


        }, {
            "id": 410821,
            "label": "修武县",
            "level": 3,
            "pid": 410800,


        }, {
            "id": 410822,
            "label": "博爱县",
            "level": 3,
            "pid": 410800,


        }, {
            "id": 410823,
            "label": "武陟县",
            "level": 3,
            "pid": 410800,


        }, {
            "id": 410825,
            "label": "温县",
            "level": 3,
            "pid": 410800,


        }, {
            "id": 410882,
            "label": "沁阳市",
            "level": 3,
            "pid": 410800,


        }, {
            "id": 410883,
            "label": "孟州市",
            "level": 3,
            "pid": 410800,


        }]
    }, {
        "id": 410900,
        "label": "濮阳市",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 410902,
            "label": "华龙区",
            "level": 3,
            "pid": 410900,


        }, {
            "id": 410922,
            "label": "清丰县",
            "level": 3,
            "pid": 410900,


        }, {
            "id": 410923,
            "label": "南乐县",
            "level": 3,
            "pid": 410900,


        }, {
            "id": 410926,
            "label": "范县",
            "level": 3,
            "pid": 410900,


        }, {
            "id": 410927,
            "label": "台前县",
            "level": 3,
            "pid": 410900,


        }, {
            "id": 410928,
            "label": "濮阳县",
            "level": 3,
            "pid": 410900,


        }]
    }, {
        "id": 411000,
        "label": "许昌市",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 411002,
            "label": "魏都区",
            "level": 3,
            "pid": 411000,


        }, {
            "id": 411023,
            "label": "许昌县",
            "level": 3,
            "pid": 411000,


        }, {
            "id": 411024,
            "label": "鄢陵县",
            "level": 3,
            "pid": 411000,


        }, {
            "id": 411025,
            "label": "襄城县",
            "level": 3,
            "pid": 411000,


        }, {
            "id": 411081,
            "label": "禹州市",
            "level": 3,
            "pid": 411000,


        }, {
            "id": 411082,
            "label": "长葛市",
            "level": 3,
            "pid": 411000,


        }]
    }, {
        "id": 411100,
        "label": "漯河市",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 411102,
            "label": "源汇区",
            "level": 3,
            "pid": 411100,


        }, {
            "id": 411103,
            "label": "郾城区",
            "level": 3,
            "pid": 411100,


        }, {
            "id": 411104,
            "label": "召陵区",
            "level": 3,
            "pid": 411100,


        }, {
            "id": 411121,
            "label": "舞阳县",
            "level": 3,
            "pid": 411100,


        }, {
            "id": 411122,
            "label": "临颍县",
            "level": 3,
            "pid": 411100,


        }]
    }, {
        "id": 411200,
        "label": "三门峡市",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 411202,
            "label": "湖滨区",
            "level": 3,
            "pid": 411200,


        }, {
            "id": 411221,
            "label": "渑池县",
            "level": 3,
            "pid": 411200,


        }, {
            "id": 411222,
            "label": "陕县",
            "level": 3,
            "pid": 411200,


        }, {
            "id": 411224,
            "label": "卢氏县",
            "level": 3,
            "pid": 411200,


        }, {
            "id": 411281,
            "label": "义马市",
            "level": 3,
            "pid": 411200,


        }, {
            "id": 411282,
            "label": "灵宝市",
            "level": 3,
            "pid": 411200,


        }]
    }, {
        "id": 411300,
        "label": "南阳市",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 411302,
            "label": "宛城区",
            "level": 3,
            "pid": 411300,


        }, {
            "id": 411303,
            "label": "卧龙区",
            "level": 3,
            "pid": 411300,


        }, {
            "id": 411321,
            "label": "南召县",
            "level": 3,
            "pid": 411300,


        }, {
            "id": 411322,
            "label": "方城县",
            "level": 3,
            "pid": 411300,


        }, {
            "id": 411323,
            "label": "西峡县",
            "level": 3,
            "pid": 411300,


        }, {
            "id": 411324,
            "label": "镇平县",
            "level": 3,
            "pid": 411300,


        }, {
            "id": 411325,
            "label": "内乡县",
            "level": 3,
            "pid": 411300,


        }, {
            "id": 411326,
            "label": "淅川县",
            "level": 3,
            "pid": 411300,


        }, {
            "id": 411327,
            "label": "社旗县",
            "level": 3,
            "pid": 411300,


        }, {
            "id": 411328,
            "label": "唐河县",
            "level": 3,
            "pid": 411300,


        }, {
            "id": 411329,
            "label": "新野县",
            "level": 3,
            "pid": 411300,


        }, {
            "id": 411330,
            "label": "桐柏县",
            "level": 3,
            "pid": 411300,


        }, {
            "id": 411381,
            "label": "邓州市",
            "level": 3,
            "pid": 411300,


        }]
    }, {
        "id": 411400,
        "label": "商丘市",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 411402,
            "label": "梁园区",
            "level": 3,
            "pid": 411400,


        }, {
            "id": 411403,
            "label": "睢阳区",
            "level": 3,
            "pid": 411400,


        }, {
            "id": 411421,
            "label": "民权县",
            "level": 3,
            "pid": 411400,


        }, {
            "id": 411422,
            "label": "睢县",
            "level": 3,
            "pid": 411400,


        }, {
            "id": 411423,
            "label": "宁陵县",
            "level": 3,
            "pid": 411400,


        }, {
            "id": 411424,
            "label": "柘城县",
            "level": 3,
            "pid": 411400,


        }, {
            "id": 411425,
            "label": "虞城县",
            "level": 3,
            "pid": 411400,


        }, {
            "id": 411426,
            "label": "夏邑县",
            "level": 3,
            "pid": 411400,


        }, {
            "id": 411481,
            "label": "永城市",
            "level": 3,
            "pid": 411400,


        }]
    }, {
        "id": 411500,
        "label": "信阳市",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 411502,
            "label": "浉河区",
            "level": 3,
            "pid": 411500,


        }, {
            "id": 411503,
            "label": "平桥区",
            "level": 3,
            "pid": 411500,


        }, {
            "id": 411521,
            "label": "罗山县",
            "level": 3,
            "pid": 411500,


        }, {
            "id": 411522,
            "label": "光山县",
            "level": 3,
            "pid": 411500,


        }, {
            "id": 411523,
            "label": "新县",
            "level": 3,
            "pid": 411500,


        }, {
            "id": 411524,
            "label": "商城县",
            "level": 3,
            "pid": 411500,


        }, {
            "id": 411525,
            "label": "固始县",
            "level": 3,
            "pid": 411500,


        }, {
            "id": 411526,
            "label": "潢川县",
            "level": 3,
            "pid": 411500,


        }, {
            "id": 411527,
            "label": "淮滨县",
            "level": 3,
            "pid": 411500,


        }, {
            "id": 411528,
            "label": "息县",
            "level": 3,
            "pid": 411500,


        }]
    }, {
        "id": 411600,
        "label": "周口市",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 411602,
            "label": "川汇区",
            "level": 3,
            "pid": 411600,


        }, {
            "id": 411621,
            "label": "扶沟县",
            "level": 3,
            "pid": 411600,


        }, {
            "id": 411622,
            "label": "西华县",
            "level": 3,
            "pid": 411600,


        }, {
            "id": 411623,
            "label": "商水县",
            "level": 3,
            "pid": 411600,


        }, {
            "id": 411624,
            "label": "沈丘县",
            "level": 3,
            "pid": 411600,


        }, {
            "id": 411625,
            "label": "郸城县",
            "level": 3,
            "pid": 411600,


        }, {
            "id": 411626,
            "label": "淮阳县",
            "level": 3,
            "pid": 411600,


        }, {
            "id": 411627,
            "label": "太康县",
            "level": 3,
            "pid": 411600,


        }, {
            "id": 411628,
            "label": "鹿邑县",
            "level": 3,
            "pid": 411600,


        }, {
            "id": 411681,
            "label": "项城市",
            "level": 3,
            "pid": 411600,


        }]
    }, {
        "id": 411700,
        "label": "驻马店市",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 411702,
            "label": "驿城区",
            "level": 3,
            "pid": 411700,


        }, {
            "id": 411721,
            "label": "西平县",
            "level": 3,
            "pid": 411700,


        }, {
            "id": 411722,
            "label": "上蔡县",
            "level": 3,
            "pid": 411700,


        }, {
            "id": 411723,
            "label": "平舆县",
            "level": 3,
            "pid": 411700,


        }, {
            "id": 411724,
            "label": "正阳县",
            "level": 3,
            "pid": 411700,


        }, {
            "id": 411725,
            "label": "确山县",
            "level": 3,
            "pid": 411700,


        }, {
            "id": 411726,
            "label": "泌阳县",
            "level": 3,
            "pid": 411700,


        }, {
            "id": 411727,
            "label": "汝南县",
            "level": 3,
            "pid": 411700,


        }, {
            "id": 411728,
            "label": "遂平县",
            "level": 3,
            "pid": 411700,


        }, {
            "id": 411729,
            "label": "新蔡县",
            "level": 3,
            "pid": 411700,


        }]
    }, {
        "id": 419000,
        "label": "直辖县级",
        "level": 2,
        "pid": 410000,

        "children": [{
            "id": 419001,
            "label": "济源市",
            "level": 3,
            "pid": 419000,


        }]
    }]
}, {
    "id": 420000,
    "label": "湖北省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 420100,
        "label": "武汉市",
        "level": 2,
        "pid": 420000,

        "children": [{
            "id": 420102,
            "label": "江岸区",
            "level": 3,
            "pid": 420100,


        }, {
            "id": 420103,
            "label": "江汉区",
            "level": 3,
            "pid": 420100,


        }, {
            "id": 420104,
            "label": "硚口区",
            "level": 3,
            "pid": 420100,


        }, {
            "id": 420105,
            "label": "汉阳区",
            "level": 3,
            "pid": 420100,


        }, {
            "id": 420106,
            "label": "武昌区",
            "level": 3,
            "pid": 420100,


        }, {
            "id": 420107,
            "label": "青山区",
            "level": 3,
            "pid": 420100,


        }, {
            "id": 420111,
            "label": "洪山区",
            "level": 3,
            "pid": 420100,


        }, {
            "id": 420112,
            "label": "东西湖区",
            "level": 3,
            "pid": 420100,


        }, {
            "id": 420113,
            "label": "汉南区",
            "level": 3,
            "pid": 420100,


        }, {
            "id": 420114,
            "label": "蔡甸区",
            "level": 3,
            "pid": 420100,


        }, {
            "id": 420115,
            "label": "江夏区",
            "level": 3,
            "pid": 420100,


        }, {
            "id": 420116,
            "label": "黄陂区",
            "level": 3,
            "pid": 420100,


        }, {
            "id": 420117,
            "label": "新洲区",
            "level": 3,
            "pid": 420100,


        }]
    }, {
        "id": 420200,
        "label": "黄石市",
        "level": 2,
        "pid": 420000,

        "children": [{
            "id": 420202,
            "label": "黄石港区",
            "level": 3,
            "pid": 420200,


        }, {
            "id": 420203,
            "label": "西塞山区",
            "level": 3,
            "pid": 420200,


        }, {
            "id": 420204,
            "label": "下陆区",
            "level": 3,
            "pid": 420200,


        }, {
            "id": 420205,
            "label": "铁山区",
            "level": 3,
            "pid": 420200,


        }, {
            "id": 420222,
            "label": "阳新县",
            "level": 3,
            "pid": 420200,


        }, {
            "id": 420281,
            "label": "大冶市",
            "level": 3,
            "pid": 420200,


        }]
    }, {
        "id": 420300,
        "label": "十堰市",
        "level": 2,
        "pid": 420000,

        "children": [{
            "id": 420302,
            "label": "茅箭区",
            "level": 3,
            "pid": 420300,


        }, {
            "id": 420303,
            "label": "张湾区",
            "level": 3,
            "pid": 420300,


        }, {
            "id": 420304,
            "label": "郧阳区",
            "level": 3,
            "pid": 420300,


        }, {
            "id": 420322,
            "label": "郧西县",
            "level": 3,
            "pid": 420300,


        }, {
            "id": 420323,
            "label": "竹山县",
            "level": 3,
            "pid": 420300,


        }, {
            "id": 420324,
            "label": "竹溪县",
            "level": 3,
            "pid": 420300,


        }, {
            "id": 420325,
            "label": "房县",
            "level": 3,
            "pid": 420300,


        }, {
            "id": 420381,
            "label": "丹江口市",
            "level": 3,
            "pid": 420300,


        }]
    }, {
        "id": 420500,
        "label": "宜昌市",
        "level": 2,
        "pid": 420000,

        "children": [{
            "id": 420502,
            "label": "西陵区",
            "level": 3,
            "pid": 420500,


        }, {
            "id": 420503,
            "label": "伍家岗区",
            "level": 3,
            "pid": 420500,


        }, {
            "id": 420504,
            "label": "点军区",
            "level": 3,
            "pid": 420500,


        }, {
            "id": 420505,
            "label": "猇亭区",
            "level": 3,
            "pid": 420500,


        }, {
            "id": 420506,
            "label": "夷陵区",
            "level": 3,
            "pid": 420500,


        }, {
            "id": 420525,
            "label": "远安县",
            "level": 3,
            "pid": 420500,


        }, {
            "id": 420526,
            "label": "兴山县",
            "level": 3,
            "pid": 420500,


        }, {
            "id": 420527,
            "label": "秭归县",
            "level": 3,
            "pid": 420500,


        }, {
            "id": 420528,
            "label": "长阳土家族自治县",
            "level": 3,
            "pid": 420500,


        }, {
            "id": 420529,
            "label": "五峰土家族自治县",
            "level": 3,
            "pid": 420500,


        }, {
            "id": 420581,
            "label": "宜都市",
            "level": 3,
            "pid": 420500,


        }, {
            "id": 420582,
            "label": "当阳市",
            "level": 3,
            "pid": 420500,


        }, {
            "id": 420583,
            "label": "枝江市",
            "level": 3,
            "pid": 420500,


        }]
    }, {
        "id": 420600,
        "label": "襄阳市",
        "level": 2,
        "pid": 420000,

        "children": [{
            "id": 420602,
            "label": "襄城区",
            "level": 3,
            "pid": 420600,


        }, {
            "id": 420606,
            "label": "樊城区",
            "level": 3,
            "pid": 420600,


        }, {
            "id": 420607,
            "label": "襄州区",
            "level": 3,
            "pid": 420600,


        }, {
            "id": 420624,
            "label": "南漳县",
            "level": 3,
            "pid": 420600,


        }, {
            "id": 420625,
            "label": "谷城县",
            "level": 3,
            "pid": 420600,


        }, {
            "id": 420626,
            "label": "保康县",
            "level": 3,
            "pid": 420600,


        }, {
            "id": 420682,
            "label": "老河口市",
            "level": 3,
            "pid": 420600,


        }, {
            "id": 420683,
            "label": "枣阳市",
            "level": 3,
            "pid": 420600,


        }, {
            "id": 420684,
            "label": "宜城市",
            "level": 3,
            "pid": 420600,


        }]
    }, {
        "id": 420700,
        "label": "鄂州市",
        "level": 2,
        "pid": 420000,

        "children": [{
            "id": 420702,
            "label": "梁子湖区",
            "level": 3,
            "pid": 420700,


        }, {
            "id": 420703,
            "label": "华容区",
            "level": 3,
            "pid": 420700,


        }, {
            "id": 420704,
            "label": "鄂城区",
            "level": 3,
            "pid": 420700,


        }]
    }, {
        "id": 420800,
        "label": "荆门市",
        "level": 2,
        "pid": 420000,

        "children": [{
            "id": 420802,
            "label": "东宝区",
            "level": 3,
            "pid": 420800,


        }, {
            "id": 420804,
            "label": "掇刀区",
            "level": 3,
            "pid": 420800,


        }, {
            "id": 420821,
            "label": "京山县",
            "level": 3,
            "pid": 420800,


        }, {
            "id": 420822,
            "label": "沙洋县",
            "level": 3,
            "pid": 420800,


        }, {
            "id": 420881,
            "label": "钟祥市",
            "level": 3,
            "pid": 420800,


        }]
    }, {
        "id": 420900,
        "label": "孝感市",
        "level": 2,
        "pid": 420000,

        "children": [{
            "id": 420902,
            "label": "孝南区",
            "level": 3,
            "pid": 420900,


        }, {
            "id": 420921,
            "label": "孝昌县",
            "level": 3,
            "pid": 420900,


        }, {
            "id": 420922,
            "label": "大悟县",
            "level": 3,
            "pid": 420900,


        }, {
            "id": 420923,
            "label": "云梦县",
            "level": 3,
            "pid": 420900,


        }, {
            "id": 420981,
            "label": "应城市",
            "level": 3,
            "pid": 420900,


        }, {
            "id": 420982,
            "label": "安陆市",
            "level": 3,
            "pid": 420900,


        }, {
            "id": 420984,
            "label": "汉川市",
            "level": 3,
            "pid": 420900,


        }]
    }, {
        "id": 421000,
        "label": "荆州市",
        "level": 2,
        "pid": 420000,

        "children": [{
            "id": 421002,
            "label": "沙市区",
            "level": 3,
            "pid": 421000,


        }, {
            "id": 421003,
            "label": "荆州区",
            "level": 3,
            "pid": 421000,


        }, {
            "id": 421022,
            "label": "公安县",
            "level": 3,
            "pid": 421000,


        }, {
            "id": 421023,
            "label": "监利县",
            "level": 3,
            "pid": 421000,


        }, {
            "id": 421024,
            "label": "江陵县",
            "level": 3,
            "pid": 421000,


        }, {
            "id": 421081,
            "label": "石首市",
            "level": 3,
            "pid": 421000,


        }, {
            "id": 421083,
            "label": "洪湖市",
            "level": 3,
            "pid": 421000,


        }, {
            "id": 421087,
            "label": "松滋市",
            "level": 3,
            "pid": 421000,


        }]
    }, {
        "id": 421100,
        "label": "黄冈市",
        "level": 2,
        "pid": 420000,

        "children": [{
            "id": 421102,
            "label": "黄州区",
            "level": 3,
            "pid": 421100,


        }, {
            "id": 421121,
            "label": "团风县",
            "level": 3,
            "pid": 421100,


        }, {
            "id": 421122,
            "label": "红安县",
            "level": 3,
            "pid": 421100,


        }, {
            "id": 421123,
            "label": "罗田县",
            "level": 3,
            "pid": 421100,


        }, {
            "id": 421124,
            "label": "英山县",
            "level": 3,
            "pid": 421100,


        }, {
            "id": 421125,
            "label": "浠水县",
            "level": 3,
            "pid": 421100,


        }, {
            "id": 421126,
            "label": "蕲春县",
            "level": 3,
            "pid": 421100,


        }, {
            "id": 421127,
            "label": "黄梅县",
            "level": 3,
            "pid": 421100,


        }, {
            "id": 421181,
            "label": "麻城市",
            "level": 3,
            "pid": 421100,


        }, {
            "id": 421182,
            "label": "武穴市",
            "level": 3,
            "pid": 421100,


        }]
    }, {
        "id": 421200,
        "label": "咸宁市",
        "level": 2,
        "pid": 420000,

        "children": [{
            "id": 421202,
            "label": "咸安区",
            "level": 3,
            "pid": 421200,


        }, {
            "id": 421221,
            "label": "嘉鱼县",
            "level": 3,
            "pid": 421200,


        }, {
            "id": 421222,
            "label": "通城县",
            "level": 3,
            "pid": 421200,


        }, {
            "id": 421223,
            "label": "崇阳县",
            "level": 3,
            "pid": 421200,


        }, {
            "id": 421224,
            "label": "通山县",
            "level": 3,
            "pid": 421200,


        }, {
            "id": 421281,
            "label": "赤壁市",
            "level": 3,
            "pid": 421200,


        }]
    }, {
        "id": 421300,
        "label": "随州市",
        "level": 2,
        "pid": 420000,

        "children": [{
            "id": 421303,
            "label": "曾都区",
            "level": 3,
            "pid": 421300,


        }, {
            "id": 421321,
            "label": "随县",
            "level": 3,
            "pid": 421300,


        }, {
            "id": 421381,
            "label": "广水市",
            "level": 3,
            "pid": 421300,


        }]
    }, {
        "id": 422800,
        "label": "恩施土家族苗族自治州",
        "level": 2,
        "pid": 420000,

        "children": [{
            "id": 422801,
            "label": "恩施市",
            "level": 3,
            "pid": 422800,


        }, {
            "id": 422802,
            "label": "利川市",
            "level": 3,
            "pid": 422800,


        }, {
            "id": 422822,
            "label": "建始县",
            "level": 3,
            "pid": 422800,


        }, {
            "id": 422823,
            "label": "巴东县",
            "level": 3,
            "pid": 422800,


        }, {
            "id": 422825,
            "label": "宣恩县",
            "level": 3,
            "pid": 422800,


        }, {
            "id": 422826,
            "label": "咸丰县",
            "level": 3,
            "pid": 422800,


        }, {
            "id": 422827,
            "label": "来凤县",
            "level": 3,
            "pid": 422800,


        }, {
            "id": 422828,
            "label": "鹤峰县",
            "level": 3,
            "pid": 422800,


        }]
    }, {
        "id": 429000,
        "label": "直辖县级",
        "level": 2,
        "pid": 420000,

        "children": [{
            "id": 429004,
            "label": "仙桃市",
            "level": 3,
            "pid": 429000,


        }, {
            "id": 429005,
            "label": "潜江市",
            "level": 3,
            "pid": 429000,


        }, {
            "id": 429006,
            "label": "天门市",
            "level": 3,
            "pid": 429000,


        }, {
            "id": 429021,
            "label": "神农架林区",
            "level": 3,
            "pid": 429000,


        }]
    }]
}, {
    "id": 430000,
    "label": "湖南省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 430100,
        "label": "长沙市",
        "level": 2,
        "pid": 430000,

        "children": [{
            "id": 430102,
            "label": "芙蓉区",
            "level": 3,
            "pid": 430100,


        }, {
            "id": 430103,
            "label": "天心区",
            "level": 3,
            "pid": 430100,


        }, {
            "id": 430104,
            "label": "岳麓区",
            "level": 3,
            "pid": 430100,


        }, {
            "id": 430105,
            "label": "开福区",
            "level": 3,
            "pid": 430100,


        }, {
            "id": 430111,
            "label": "雨花区",
            "level": 3,
            "pid": 430100,


        }, {
            "id": 430112,
            "label": "望城区",
            "level": 3,
            "pid": 430100,


        }, {
            "id": 430121,
            "label": "长沙县",
            "level": 3,
            "pid": 430100,


        }, {
            "id": 430124,
            "label": "宁乡县",
            "level": 3,
            "pid": 430100,


        }, {
            "id": 430181,
            "label": "浏阳市",
            "level": 3,
            "pid": 430100,


        }]
    }, {
        "id": 430200,
        "label": "株洲市",
        "level": 2,
        "pid": 430000,

        "children": [{
            "id": 430202,
            "label": "荷塘区",
            "level": 3,
            "pid": 430200,


        }, {
            "id": 430203,
            "label": "芦淞区",
            "level": 3,
            "pid": 430200,


        }, {
            "id": 430204,
            "label": "石峰区",
            "level": 3,
            "pid": 430200,


        }, {
            "id": 430211,
            "label": "天元区",
            "level": 3,
            "pid": 430200,


        }, {
            "id": 430221,
            "label": "株洲县",
            "level": 3,
            "pid": 430200,


        }, {
            "id": 430223,
            "label": "攸县",
            "level": 3,
            "pid": 430200,


        }, {
            "id": 430224,
            "label": "茶陵县",
            "level": 3,
            "pid": 430200,


        }, {
            "id": 430225,
            "label": "炎陵县",
            "level": 3,
            "pid": 430200,


        }, {
            "id": 430281,
            "label": "醴陵市",
            "level": 3,
            "pid": 430200,


        }]
    }, {
        "id": 430300,
        "label": "湘潭市",
        "level": 2,
        "pid": 430000,

        "children": [{
            "id": 430302,
            "label": "雨湖区",
            "level": 3,
            "pid": 430300,


        }, {
            "id": 430304,
            "label": "岳塘区",
            "level": 3,
            "pid": 430300,


        }, {
            "id": 430321,
            "label": "湘潭县",
            "level": 3,
            "pid": 430300,


        }, {
            "id": 430381,
            "label": "湘乡市",
            "level": 3,
            "pid": 430300,


        }, {
            "id": 430382,
            "label": "韶山市",
            "level": 3,
            "pid": 430300,


        }]
    }, {
        "id": 430400,
        "label": "衡阳市",
        "level": 2,
        "pid": 430000,

        "children": [{
            "id": 430405,
            "label": "珠晖区",
            "level": 3,
            "pid": 430400,


        }, {
            "id": 430406,
            "label": "雁峰区",
            "level": 3,
            "pid": 430400,


        }, {
            "id": 430407,
            "label": "石鼓区",
            "level": 3,
            "pid": 430400,


        }, {
            "id": 430408,
            "label": "蒸湘区",
            "level": 3,
            "pid": 430400,


        }, {
            "id": 430412,
            "label": "南岳区",
            "level": 3,
            "pid": 430400,


        }, {
            "id": 430421,
            "label": "衡阳县",
            "level": 3,
            "pid": 430400,


        }, {
            "id": 430422,
            "label": "衡南县",
            "level": 3,
            "pid": 430400,


        }, {
            "id": 430423,
            "label": "衡山县",
            "level": 3,
            "pid": 430400,


        }, {
            "id": 430424,
            "label": "衡东县",
            "level": 3,
            "pid": 430400,


        }, {
            "id": 430426,
            "label": "祁东县",
            "level": 3,
            "pid": 430400,


        }, {
            "id": 430481,
            "label": "耒阳市",
            "level": 3,
            "pid": 430400,


        }, {
            "id": 430482,
            "label": "常宁市",
            "level": 3,
            "pid": 430400,


        }]
    }, {
        "id": 430500,
        "label": "邵阳市",
        "level": 2,
        "pid": 430000,

        "children": [{
            "id": 430502,
            "label": "双清区",
            "level": 3,
            "pid": 430500,


        }, {
            "id": 430503,
            "label": "大祥区",
            "level": 3,
            "pid": 430500,


        }, {
            "id": 430511,
            "label": "北塔区",
            "level": 3,
            "pid": 430500,


        }, {
            "id": 430521,
            "label": "邵东县",
            "level": 3,
            "pid": 430500,


        }, {
            "id": 430522,
            "label": "新邵县",
            "level": 3,
            "pid": 430500,


        }, {
            "id": 430523,
            "label": "邵阳县",
            "level": 3,
            "pid": 430500,


        }, {
            "id": 430524,
            "label": "隆回县",
            "level": 3,
            "pid": 430500,


        }, {
            "id": 430525,
            "label": "洞口县",
            "level": 3,
            "pid": 430500,


        }, {
            "id": 430527,
            "label": "绥宁县",
            "level": 3,
            "pid": 430500,


        }, {
            "id": 430528,
            "label": "新宁县",
            "level": 3,
            "pid": 430500,


        }, {
            "id": 430529,
            "label": "城步苗族自治县",
            "level": 3,
            "pid": 430500,


        }, {
            "id": 430581,
            "label": "武冈市",
            "level": 3,
            "pid": 430500,


        }]
    }, {
        "id": 430600,
        "label": "岳阳市",
        "level": 2,
        "pid": 430000,

        "children": [{
            "id": 430602,
            "label": "岳阳楼区",
            "level": 3,
            "pid": 430600,


        }, {
            "id": 430603,
            "label": "云溪区",
            "level": 3,
            "pid": 430600,


        }, {
            "id": 430611,
            "label": "君山区",
            "level": 3,
            "pid": 430600,


        }, {
            "id": 430621,
            "label": "岳阳县",
            "level": 3,
            "pid": 430600,


        }, {
            "id": 430623,
            "label": "华容县",
            "level": 3,
            "pid": 430600,


        }, {
            "id": 430624,
            "label": "湘阴县",
            "level": 3,
            "pid": 430600,


        }, {
            "id": 430626,
            "label": "平江县",
            "level": 3,
            "pid": 430600,


        }, {
            "id": 430681,
            "label": "汨罗市",
            "level": 3,
            "pid": 430600,


        }, {
            "id": 430682,
            "label": "临湘市",
            "level": 3,
            "pid": 430600,


        }]
    }, {
        "id": 430700,
        "label": "常德市",
        "level": 2,
        "pid": 430000,

        "children": [{
            "id": 430702,
            "label": "武陵区",
            "level": 3,
            "pid": 430700,


        }, {
            "id": 430703,
            "label": "鼎城区",
            "level": 3,
            "pid": 430700,


        }, {
            "id": 430721,
            "label": "安乡县",
            "level": 3,
            "pid": 430700,


        }, {
            "id": 430722,
            "label": "汉寿县",
            "level": 3,
            "pid": 430700,


        }, {
            "id": 430723,
            "label": "澧县",
            "level": 3,
            "pid": 430700,


        }, {
            "id": 430724,
            "label": "临澧县",
            "level": 3,
            "pid": 430700,


        }, {
            "id": 430725,
            "label": "桃源县",
            "level": 3,
            "pid": 430700,


        }, {
            "id": 430726,
            "label": "石门县",
            "level": 3,
            "pid": 430700,


        }, {
            "id": 430781,
            "label": "津市市",
            "level": 3,
            "pid": 430700,


        }]
    }, {
        "id": 430800,
        "label": "张家界市",
        "level": 2,
        "pid": 430000,

        "children": [{
            "id": 430802,
            "label": "永定区",
            "level": 3,
            "pid": 430800,


        }, {
            "id": 430811,
            "label": "武陵源区",
            "level": 3,
            "pid": 430800,


        }, {
            "id": 430821,
            "label": "慈利县",
            "level": 3,
            "pid": 430800,


        }, {
            "id": 430822,
            "label": "桑植县",
            "level": 3,
            "pid": 430800,


        }]
    }, {
        "id": 430900,
        "label": "益阳市",
        "level": 2,
        "pid": 430000,

        "children": [{
            "id": 430902,
            "label": "资阳区",
            "level": 3,
            "pid": 430900,


        }, {
            "id": 430903,
            "label": "赫山区",
            "level": 3,
            "pid": 430900,


        }, {
            "id": 430921,
            "label": "南县",
            "level": 3,
            "pid": 430900,


        }, {
            "id": 430922,
            "label": "桃江县",
            "level": 3,
            "pid": 430900,


        }, {
            "id": 430923,
            "label": "安化县",
            "level": 3,
            "pid": 430900,


        }, {
            "id": 430981,
            "label": "沅江市",
            "level": 3,
            "pid": 430900,


        }]
    }, {
        "id": 431000,
        "label": "郴州市",
        "level": 2,
        "pid": 430000,

        "children": [{
            "id": 431002,
            "label": "北湖区",
            "level": 3,
            "pid": 431000,


        }, {
            "id": 431003,
            "label": "苏仙区",
            "level": 3,
            "pid": 431000,


        }, {
            "id": 431021,
            "label": "桂阳县",
            "level": 3,
            "pid": 431000,


        }, {
            "id": 431022,
            "label": "宜章县",
            "level": 3,
            "pid": 431000,


        }, {
            "id": 431023,
            "label": "永兴县",
            "level": 3,
            "pid": 431000,


        }, {
            "id": 431024,
            "label": "嘉禾县",
            "level": 3,
            "pid": 431000,


        }, {
            "id": 431025,
            "label": "临武县",
            "level": 3,
            "pid": 431000,


        }, {
            "id": 431026,
            "label": "汝城县",
            "level": 3,
            "pid": 431000,


        }, {
            "id": 431027,
            "label": "桂东县",
            "level": 3,
            "pid": 431000,


        }, {
            "id": 431028,
            "label": "安仁县",
            "level": 3,
            "pid": 431000,


        }, {
            "id": 431081,
            "label": "资兴市",
            "level": 3,
            "pid": 431000,


        }]
    }, {
        "id": 431100,
        "label": "永州市",
        "level": 2,
        "pid": 430000,

        "children": [{
            "id": 431102,
            "label": "零陵区",
            "level": 3,
            "pid": 431100,


        }, {
            "id": 431103,
            "label": "冷水滩区",
            "level": 3,
            "pid": 431100,


        }, {
            "id": 431121,
            "label": "祁阳县",
            "level": 3,
            "pid": 431100,


        }, {
            "id": 431122,
            "label": "东安县",
            "level": 3,
            "pid": 431100,


        }, {
            "id": 431123,
            "label": "双牌县",
            "level": 3,
            "pid": 431100,


        }, {
            "id": 431124,
            "label": "道县",
            "level": 3,
            "pid": 431100,


        }, {
            "id": 431125,
            "label": "江永县",
            "level": 3,
            "pid": 431100,


        }, {
            "id": 431126,
            "label": "宁远县",
            "level": 3,
            "pid": 431100,


        }, {
            "id": 431127,
            "label": "蓝山县",
            "level": 3,
            "pid": 431100,


        }, {
            "id": 431128,
            "label": "新田县",
            "level": 3,
            "pid": 431100,


        }, {
            "id": 431129,
            "label": "江华瑶族自治县",
            "level": 3,
            "pid": 431100,


        }]
    }, {
        "id": 431200,
        "label": "怀化市",
        "level": 2,
        "pid": 430000,

        "children": [{
            "id": 431202,
            "label": "鹤城区",
            "level": 3,
            "pid": 431200,


        }, {
            "id": 431221,
            "label": "中方县",
            "level": 3,
            "pid": 431200,


        }, {
            "id": 431222,
            "label": "沅陵县",
            "level": 3,
            "pid": 431200,


        }, {
            "id": 431223,
            "label": "辰溪县",
            "level": 3,
            "pid": 431200,


        }, {
            "id": 431224,
            "label": "溆浦县",
            "level": 3,
            "pid": 431200,


        }, {
            "id": 431225,
            "label": "会同县",
            "level": 3,
            "pid": 431200,


        }, {
            "id": 431226,
            "label": "麻阳苗族自治县",
            "level": 3,
            "pid": 431200,


        }, {
            "id": 431227,
            "label": "新晃侗族自治县",
            "level": 3,
            "pid": 431200,


        }, {
            "id": 431228,
            "label": "芷江侗族自治县",
            "level": 3,
            "pid": 431200,


        }, {
            "id": 431229,
            "label": "靖州苗族侗族自治县",
            "level": 3,
            "pid": 431200,


        }, {
            "id": 431230,
            "label": "通道侗族自治县",
            "level": 3,
            "pid": 431200,


        }, {
            "id": 431281,
            "label": "洪江市",
            "level": 3,
            "pid": 431200,


        }]
    }, {
        "id": 431300,
        "label": "娄底市",
        "level": 2,
        "pid": 430000,

        "children": [{
            "id": 431302,
            "label": "娄星区",
            "level": 3,
            "pid": 431300,


        }, {
            "id": 431321,
            "label": "双峰县",
            "level": 3,
            "pid": 431300,


        }, {
            "id": 431322,
            "label": "新化县",
            "level": 3,
            "pid": 431300,


        }, {
            "id": 431381,
            "label": "冷水江市",
            "level": 3,
            "pid": 431300,


        }, {
            "id": 431382,
            "label": "涟源市",
            "level": 3,
            "pid": 431300,


        }]
    }, {
        "id": 433100,
        "label": "湘西土家族苗族自治州",
        "level": 2,
        "pid": 430000,

        "children": [{
            "id": 433101,
            "label": "吉首市",
            "level": 3,
            "pid": 433100,


        }, {
            "id": 433122,
            "label": "泸溪县",
            "level": 3,
            "pid": 433100,


        }, {
            "id": 433123,
            "label": "凤凰县",
            "level": 3,
            "pid": 433100,


        }, {
            "id": 433124,
            "label": "花垣县",
            "level": 3,
            "pid": 433100,


        }, {
            "id": 433125,
            "label": "保靖县",
            "level": 3,
            "pid": 433100,


        }, {
            "id": 433126,
            "label": "古丈县",
            "level": 3,
            "pid": 433100,


        }, {
            "id": 433127,
            "label": "永顺县",
            "level": 3,
            "pid": 433100,


        }, {
            "id": 433130,
            "label": "龙山县",
            "level": 3,
            "pid": 433100,


        }]
    }]
}, {
    "id": 440000,
    "label": "广东省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 440100,
        "label": "广州市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 440103,
            "label": "荔湾区",
            "level": 3,
            "pid": 440100,


        }, {
            "id": 440104,
            "label": "越秀区",
            "level": 3,
            "pid": 440100,


        }, {
            "id": 440105,
            "label": "海珠区",
            "level": 3,
            "pid": 440100,


        }, {
            "id": 440106,
            "label": "天河区",
            "level": 3,
            "pid": 440100,


        }, {
            "id": 440111,
            "label": "白云区",
            "level": 3,
            "pid": 440100,


        }, {
            "id": 440112,
            "label": "黄埔区",
            "level": 3,
            "pid": 440100,


        }, {
            "id": 440113,
            "label": "番禺区",
            "level": 3,
            "pid": 440100,


        }, {
            "id": 440114,
            "label": "花都区",
            "level": 3,
            "pid": 440100,


        }, {
            "id": 440115,
            "label": "南沙区",
            "level": 3,
            "pid": 440100,


        }, {
            "id": 440117,
            "label": "从化区",
            "level": 3,
            "pid": 440100,


        }, {
            "id": 440118,
            "label": "增城区",
            "level": 3,
            "pid": 440100,


        }]
    }, {
        "id": 440200,
        "label": "韶关市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 440203,
            "label": "武江区",
            "level": 3,
            "pid": 440200,


        }, {
            "id": 440204,
            "label": "浈江区",
            "level": 3,
            "pid": 440200,


        }, {
            "id": 440205,
            "label": "曲江区",
            "level": 3,
            "pid": 440200,


        }, {
            "id": 440222,
            "label": "始兴县",
            "level": 3,
            "pid": 440200,


        }, {
            "id": 440224,
            "label": "仁化县",
            "level": 3,
            "pid": 440200,


        }, {
            "id": 440229,
            "label": "翁源县",
            "level": 3,
            "pid": 440200,


        }, {
            "id": 440232,
            "label": "乳源瑶族自治县",
            "level": 3,
            "pid": 440200,


        }, {
            "id": 440233,
            "label": "新丰县",
            "level": 3,
            "pid": 440200,


        }, {
            "id": 440281,
            "label": "乐昌市",
            "level": 3,
            "pid": 440200,


        }, {
            "id": 440282,
            "label": "南雄市",
            "level": 3,
            "pid": 440200,


        }]
    }, {
        "id": 440300,
        "label": "深圳市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 440303,
            "label": "罗湖区",
            "level": 3,
            "pid": 440300,


        }, {
            "id": 440304,
            "label": "福田区",
            "level": 3,
            "pid": 440300,


        }, {
            "id": 440305,
            "label": "南山区",
            "level": 3,
            "pid": 440300,


        }, {
            "id": 440306,
            "label": "宝安区",
            "level": 3,
            "pid": 440300,


        }, {
            "id": 440307,
            "label": "龙岗区",
            "level": 3,
            "pid": 440300,


        }, {
            "id": 440308,
            "label": "盐田区",
            "level": 3,
            "pid": 440300,


        }, {
            "id": 440309,
            "label": "光明新区",
            "level": 3,
            "pid": 440300,


        }, {
            "id": 440310,
            "label": "坪山新区",
            "level": 3,
            "pid": 440300,


        }, {
            "id": 440311,
            "label": "大鹏新区",
            "level": 3,
            "pid": 440300,


        }, {
            "id": 440312,
            "label": "龙华新区",
            "level": 3,
            "pid": 440300,


        }]
    }, {
        "id": 440400,
        "label": "珠海市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 440402,
            "label": "香洲区",
            "level": 3,
            "pid": 440400,


        }, {
            "id": 440403,
            "label": "斗门区",
            "level": 3,
            "pid": 440400,


        }, {
            "id": 440404,
            "label": "金湾区",
            "level": 3,
            "pid": 440400,


        }]
    }, {
        "id": 440500,
        "label": "汕头市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 440507,
            "label": "龙湖区",
            "level": 3,
            "pid": 440500,


        }, {
            "id": 440511,
            "label": "金平区",
            "level": 3,
            "pid": 440500,


        }, {
            "id": 440512,
            "label": "濠江区",
            "level": 3,
            "pid": 440500,


        }, {
            "id": 440513,
            "label": "潮阳区",
            "level": 3,
            "pid": 440500,


        }, {
            "id": 440514,
            "label": "潮南区",
            "level": 3,
            "pid": 440500,


        }, {
            "id": 440515,
            "label": "澄海区",
            "level": 3,
            "pid": 440500,


        }, {
            "id": 440523,
            "label": "南澳县",
            "level": 3,
            "pid": 440500,


        }]
    }, {
        "id": 440600,
        "label": "佛山市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 440604,
            "label": "禅城区",
            "level": 3,
            "pid": 440600,


        }, {
            "id": 440605,
            "label": "南海区",
            "level": 3,
            "pid": 440600,


        }, {
            "id": 440606,
            "label": "顺德区",
            "level": 3,
            "pid": 440600,


        }, {
            "id": 440607,
            "label": "三水区",
            "level": 3,
            "pid": 440600,


        }, {
            "id": 440608,
            "label": "高明区",
            "level": 3,
            "pid": 440600,


        }]
    }, {
        "id": 440700,
        "label": "江门市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 440703,
            "label": "蓬江区",
            "level": 3,
            "pid": 440700,


        }, {
            "id": 440704,
            "label": "江海区",
            "level": 3,
            "pid": 440700,


        }, {
            "id": 440705,
            "label": "新会区",
            "level": 3,
            "pid": 440700,


        }, {
            "id": 440781,
            "label": "台山市",
            "level": 3,
            "pid": 440700,


        }, {
            "id": 440783,
            "label": "开平市",
            "level": 3,
            "pid": 440700,


        }, {
            "id": 440784,
            "label": "鹤山市",
            "level": 3,
            "pid": 440700,


        }, {
            "id": 440785,
            "label": "恩平市",
            "level": 3,
            "pid": 440700,


        }]
    }, {
        "id": 440800,
        "label": "湛江市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 440802,
            "label": "赤坎区",
            "level": 3,
            "pid": 440800,


        }, {
            "id": 440803,
            "label": "霞山区",
            "level": 3,
            "pid": 440800,


        }, {
            "id": 440804,
            "label": "坡头区",
            "level": 3,
            "pid": 440800,


        }, {
            "id": 440811,
            "label": "麻章区",
            "level": 3,
            "pid": 440800,


        }, {
            "id": 440823,
            "label": "遂溪县",
            "level": 3,
            "pid": 440800,


        }, {
            "id": 440825,
            "label": "徐闻县",
            "level": 3,
            "pid": 440800,


        }, {
            "id": 440881,
            "label": "廉江市",
            "level": 3,
            "pid": 440800,


        }, {
            "id": 440882,
            "label": "雷州市",
            "level": 3,
            "pid": 440800,


        }, {
            "id": 440883,
            "label": "吴川市",
            "level": 3,
            "pid": 440800,


        }]
    }, {
        "id": 440900,
        "label": "茂名市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 440902,
            "label": "茂南区",
            "level": 3,
            "pid": 440900,


        }, {
            "id": 440904,
            "label": "电白区",
            "level": 3,
            "pid": 440900,


        }, {
            "id": 440981,
            "label": "高州市",
            "level": 3,
            "pid": 440900,


        }, {
            "id": 440982,
            "label": "化州市",
            "level": 3,
            "pid": 440900,


        }, {
            "id": 440983,
            "label": "信宜市",
            "level": 3,
            "pid": 440900,


        }]
    }, {
        "id": 441200,
        "label": "肇庆市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 441202,
            "label": "端州区",
            "level": 3,
            "pid": 441200,


        }, {
            "id": 441203,
            "label": "鼎湖区",
            "level": 3,
            "pid": 441200,


        }, {
            "id": 441223,
            "label": "广宁县",
            "level": 3,
            "pid": 441200,


        }, {
            "id": 441224,
            "label": "怀集县",
            "level": 3,
            "pid": 441200,


        }, {
            "id": 441225,
            "label": "封开县",
            "level": 3,
            "pid": 441200,


        }, {
            "id": 441226,
            "label": "德庆县",
            "level": 3,
            "pid": 441200,


        }, {
            "id": 441283,
            "label": "高要市",
            "level": 3,
            "pid": 441200,


        }, {
            "id": 441284,
            "label": "四会市",
            "level": 3,
            "pid": 441200,


        }]
    }, {
        "id": 441300,
        "label": "惠州市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 441302,
            "label": "惠城区",
            "level": 3,
            "pid": 441300,


        }, {
            "id": 441303,
            "label": "惠阳区",
            "level": 3,
            "pid": 441300,


        }, {
            "id": 441322,
            "label": "博罗县",
            "level": 3,
            "pid": 441300,


        }, {
            "id": 441323,
            "label": "惠东县",
            "level": 3,
            "pid": 441300,


        }, {
            "id": 441324,
            "label": "龙门县",
            "level": 3,
            "pid": 441300,


        }]
    }, {
        "id": 441400,
        "label": "梅州市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 441402,
            "label": "梅江区",
            "level": 3,
            "pid": 441400,


        }, {
            "id": 441403,
            "label": "梅县区",
            "level": 3,
            "pid": 441400,


        }, {
            "id": 441422,
            "label": "大埔县",
            "level": 3,
            "pid": 441400,


        }, {
            "id": 441423,
            "label": "丰顺县",
            "level": 3,
            "pid": 441400,


        }, {
            "id": 441424,
            "label": "五华县",
            "level": 3,
            "pid": 441400,


        }, {
            "id": 441426,
            "label": "平远县",
            "level": 3,
            "pid": 441400,


        }, {
            "id": 441427,
            "label": "蕉岭县",
            "level": 3,
            "pid": 441400,


        }, {
            "id": 441481,
            "label": "兴宁市",
            "level": 3,
            "pid": 441400,


        }]
    }, {
        "id": 441500,
        "label": "汕尾市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 441502,
            "label": "城区",
            "level": 3,
            "pid": 441500,


        }, {
            "id": 441521,
            "label": "海丰县",
            "level": 3,
            "pid": 441500,


        }, {
            "id": 441523,
            "label": "陆河县",
            "level": 3,
            "pid": 441500,


        }, {
            "id": 441581,
            "label": "陆丰市",
            "level": 3,
            "pid": 441500,


        }]
    }, {
        "id": 441600,
        "label": "河源市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 441602,
            "label": "源城区",
            "level": 3,
            "pid": 441600,


        }, {
            "id": 441621,
            "label": "紫金县",
            "level": 3,
            "pid": 441600,


        }, {
            "id": 441622,
            "label": "龙川县",
            "level": 3,
            "pid": 441600,


        }, {
            "id": 441623,
            "label": "连平县",
            "level": 3,
            "pid": 441600,


        }, {
            "id": 441624,
            "label": "和平县",
            "level": 3,
            "pid": 441600,


        }, {
            "id": 441625,
            "label": "东源县",
            "level": 3,
            "pid": 441600,


        }]
    }, {
        "id": 441700,
        "label": "阳江市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 441702,
            "label": "江城区",
            "level": 3,
            "pid": 441700,


        }, {
            "id": 441704,
            "label": "阳东区",
            "level": 3,
            "pid": 441700,


        }, {
            "id": 441721,
            "label": "阳西县",
            "level": 3,
            "pid": 441700,


        }, {
            "id": 441781,
            "label": "阳春市",
            "level": 3,
            "pid": 441700,


        }]
    }, {
        "id": 441800,
        "label": "清远市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 441802,
            "label": "清城区",
            "level": 3,
            "pid": 441800,


        }, {
            "id": 441803,
            "label": "清新区",
            "level": 3,
            "pid": 441800,


        }, {
            "id": 441821,
            "label": "佛冈县",
            "level": 3,
            "pid": 441800,


        }, {
            "id": 441823,
            "label": "阳山县",
            "level": 3,
            "pid": 441800,


        }, {
            "id": 441825,
            "label": "连山壮族瑶族自治县",
            "level": 3,
            "pid": 441800,


        }, {
            "id": 441826,
            "label": "连南瑶族自治县",
            "level": 3,
            "pid": 441800,


        }, {
            "id": 441881,
            "label": "英德市",
            "level": 3,
            "pid": 441800,


        }, {
            "id": 441882,
            "label": "连州市",
            "level": 3,
            "pid": 441800,


        }]
    }, {
        "id": 441900,
        "label": "东莞市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 441901,
            "label": "莞城区",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441902,
            "label": "南城区",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441904,
            "label": "万江区",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441905,
            "label": "石碣镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441906,
            "label": "石龙镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441907,
            "label": "茶山镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441908,
            "label": "石排镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441909,
            "label": "企石镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441910,
            "label": "横沥镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441911,
            "label": "桥头镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441912,
            "label": "谢岗镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441913,
            "label": "东坑镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441914,
            "label": "常平镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441915,
            "label": "寮步镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441916,
            "label": "大朗镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441917,
            "label": "麻涌镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441918,
            "label": "中堂镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441919,
            "label": "高埗镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441920,
            "label": "樟木头镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441921,
            "label": "大岭山镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441922,
            "label": "望牛墩镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441923,
            "label": "黄江镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441924,
            "label": "洪梅镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441925,
            "label": "清溪镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441926,
            "label": "沙田镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441927,
            "label": "道滘镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441928,
            "label": "塘厦镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441929,
            "label": "虎门镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441930,
            "label": "厚街镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441931,
            "label": "凤岗镇",
            "level": 3,
            "pid": 441900,


        }, {
            "id": 441932,
            "label": "长安镇",
            "level": 3,
            "pid": 441900,


        }]
    }, {
        "id": 442000,
        "label": "中山市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 442001,
            "label": "石岐区",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442004,
            "label": "南区",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442005,
            "label": "五桂山区",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442006,
            "label": "火炬开发区",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442007,
            "label": "黄圃镇",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442008,
            "label": "南头镇",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442009,
            "label": "东凤镇",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442010,
            "label": "阜沙镇",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442011,
            "label": "小榄镇",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442012,
            "label": "东升镇",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442013,
            "label": "古镇镇",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442014,
            "label": "横栏镇",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442015,
            "label": "三角镇",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442016,
            "label": "民众镇",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442017,
            "label": "南朗镇",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442018,
            "label": "港口镇",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442019,
            "label": "大涌镇",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442020,
            "label": "沙溪镇",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442021,
            "label": "三乡镇",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442022,
            "label": "板芙镇",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442023,
            "label": "神湾镇",
            "level": 3,
            "pid": 442000,


        }, {
            "id": 442024,
            "label": "坦洲镇",
            "level": 3,
            "pid": 442000,


        }]
    }, {
        "id": 445100,
        "label": "潮州市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 445102,
            "label": "湘桥区",
            "level": 3,
            "pid": 445100,


        }, {
            "id": 445103,
            "label": "潮安区",
            "level": 3,
            "pid": 445100,


        }, {
            "id": 445122,
            "label": "饶平县",
            "level": 3,
            "pid": 445100,


        }]
    }, {
        "id": 445200,
        "label": "揭阳市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 445202,
            "label": "榕城区",
            "level": 3,
            "pid": 445200,


        }, {
            "id": 445203,
            "label": "揭东区",
            "level": 3,
            "pid": 445200,


        }, {
            "id": 445222,
            "label": "揭西县",
            "level": 3,
            "pid": 445200,


        }, {
            "id": 445224,
            "label": "惠来县",
            "level": 3,
            "pid": 445200,


        }, {
            "id": 445281,
            "label": "普宁市",
            "level": 3,
            "pid": 445200,


        }]
    }, {
        "id": 445300,
        "label": "云浮市",
        "level": 2,
        "pid": 440000,

        "children": [{
            "id": 445302,
            "label": "云城区",
            "level": 3,
            "pid": 445300,


        }, {
            "id": 445303,
            "label": "云安区",
            "level": 3,
            "pid": 445300,


        }, {
            "id": 445321,
            "label": "新兴县",
            "level": 3,
            "pid": 445300,


        }, {
            "id": 445322,
            "label": "郁南县",
            "level": 3,
            "pid": 445300,


        }, {
            "id": 445381,
            "label": "罗定市",
            "level": 3,
            "pid": 445300,


        }]
    }]
}, {
    "id": 450000,
    "label": "广西壮族自治区",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 450100,
        "label": "南宁市",
        "level": 2,
        "pid": 450000,

        "children": [{
            "id": 450102,
            "label": "兴宁区",
            "level": 3,
            "pid": 450100,


        }, {
            "id": 450103,
            "label": "青秀区",
            "level": 3,
            "pid": 450100,


        }, {
            "id": 450105,
            "label": "江南区",
            "level": 3,
            "pid": 450100,


        }, {
            "id": 450107,
            "label": "西乡塘区",
            "level": 3,
            "pid": 450100,


        }, {
            "id": 450108,
            "label": "良庆区",
            "level": 3,
            "pid": 450100,


        }, {
            "id": 450109,
            "label": "邕宁区",
            "level": 3,
            "pid": 450100,


        }, {
            "id": 450122,
            "label": "武鸣县",
            "level": 3,
            "pid": 450100,


        }, {
            "id": 450123,
            "label": "隆安县",
            "level": 3,
            "pid": 450100,


        }, {
            "id": 450124,
            "label": "马山县",
            "level": 3,
            "pid": 450100,


        }, {
            "id": 450125,
            "label": "上林县",
            "level": 3,
            "pid": 450100,


        }, {
            "id": 450126,
            "label": "宾阳县",
            "level": 3,
            "pid": 450100,


        }, {
            "id": 450127,
            "label": "横县",
            "level": 3,
            "pid": 450100,


        }, {
            "id": 450128,
            "label": "埌东新区",
            "level": 3,
            "pid": 450100,


        }]
    }, {
        "id": 450200,
        "label": "柳州市",
        "level": 2,
        "pid": 450000,

        "children": [{
            "id": 450202,
            "label": "城中区",
            "level": 3,
            "pid": 450200,


        }, {
            "id": 450203,
            "label": "鱼峰区",
            "level": 3,
            "pid": 450200,


        }, {
            "id": 450204,
            "label": "柳南区",
            "level": 3,
            "pid": 450200,


        }, {
            "id": 450205,
            "label": "柳北区",
            "level": 3,
            "pid": 450200,


        }, {
            "id": 450221,
            "label": "柳江县",
            "level": 3,
            "pid": 450200,


        }, {
            "id": 450222,
            "label": "柳城县",
            "level": 3,
            "pid": 450200,


        }, {
            "id": 450223,
            "label": "鹿寨县",
            "level": 3,
            "pid": 450200,


        }, {
            "id": 450224,
            "label": "融安县",
            "level": 3,
            "pid": 450200,


        }, {
            "id": 450225,
            "label": "融水苗族自治县",
            "level": 3,
            "pid": 450200,


        }, {
            "id": 450226,
            "label": "三江侗族自治县",
            "level": 3,
            "pid": 450200,


        }, {
            "id": 450227,
            "label": "柳东新区",
            "level": 3,
            "pid": 450200,


        }]
    }, {
        "id": 450300,
        "label": "桂林市",
        "level": 2,
        "pid": 450000,

        "children": [{
            "id": 450302,
            "label": "秀峰区",
            "level": 3,
            "pid": 450300,


        }, {
            "id": 450303,
            "label": "叠彩区",
            "level": 3,
            "pid": 450300,


        }, {
            "id": 450304,
            "label": "象山区",
            "level": 3,
            "pid": 450300,


        }, {
            "id": 450305,
            "label": "七星区",
            "level": 3,
            "pid": 450300,


        }, {
            "id": 450311,
            "label": "雁山区",
            "level": 3,
            "pid": 450300,


        }, {
            "id": 450312,
            "label": "临桂区",
            "level": 3,
            "pid": 450300,


        }, {
            "id": 450321,
            "label": "阳朔县",
            "level": 3,
            "pid": 450300,


        }, {
            "id": 450323,
            "label": "灵川县",
            "level": 3,
            "pid": 450300,


        }, {
            "id": 450324,
            "label": "全州县",
            "level": 3,
            "pid": 450300,


        }, {
            "id": 450325,
            "label": "兴安县",
            "level": 3,
            "pid": 450300,


        }, {
            "id": 450326,
            "label": "永福县",
            "level": 3,
            "pid": 450300,


        }, {
            "id": 450327,
            "label": "灌阳县",
            "level": 3,
            "pid": 450300,


        }, {
            "id": 450328,
            "label": "龙胜各族自治县",
            "level": 3,
            "pid": 450300,


        }, {
            "id": 450329,
            "label": "资源县",
            "level": 3,
            "pid": 450300,


        }, {
            "id": 450330,
            "label": "平乐县",
            "level": 3,
            "pid": 450300,


        }, {
            "id": 450331,
            "label": "荔浦县",
            "level": 3,
            "pid": 450300,


        }, {
            "id": 450332,
            "label": "恭城瑶族自治县",
            "level": 3,
            "pid": 450300,


        }]
    }, {
        "id": 450400,
        "label": "梧州市",
        "level": 2,
        "pid": 450000,

        "children": [{
            "id": 450403,
            "label": "万秀区",
            "level": 3,
            "pid": 450400,


        }, {
            "id": 450405,
            "label": "长洲区",
            "level": 3,
            "pid": 450400,


        }, {
            "id": 450406,
            "label": "龙圩区",
            "level": 3,
            "pid": 450400,


        }, {
            "id": 450421,
            "label": "苍梧县",
            "level": 3,
            "pid": 450400,


        }, {
            "id": 450422,
            "label": "藤县",
            "level": 3,
            "pid": 450400,


        }, {
            "id": 450423,
            "label": "蒙山县",
            "level": 3,
            "pid": 450400,


        }, {
            "id": 450481,
            "label": "岑溪市",
            "level": 3,
            "pid": 450400,


        }]
    }, {
        "id": 450500,
        "label": "北海市",
        "level": 2,
        "pid": 450000,

        "children": [{
            "id": 450502,
            "label": "海城区",
            "level": 3,
            "pid": 450500,


        }, {
            "id": 450503,
            "label": "银海区",
            "level": 3,
            "pid": 450500,


        }, {
            "id": 450512,
            "label": "铁山港区",
            "level": 3,
            "pid": 450500,


        }, {
            "id": 450521,
            "label": "合浦县",
            "level": 3,
            "pid": 450500,


        }]
    }, {
        "id": 450600,
        "label": "防城港市",
        "level": 2,
        "pid": 450000,

        "children": [{
            "id": 450602,
            "label": "港口区",
            "level": 3,
            "pid": 450600,


        }, {
            "id": 450603,
            "label": "防城区",
            "level": 3,
            "pid": 450600,


        }, {
            "id": 450621,
            "label": "上思县",
            "level": 3,
            "pid": 450600,


        }, {
            "id": 450681,
            "label": "东兴市",
            "level": 3,
            "pid": 450600,


        }]
    }, {
        "id": 450700,
        "label": "钦州市",
        "level": 2,
        "pid": 450000,

        "children": [{
            "id": 450702,
            "label": "钦南区",
            "level": 3,
            "pid": 450700,


        }, {
            "id": 450703,
            "label": "钦北区",
            "level": 3,
            "pid": 450700,


        }, {
            "id": 450721,
            "label": "灵山县",
            "level": 3,
            "pid": 450700,


        }, {
            "id": 450722,
            "label": "浦北县",
            "level": 3,
            "pid": 450700,


        }]
    }, {
        "id": 450800,
        "label": "贵港市",
        "level": 2,
        "pid": 450000,

        "children": [{
            "id": 450802,
            "label": "港北区",
            "level": 3,
            "pid": 450800,


        }, {
            "id": 450803,
            "label": "港南区",
            "level": 3,
            "pid": 450800,


        }, {
            "id": 450804,
            "label": "覃塘区",
            "level": 3,
            "pid": 450800,


        }, {
            "id": 450821,
            "label": "平南县",
            "level": 3,
            "pid": 450800,


        }, {
            "id": 450881,
            "label": "桂平市",
            "level": 3,
            "pid": 450800,


        }]
    }, {
        "id": 450900,
        "label": "玉林市",
        "level": 2,
        "pid": 450000,

        "children": [{
            "id": 450902,
            "label": "玉州区",
            "level": 3,
            "pid": 450900,


        }, {
            "id": 450903,
            "label": "福绵区",
            "level": 3,
            "pid": 450900,


        }, {
            "id": 450904,
            "label": "玉东新区",
            "level": 3,
            "pid": 450900,


        }, {
            "id": 450921,
            "label": "容县",
            "level": 3,
            "pid": 450900,


        }, {
            "id": 450922,
            "label": "陆川县",
            "level": 3,
            "pid": 450900,


        }, {
            "id": 450923,
            "label": "博白县",
            "level": 3,
            "pid": 450900,


        }, {
            "id": 450924,
            "label": "兴业县",
            "level": 3,
            "pid": 450900,


        }, {
            "id": 450981,
            "label": "北流市",
            "level": 3,
            "pid": 450900,


        }]
    }, {
        "id": 451000,
        "label": "百色市",
        "level": 2,
        "pid": 450000,

        "children": [{
            "id": 451002,
            "label": "右江区",
            "level": 3,
            "pid": 451000,


        }, {
            "id": 451021,
            "label": "田阳县",
            "level": 3,
            "pid": 451000,


        }, {
            "id": 451022,
            "label": "田东县",
            "level": 3,
            "pid": 451000,


        }, {
            "id": 451023,
            "label": "平果县",
            "level": 3,
            "pid": 451000,


        }, {
            "id": 451024,
            "label": "德保县",
            "level": 3,
            "pid": 451000,


        }, {
            "id": 451025,
            "label": "靖西县",
            "level": 3,
            "pid": 451000,


        }, {
            "id": 451026,
            "label": "那坡县",
            "level": 3,
            "pid": 451000,


        }, {
            "id": 451027,
            "label": "凌云县",
            "level": 3,
            "pid": 451000,


        }, {
            "id": 451028,
            "label": "乐业县",
            "level": 3,
            "pid": 451000,


        }, {
            "id": 451029,
            "label": "田林县",
            "level": 3,
            "pid": 451000,


        }, {
            "id": 451030,
            "label": "西林县",
            "level": 3,
            "pid": 451000,


        }, {
            "id": 451031,
            "label": "隆林各族自治县",
            "level": 3,
            "pid": 451000,


        }]
    }, {
        "id": 451100,
        "label": "贺州市",
        "level": 2,
        "pid": 450000,

        "children": [{
            "id": 451102,
            "label": "八步区",
            "level": 3,
            "pid": 451100,


        }, {
            "id": 451121,
            "label": "昭平县",
            "level": 3,
            "pid": 451100,


        }, {
            "id": 451122,
            "label": "钟山县",
            "level": 3,
            "pid": 451100,


        }, {
            "id": 451123,
            "label": "富川瑶族自治县",
            "level": 3,
            "pid": 451100,


        }, {
            "id": 451124,
            "label": "平桂管理区",
            "level": 3,
            "pid": 451100,


        }]
    }, {
        "id": 451200,
        "label": "河池市",
        "level": 2,
        "pid": 450000,

        "children": [{
            "id": 451202,
            "label": "金城江区",
            "level": 3,
            "pid": 451200,


        }, {
            "id": 451221,
            "label": "南丹县",
            "level": 3,
            "pid": 451200,


        }, {
            "id": 451222,
            "label": "天峨县",
            "level": 3,
            "pid": 451200,


        }, {
            "id": 451223,
            "label": "凤山县",
            "level": 3,
            "pid": 451200,


        }, {
            "id": 451224,
            "label": "东兰县",
            "level": 3,
            "pid": 451200,


        }, {
            "id": 451225,
            "label": "罗城仫佬族自治县",
            "level": 3,
            "pid": 451200,


        }, {
            "id": 451226,
            "label": "环江毛南族自治县",
            "level": 3,
            "pid": 451200,


        }, {
            "id": 451227,
            "label": "巴马瑶族自治县",
            "level": 3,
            "pid": 451200,


        }, {
            "id": 451228,
            "label": "都安瑶族自治县",
            "level": 3,
            "pid": 451200,


        }, {
            "id": 451229,
            "label": "大化瑶族自治县",
            "level": 3,
            "pid": 451200,


        }, {
            "id": 451281,
            "label": "宜州市",
            "level": 3,
            "pid": 451200,


        }]
    }, {
        "id": 451300,
        "label": "来宾市",
        "level": 2,
        "pid": 450000,

        "children": [{
            "id": 451302,
            "label": "兴宾区",
            "level": 3,
            "pid": 451300,


        }, {
            "id": 451321,
            "label": "忻城县",
            "level": 3,
            "pid": 451300,


        }, {
            "id": 451322,
            "label": "象州县",
            "level": 3,
            "pid": 451300,


        }, {
            "id": 451323,
            "label": "武宣县",
            "level": 3,
            "pid": 451300,


        }, {
            "id": 451324,
            "label": "金秀瑶族自治县",
            "level": 3,
            "pid": 451300,


        }, {
            "id": 451381,
            "label": "合山市",
            "level": 3,
            "pid": 451300,


        }]
    }, {
        "id": 451400,
        "label": "崇左市",
        "level": 2,
        "pid": 450000,

        "children": [{
            "id": 451402,
            "label": "江州区",
            "level": 3,
            "pid": 451400,


        }, {
            "id": 451421,
            "label": "扶绥县",
            "level": 3,
            "pid": 451400,


        }, {
            "id": 451422,
            "label": "宁明县",
            "level": 3,
            "pid": 451400,


        }, {
            "id": 451423,
            "label": "龙州县",
            "level": 3,
            "pid": 451400,


        }, {
            "id": 451424,
            "label": "大新县",
            "level": 3,
            "pid": 451400,


        }, {
            "id": 451425,
            "label": "天等县",
            "level": 3,
            "pid": 451400,


        }, {
            "id": 451481,
            "label": "凭祥市",
            "level": 3,
            "pid": 451400,


        }]
    }]
}, {
    "id": 460000,
    "label": "海南省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 460100,
        "label": "海口市",
        "level": 2,
        "pid": 460000,

        "children": [{
            "id": 460105,
            "label": "秀英区",
            "level": 3,
            "pid": 460100,


        }, {
            "id": 460106,
            "label": "龙华区",
            "level": 3,
            "pid": 460100,


        }, {
            "id": 460107,
            "label": "琼山区",
            "level": 3,
            "pid": 460100,


        }, {
            "id": 460108,
            "label": "美兰区",
            "level": 3,
            "pid": 460100,


        }]
    }, {
        "id": 460200,
        "label": "三亚市",
        "level": 2,
        "pid": 460000,

        "children": [{
            "id": 460202,
            "label": "海棠区",
            "level": 3,
            "pid": 460200,


        }, {
            "id": 460203,
            "label": "吉阳区",
            "level": 3,
            "pid": 460200,


        }, {
            "id": 460204,
            "label": "天涯区",
            "level": 3,
            "pid": 460200,


        }, {
            "id": 460205,
            "label": "崖州区",
            "level": 3,
            "pid": 460200,


        }]
    }, {
        "id": 460300,
        "label": "三沙市",
        "level": 2,
        "pid": 460000,

        "children": [{
            "id": 460321,
            "label": "西沙群岛",
            "level": 3,
            "pid": 460300,


        }, {
            "id": 460322,
            "label": "南沙群岛",
            "level": 3,
            "pid": 460300,


        }, {
            "id": 460323,
            "label": "中沙群岛",
            "level": 3,
            "pid": 460300,


        }]
    }, {
        "id": 469000,
        "label": "直辖县级",
        "level": 2,
        "pid": 460000,

        "children": [{
            "id": 469001,
            "label": "五指山市",
            "level": 3,
            "pid": 469000,


        }, {
            "id": 469002,
            "label": "琼海市",
            "level": 3,
            "pid": 469000,


        }, {
            "id": 469003,
            "label": "儋州市",
            "level": 3,
            "pid": 469000,


        }, {
            "id": 469005,
            "label": "文昌市",
            "level": 3,
            "pid": 469000,


        }, {
            "id": 469006,
            "label": "万宁市",
            "level": 3,
            "pid": 469000,


        }, {
            "id": 469007,
            "label": "东方市",
            "level": 3,
            "pid": 469000,


        }, {
            "id": 469021,
            "label": "定安县",
            "level": 3,
            "pid": 469000,


        }, {
            "id": 469022,
            "label": "屯昌县",
            "level": 3,
            "pid": 469000,


        }, {
            "id": 469023,
            "label": "澄迈县",
            "level": 3,
            "pid": 469000,


        }, {
            "id": 469024,
            "label": "临高县",
            "level": 3,
            "pid": 469000,


        }, {
            "id": 469025,
            "label": "白沙黎族自治县",
            "level": 3,
            "pid": 469000,


        }, {
            "id": 469026,
            "label": "昌江黎族自治县",
            "level": 3,
            "pid": 469000,


        }, {
            "id": 469027,
            "label": "乐东黎族自治县",
            "level": 3,
            "pid": 469000,


        }, {
            "id": 469028,
            "label": "陵水黎族自治县",
            "level": 3,
            "pid": 469000,


        }, {
            "id": 469029,
            "label": "保亭黎族苗族自治县",
            "level": 3,
            "pid": 469000,


        }, {
            "id": 469030,
            "label": "琼中黎族苗族自治县",
            "level": 3,
            "pid": 469000,


        }]
    }]
}, {
    "id": 500000,
    "label": "重庆市",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 500100,
        "label": "市辖区",
        "level": 2,
        "pid": 500000,

        "children": [{
            "id": 500101,
            "label": "万州区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500102,
            "label": "涪陵区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500103,
            "label": "渝中区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500104,
            "label": "大渡口区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500105,
            "label": "江北区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500106,
            "label": "沙坪坝区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500107,
            "label": "九龙坡区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500108,
            "label": "南岸区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500109,
            "label": "北碚区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500110,
            "label": "綦江区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500111,
            "label": "大足区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500112,
            "label": "渝北区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500113,
            "label": "巴南区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500114,
            "label": "黔江区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500115,
            "label": "长寿区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500116,
            "label": "江津区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500117,
            "label": "合川区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500118,
            "label": "永川区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500119,
            "label": "南川区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500120,
            "label": "璧山区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500151,
            "label": "铜梁区",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500223,
            "label": "潼南县",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500226,
            "label": "荣昌县",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500228,
            "label": "梁平县",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500229,
            "label": "城口县",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500230,
            "label": "丰都县",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500231,
            "label": "垫江县",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500232,
            "label": "武隆县",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500233,
            "label": "忠县",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500234,
            "label": "开县",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500235,
            "label": "云阳县",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500236,
            "label": "奉节县",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500237,
            "label": "巫山县",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500238,
            "label": "巫溪县",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500240,
            "label": "石柱土家族自治县",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500241,
            "label": "秀山土家族苗族自治县",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500242,
            "label": "酉阳土家族苗族自治县",
            "level": 3,
            "pid": 500100,


        }, {
            "id": 500243,
            "label": "彭水苗族土家族自治县",
            "level": 3,
            "pid": 500100,


        }]
    }, {
        "id": 500300,
        "label": "两江新区",
        "level": 2,
        "pid": 500000,

        "children": [{
            "id": 500301,
            "label": "北部新区",
            "level": 3,
            "pid": 500300,


        }, {
            "id": 500302,
            "label": "保税港区",
            "level": 3,
            "pid": 500300,


        }, {
            "id": 500303,
            "label": "工业园区",
            "level": 3,
            "pid": 500300,


        }]
    }]
}, {
    "id": 510000,
    "label": "四川省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 510100,
        "label": "成都市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 510104,
            "label": "锦江区",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510105,
            "label": "青羊区",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510106,
            "label": "金牛区",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510107,
            "label": "武侯区",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510108,
            "label": "成华区",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510112,
            "label": "龙泉驿区",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510113,
            "label": "青白江区",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510114,
            "label": "新都区",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510115,
            "label": "温江区",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510121,
            "label": "金堂县",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510122,
            "label": "双流县",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510124,
            "label": "郫县",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510129,
            "label": "大邑县",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510131,
            "label": "蒲江县",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510132,
            "label": "新津县",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510181,
            "label": "都江堰市",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510182,
            "label": "彭州市",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510183,
            "label": "邛崃市",
            "level": 3,
            "pid": 510100,


        }, {
            "id": 510184,
            "label": "崇州市",
            "level": 3,
            "pid": 510100,


        }]
    }, {
        "id": 510300,
        "label": "自贡市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 510302,
            "label": "自流井区",
            "level": 3,
            "pid": 510300,


        }, {
            "id": 510303,
            "label": "贡井区",
            "level": 3,
            "pid": 510300,


        }, {
            "id": 510304,
            "label": "大安区",
            "level": 3,
            "pid": 510300,


        }, {
            "id": 510311,
            "label": "沿滩区",
            "level": 3,
            "pid": 510300,


        }, {
            "id": 510321,
            "label": "荣县",
            "level": 3,
            "pid": 510300,


        }, {
            "id": 510322,
            "label": "富顺县",
            "level": 3,
            "pid": 510300,


        }]
    }, {
        "id": 510400,
        "label": "攀枝花市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 510402,
            "label": "东区",
            "level": 3,
            "pid": 510400,


        }, {
            "id": 510403,
            "label": "西区",
            "level": 3,
            "pid": 510400,


        }, {
            "id": 510411,
            "label": "仁和区",
            "level": 3,
            "pid": 510400,


        }, {
            "id": 510421,
            "label": "米易县",
            "level": 3,
            "pid": 510400,


        }, {
            "id": 510422,
            "label": "盐边县",
            "level": 3,
            "pid": 510400,


        }]
    }, {
        "id": 510500,
        "label": "泸州市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 510502,
            "label": "江阳区",
            "level": 3,
            "pid": 510500,


        }, {
            "id": 510503,
            "label": "纳溪区",
            "level": 3,
            "pid": 510500,


        }, {
            "id": 510504,
            "label": "龙马潭区",
            "level": 3,
            "pid": 510500,


        }, {
            "id": 510521,
            "label": "泸县",
            "level": 3,
            "pid": 510500,


        }, {
            "id": 510522,
            "label": "合江县",
            "level": 3,
            "pid": 510500,


        }, {
            "id": 510524,
            "label": "叙永县",
            "level": 3,
            "pid": 510500,


        }, {
            "id": 510525,
            "label": "古蔺县",
            "level": 3,
            "pid": 510500,


        }]
    }, {
        "id": 510600,
        "label": "德阳市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 510603,
            "label": "旌阳区",
            "level": 3,
            "pid": 510600,


        }, {
            "id": 510623,
            "label": "中江县",
            "level": 3,
            "pid": 510600,


        }, {
            "id": 510626,
            "label": "罗江县",
            "level": 3,
            "pid": 510600,


        }, {
            "id": 510681,
            "label": "广汉市",
            "level": 3,
            "pid": 510600,


        }, {
            "id": 510682,
            "label": "什邡市",
            "level": 3,
            "pid": 510600,


        }, {
            "id": 510683,
            "label": "绵竹市",
            "level": 3,
            "pid": 510600,


        }]
    }, {
        "id": 510700,
        "label": "绵阳市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 510703,
            "label": "涪城区",
            "level": 3,
            "pid": 510700,


        }, {
            "id": 510704,
            "label": "游仙区",
            "level": 3,
            "pid": 510700,


        }, {
            "id": 510722,
            "label": "三台县",
            "level": 3,
            "pid": 510700,


        }, {
            "id": 510723,
            "label": "盐亭县",
            "level": 3,
            "pid": 510700,


        }, {
            "id": 510724,
            "label": "安县",
            "level": 3,
            "pid": 510700,


        }, {
            "id": 510725,
            "label": "梓潼县",
            "level": 3,
            "pid": 510700,


        }, {
            "id": 510726,
            "label": "北川羌族自治县",
            "level": 3,
            "pid": 510700,


        }, {
            "id": 510727,
            "label": "平武县",
            "level": 3,
            "pid": 510700,


        }, {
            "id": 510781,
            "label": "江油市",
            "level": 3,
            "pid": 510700,


        }]
    }, {
        "id": 510800,
        "label": "广元市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 510802,
            "label": "利州区",
            "level": 3,
            "pid": 510800,


        }, {
            "id": 510811,
            "label": "昭化区",
            "level": 3,
            "pid": 510800,


        }, {
            "id": 510812,
            "label": "朝天区",
            "level": 3,
            "pid": 510800,


        }, {
            "id": 510821,
            "label": "旺苍县",
            "level": 3,
            "pid": 510800,


        }, {
            "id": 510822,
            "label": "青川县",
            "level": 3,
            "pid": 510800,


        }, {
            "id": 510823,
            "label": "剑阁县",
            "level": 3,
            "pid": 510800,


        }, {
            "id": 510824,
            "label": "苍溪县",
            "level": 3,
            "pid": 510800,


        }]
    }, {
        "id": 510900,
        "label": "遂宁市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 510903,
            "label": "船山区",
            "level": 3,
            "pid": 510900,


        }, {
            "id": 510904,
            "label": "安居区",
            "level": 3,
            "pid": 510900,


        }, {
            "id": 510921,
            "label": "蓬溪县",
            "level": 3,
            "pid": 510900,


        }, {
            "id": 510922,
            "label": "射洪县",
            "level": 3,
            "pid": 510900,


        }, {
            "id": 510923,
            "label": "大英县",
            "level": 3,
            "pid": 510900,


        }]
    }, {
        "id": 511000,
        "label": "内江市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 511002,
            "label": "市中区",
            "level": 3,
            "pid": 511000,


        }, {
            "id": 511011,
            "label": "东兴区",
            "level": 3,
            "pid": 511000,


        }, {
            "id": 511024,
            "label": "威远县",
            "level": 3,
            "pid": 511000,


        }, {
            "id": 511025,
            "label": "资中县",
            "level": 3,
            "pid": 511000,


        }, {
            "id": 511028,
            "label": "隆昌县",
            "level": 3,
            "pid": 511000,


        }]
    }, {
        "id": 511100,
        "label": "乐山市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 511102,
            "label": "市中区",
            "level": 3,
            "pid": 511100,


        }, {
            "id": 511111,
            "label": "沙湾区",
            "level": 3,
            "pid": 511100,


        }, {
            "id": 511112,
            "label": "五通桥区",
            "level": 3,
            "pid": 511100,


        }, {
            "id": 511113,
            "label": "金口河区",
            "level": 3,
            "pid": 511100,


        }, {
            "id": 511123,
            "label": "犍为县",
            "level": 3,
            "pid": 511100,


        }, {
            "id": 511124,
            "label": "井研县",
            "level": 3,
            "pid": 511100,


        }, {
            "id": 511126,
            "label": "夹江县",
            "level": 3,
            "pid": 511100,


        }, {
            "id": 511129,
            "label": "沐川县",
            "level": 3,
            "pid": 511100,


        }, {
            "id": 511132,
            "label": "峨边彝族自治县",
            "level": 3,
            "pid": 511100,


        }, {
            "id": 511133,
            "label": "马边彝族自治县",
            "level": 3,
            "pid": 511100,


        }, {
            "id": 511181,
            "label": "峨眉山市",
            "level": 3,
            "pid": 511100,


        }]
    }, {
        "id": 511300,
        "label": "南充市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 511302,
            "label": "顺庆区",
            "level": 3,
            "pid": 511300,


        }, {
            "id": 511303,
            "label": "高坪区",
            "level": 3,
            "pid": 511300,


        }, {
            "id": 511304,
            "label": "嘉陵区",
            "level": 3,
            "pid": 511300,


        }, {
            "id": 511321,
            "label": "南部县",
            "level": 3,
            "pid": 511300,


        }, {
            "id": 511322,
            "label": "营山县",
            "level": 3,
            "pid": 511300,


        }, {
            "id": 511323,
            "label": "蓬安县",
            "level": 3,
            "pid": 511300,


        }, {
            "id": 511324,
            "label": "仪陇县",
            "level": 3,
            "pid": 511300,


        }, {
            "id": 511325,
            "label": "西充县",
            "level": 3,
            "pid": 511300,


        }, {
            "id": 511381,
            "label": "阆中市",
            "level": 3,
            "pid": 511300,


        }]
    }, {
        "id": 511400,
        "label": "眉山市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 511402,
            "label": "东坡区",
            "level": 3,
            "pid": 511400,


        }, {
            "id": 511403,
            "label": "彭山区",
            "level": 3,
            "pid": 511400,


        }, {
            "id": 511421,
            "label": "仁寿县",
            "level": 3,
            "pid": 511400,


        }, {
            "id": 511423,
            "label": "洪雅县",
            "level": 3,
            "pid": 511400,


        }, {
            "id": 511424,
            "label": "丹棱县",
            "level": 3,
            "pid": 511400,


        }, {
            "id": 511425,
            "label": "青神县",
            "level": 3,
            "pid": 511400,


        }]
    }, {
        "id": 511500,
        "label": "宜宾市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 511502,
            "label": "翠屏区",
            "level": 3,
            "pid": 511500,


        }, {
            "id": 511503,
            "label": "南溪区",
            "level": 3,
            "pid": 511500,


        }, {
            "id": 511521,
            "label": "宜宾县",
            "level": 3,
            "pid": 511500,


        }, {
            "id": 511523,
            "label": "江安县",
            "level": 3,
            "pid": 511500,


        }, {
            "id": 511524,
            "label": "长宁县",
            "level": 3,
            "pid": 511500,


        }, {
            "id": 511525,
            "label": "高县",
            "level": 3,
            "pid": 511500,


        }, {
            "id": 511526,
            "label": "珙县",
            "level": 3,
            "pid": 511500,


        }, {
            "id": 511527,
            "label": "筠连县",
            "level": 3,
            "pid": 511500,


        }, {
            "id": 511528,
            "label": "兴文县",
            "level": 3,
            "pid": 511500,


        }, {
            "id": 511529,
            "label": "屏山县",
            "level": 3,
            "pid": 511500,


        }]
    }, {
        "id": 511600,
        "label": "广安市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 511602,
            "label": "广安区",
            "level": 3,
            "pid": 511600,


        }, {
            "id": 511603,
            "label": "前锋区",
            "level": 3,
            "pid": 511600,


        }, {
            "id": 511621,
            "label": "岳池县",
            "level": 3,
            "pid": 511600,


        }, {
            "id": 511622,
            "label": "武胜县",
            "level": 3,
            "pid": 511600,


        }, {
            "id": 511623,
            "label": "邻水县",
            "level": 3,
            "pid": 511600,


        }, {
            "id": 511681,
            "label": "华蓥市",
            "level": 3,
            "pid": 511600,


        }]
    }, {
        "id": 511700,
        "label": "达州市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 511702,
            "label": "通川区",
            "level": 3,
            "pid": 511700,


        }, {
            "id": 511703,
            "label": "达川区",
            "level": 3,
            "pid": 511700,


        }, {
            "id": 511722,
            "label": "宣汉县",
            "level": 3,
            "pid": 511700,


        }, {
            "id": 511723,
            "label": "开江县",
            "level": 3,
            "pid": 511700,


        }, {
            "id": 511724,
            "label": "大竹县",
            "level": 3,
            "pid": 511700,


        }, {
            "id": 511725,
            "label": "渠县",
            "level": 3,
            "pid": 511700,


        }, {
            "id": 511781,
            "label": "万源市",
            "level": 3,
            "pid": 511700,


        }]
    }, {
        "id": 511800,
        "label": "雅安市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 511802,
            "label": "雨城区",
            "level": 3,
            "pid": 511800,


        }, {
            "id": 511803,
            "label": "名山区",
            "level": 3,
            "pid": 511800,


        }, {
            "id": 511822,
            "label": "荥经县",
            "level": 3,
            "pid": 511800,


        }, {
            "id": 511823,
            "label": "汉源县",
            "level": 3,
            "pid": 511800,


        }, {
            "id": 511824,
            "label": "石棉县",
            "level": 3,
            "pid": 511800,


        }, {
            "id": 511825,
            "label": "天全县",
            "level": 3,
            "pid": 511800,


        }, {
            "id": 511826,
            "label": "芦山县",
            "level": 3,
            "pid": 511800,


        }, {
            "id": 511827,
            "label": "宝兴县",
            "level": 3,
            "pid": 511800,


        }]
    }, {
        "id": 511900,
        "label": "巴中市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 511902,
            "label": "巴州区",
            "level": 3,
            "pid": 511900,


        }, {
            "id": 511903,
            "label": "恩阳区",
            "level": 3,
            "pid": 511900,


        }, {
            "id": 511921,
            "label": "通江县",
            "level": 3,
            "pid": 511900,


        }, {
            "id": 511922,
            "label": "南江县",
            "level": 3,
            "pid": 511900,


        }, {
            "id": 511923,
            "label": "平昌县",
            "level": 3,
            "pid": 511900,


        }]
    }, {
        "id": 512000,
        "label": "资阳市",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 512002,
            "label": "雁江区",
            "level": 3,
            "pid": 512000,


        }, {
            "id": 512021,
            "label": "安岳县",
            "level": 3,
            "pid": 512000,


        }, {
            "id": 512022,
            "label": "乐至县",
            "level": 3,
            "pid": 512000,


        }, {
            "id": 512081,
            "label": "简阳市",
            "level": 3,
            "pid": 512000,


        }]
    }, {
        "id": 513200,
        "label": "阿坝藏族羌族自治州",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 513221,
            "label": "汶川县",
            "level": 3,
            "pid": 513200,


        }, {
            "id": 513222,
            "label": "理县",
            "level": 3,
            "pid": 513200,


        }, {
            "id": 513223,
            "label": "茂县",
            "level": 3,
            "pid": 513200,


        }, {
            "id": 513224,
            "label": "松潘县",
            "level": 3,
            "pid": 513200,


        }, {
            "id": 513225,
            "label": "九寨沟县",
            "level": 3,
            "pid": 513200,


        }, {
            "id": 513226,
            "label": "金川县",
            "level": 3,
            "pid": 513200,


        }, {
            "id": 513227,
            "label": "小金县",
            "level": 3,
            "pid": 513200,


        }, {
            "id": 513228,
            "label": "黑水县",
            "level": 3,
            "pid": 513200,


        }, {
            "id": 513229,
            "label": "马尔康县",
            "level": 3,
            "pid": 513200,


        }, {
            "id": 513230,
            "label": "壤塘县",
            "level": 3,
            "pid": 513200,


        }, {
            "id": 513231,
            "label": "阿坝县",
            "level": 3,
            "pid": 513200,


        }, {
            "id": 513232,
            "label": "若尔盖县",
            "level": 3,
            "pid": 513200,


        }, {
            "id": 513233,
            "label": "红原县",
            "level": 3,
            "pid": 513200,


        }]
    }, {
        "id": 513300,
        "label": "甘孜藏族自治州",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 513321,
            "label": "康定县",
            "level": 3,
            "pid": 513300,


        }, {
            "id": 513322,
            "label": "泸定县",
            "level": 3,
            "pid": 513300,


        }, {
            "id": 513323,
            "label": "丹巴县",
            "level": 3,
            "pid": 513300,


        }, {
            "id": 513324,
            "label": "九龙县",
            "level": 3,
            "pid": 513300,


        }, {
            "id": 513325,
            "label": "雅江县",
            "level": 3,
            "pid": 513300,


        }, {
            "id": 513326,
            "label": "道孚县",
            "level": 3,
            "pid": 513300,


        }, {
            "id": 513327,
            "label": "炉霍县",
            "level": 3,
            "pid": 513300,


        }, {
            "id": 513328,
            "label": "甘孜县",
            "level": 3,
            "pid": 513300,


        }, {
            "id": 513329,
            "label": "新龙县",
            "level": 3,
            "pid": 513300,


        }, {
            "id": 513330,
            "label": "德格县",
            "level": 3,
            "pid": 513300,


        }, {
            "id": 513331,
            "label": "白玉县",
            "level": 3,
            "pid": 513300,


        }, {
            "id": 513332,
            "label": "石渠县",
            "level": 3,
            "pid": 513300,


        }, {
            "id": 513333,
            "label": "色达县",
            "level": 3,
            "pid": 513300,


        }, {
            "id": 513334,
            "label": "理塘县",
            "level": 3,
            "pid": 513300,


        }, {
            "id": 513335,
            "label": "巴塘县",
            "level": 3,
            "pid": 513300,


        }, {
            "id": 513336,
            "label": "乡城县",
            "level": 3,
            "pid": 513300,


        }, {
            "id": 513337,
            "label": "稻城县",
            "level": 3,
            "pid": 513300,


        }, {
            "id": 513338,
            "label": "得荣县",
            "level": 3,
            "pid": 513300,


        }]
    }, {
        "id": 513400,
        "label": "凉山彝族自治州",
        "level": 2,
        "pid": 510000,

        "children": [{
            "id": 513401,
            "label": "西昌市",
            "level": 3,
            "pid": 513400,


        }, {
            "id": 513422,
            "label": "木里藏族自治县",
            "level": 3,
            "pid": 513400,


        }, {
            "id": 513423,
            "label": "盐源县",
            "level": 3,
            "pid": 513400,


        }, {
            "id": 513424,
            "label": "德昌县",
            "level": 3,
            "pid": 513400,


        }, {
            "id": 513425,
            "label": "会理县",
            "level": 3,
            "pid": 513400,


        }, {
            "id": 513426,
            "label": "会东县",
            "level": 3,
            "pid": 513400,


        }, {
            "id": 513427,
            "label": "宁南县",
            "level": 3,
            "pid": 513400,


        }, {
            "id": 513428,
            "label": "普格县",
            "level": 3,
            "pid": 513400,


        }, {
            "id": 513429,
            "label": "布拖县",
            "level": 3,
            "pid": 513400,


        }, {
            "id": 513430,
            "label": "金阳县",
            "level": 3,
            "pid": 513400,


        }, {
            "id": 513431,
            "label": "昭觉县",
            "level": 3,
            "pid": 513400,


        }, {
            "id": 513432,
            "label": "喜德县",
            "level": 3,
            "pid": 513400,


        }, {
            "id": 513433,
            "label": "冕宁县",
            "level": 3,
            "pid": 513400,


        }, {
            "id": 513434,
            "label": "越西县",
            "level": 3,
            "pid": 513400,


        }, {
            "id": 513435,
            "label": "甘洛县",
            "level": 3,
            "pid": 513400,


        }, {
            "id": 513436,
            "label": "美姑县",
            "level": 3,
            "pid": 513400,


        }, {
            "id": 513437,
            "label": "雷波县",
            "level": 3,
            "pid": 513400,


        }]
    }]
}, {
    "id": 520000,
    "label": "贵州省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 520100,
        "label": "贵阳市",
        "level": 2,
        "pid": 520000,

        "children": [{
            "id": 520102,
            "label": "南明区",
            "level": 3,
            "pid": 520100,


        }, {
            "id": 520103,
            "label": "云岩区",
            "level": 3,
            "pid": 520100,


        }, {
            "id": 520111,
            "label": "花溪区",
            "level": 3,
            "pid": 520100,


        }, {
            "id": 520112,
            "label": "乌当区",
            "level": 3,
            "pid": 520100,


        }, {
            "id": 520113,
            "label": "白云区",
            "level": 3,
            "pid": 520100,


        }, {
            "id": 520115,
            "label": "观山湖区",
            "level": 3,
            "pid": 520100,


        }, {
            "id": 520121,
            "label": "开阳县",
            "level": 3,
            "pid": 520100,


        }, {
            "id": 520122,
            "label": "息烽县",
            "level": 3,
            "pid": 520100,


        }, {
            "id": 520123,
            "label": "修文县",
            "level": 3,
            "pid": 520100,


        }, {
            "id": 520181,
            "label": "清镇市",
            "level": 3,
            "pid": 520100,


        }]
    }, {
        "id": 520200,
        "label": "六盘水市",
        "level": 2,
        "pid": 520000,

        "children": [{
            "id": 520201,
            "label": "钟山区",
            "level": 3,
            "pid": 520200,


        }, {
            "id": 520203,
            "label": "六枝特区",
            "level": 3,
            "pid": 520200,


        }, {
            "id": 520221,
            "label": "水城县",
            "level": 3,
            "pid": 520200,


        }, {
            "id": 520222,
            "label": "盘县",
            "level": 3,
            "pid": 520200,


        }]
    }, {
        "id": 520300,
        "label": "遵义市",
        "level": 2,
        "pid": 520000,

        "children": [{
            "id": 520302,
            "label": "红花岗区",
            "level": 3,
            "pid": 520300,


        }, {
            "id": 520303,
            "label": "汇川区",
            "level": 3,
            "pid": 520300,


        }, {
            "id": 520321,
            "label": "遵义县",
            "level": 3,
            "pid": 520300,


        }, {
            "id": 520322,
            "label": "桐梓县",
            "level": 3,
            "pid": 520300,


        }, {
            "id": 520323,
            "label": "绥阳县",
            "level": 3,
            "pid": 520300,


        }, {
            "id": 520324,
            "label": "正安县",
            "level": 3,
            "pid": 520300,


        }, {
            "id": 520325,
            "label": "道真仡佬族苗族自治县",
            "level": 3,
            "pid": 520300,


        }, {
            "id": 520326,
            "label": "务川仡佬族苗族自治县",
            "level": 3,
            "pid": 520300,


        }, {
            "id": 520327,
            "label": "凤冈县",
            "level": 3,
            "pid": 520300,


        }, {
            "id": 520328,
            "label": "湄潭县",
            "level": 3,
            "pid": 520300,


        }, {
            "id": 520329,
            "label": "余庆县",
            "level": 3,
            "pid": 520300,


        }, {
            "id": 520330,
            "label": "习水县",
            "level": 3,
            "pid": 520300,


        }, {
            "id": 520381,
            "label": "赤水市",
            "level": 3,
            "pid": 520300,


        }, {
            "id": 520382,
            "label": "仁怀市",
            "level": 3,
            "pid": 520300,


        }]
    }, {
        "id": 520400,
        "label": "安顺市",
        "level": 2,
        "pid": 520000,

        "children": [{
            "id": 520402,
            "label": "西秀区",
            "level": 3,
            "pid": 520400,


        }, {
            "id": 520421,
            "label": "平坝区",
            "level": 3,
            "pid": 520400,


        }, {
            "id": 520422,
            "label": "普定县",
            "level": 3,
            "pid": 520400,


        }, {
            "id": 520423,
            "label": "镇宁布依族苗族自治县",
            "level": 3,
            "pid": 520400,


        }, {
            "id": 520424,
            "label": "关岭布依族苗族自治县",
            "level": 3,
            "pid": 520400,


        }, {
            "id": 520425,
            "label": "紫云苗族布依族自治县",
            "level": 3,
            "pid": 520400,


        }]
    }, {
        "id": 520500,
        "label": "毕节市",
        "level": 2,
        "pid": 520000,

        "children": [{
            "id": 520502,
            "label": "七星关区",
            "level": 3,
            "pid": 520500,


        }, {
            "id": 520521,
            "label": "大方县",
            "level": 3,
            "pid": 520500,


        }, {
            "id": 520522,
            "label": "黔西县",
            "level": 3,
            "pid": 520500,


        }, {
            "id": 520523,
            "label": "金沙县",
            "level": 3,
            "pid": 520500,


        }, {
            "id": 520524,
            "label": "织金县",
            "level": 3,
            "pid": 520500,


        }, {
            "id": 520525,
            "label": "纳雍县",
            "level": 3,
            "pid": 520500,


        }, {
            "id": 520526,
            "label": "威宁彝族回族苗族自治县",
            "level": 3,
            "pid": 520500,


        }, {
            "id": 520527,
            "label": "赫章县",
            "level": 3,
            "pid": 520500,


        }]
    }, {
        "id": 520600,
        "label": "铜仁市",
        "level": 2,
        "pid": 520000,

        "children": [{
            "id": 520602,
            "label": "碧江区",
            "level": 3,
            "pid": 520600,


        }, {
            "id": 520603,
            "label": "万山区",
            "level": 3,
            "pid": 520600,


        }, {
            "id": 520621,
            "label": "江口县",
            "level": 3,
            "pid": 520600,


        }, {
            "id": 520622,
            "label": "玉屏侗族自治县",
            "level": 3,
            "pid": 520600,


        }, {
            "id": 520623,
            "label": "石阡县",
            "level": 3,
            "pid": 520600,


        }, {
            "id": 520624,
            "label": "思南县",
            "level": 3,
            "pid": 520600,


        }, {
            "id": 520625,
            "label": "印江土家族苗族自治县",
            "level": 3,
            "pid": 520600,


        }, {
            "id": 520626,
            "label": "德江县",
            "level": 3,
            "pid": 520600,


        }, {
            "id": 520627,
            "label": "沿河土家族自治县",
            "level": 3,
            "pid": 520600,


        }, {
            "id": 520628,
            "label": "松桃苗族自治县",
            "level": 3,
            "pid": 520600,


        }]
    }, {
        "id": 522300,
        "label": "黔西南布依族苗族自治州",
        "level": 2,
        "pid": 520000,

        "children": [{
            "id": 522301,
            "label": "兴义市 ",
            "level": 3,
            "pid": 522300,


        }, {
            "id": 522322,
            "label": "兴仁县",
            "level": 3,
            "pid": 522300,


        }, {
            "id": 522323,
            "label": "普安县",
            "level": 3,
            "pid": 522300,


        }, {
            "id": 522324,
            "label": "晴隆县",
            "level": 3,
            "pid": 522300,


        }, {
            "id": 522325,
            "label": "贞丰县",
            "level": 3,
            "pid": 522300,


        }, {
            "id": 522326,
            "label": "望谟县",
            "level": 3,
            "pid": 522300,


        }, {
            "id": 522327,
            "label": "册亨县",
            "level": 3,
            "pid": 522300,


        }, {
            "id": 522328,
            "label": "安龙县",
            "level": 3,
            "pid": 522300,


        }]
    }, {
        "id": 522600,
        "label": "黔东南苗族侗族自治州",
        "level": 2,
        "pid": 520000,

        "children": [{
            "id": 522601,
            "label": "凯里市",
            "level": 3,
            "pid": 522600,


        }, {
            "id": 522622,
            "label": "黄平县",
            "level": 3,
            "pid": 522600,


        }, {
            "id": 522623,
            "label": "施秉县",
            "level": 3,
            "pid": 522600,


        }, {
            "id": 522624,
            "label": "三穗县",
            "level": 3,
            "pid": 522600,


        }, {
            "id": 522625,
            "label": "镇远县",
            "level": 3,
            "pid": 522600,


        }, {
            "id": 522626,
            "label": "岑巩县",
            "level": 3,
            "pid": 522600,


        }, {
            "id": 522627,
            "label": "天柱县",
            "level": 3,
            "pid": 522600,


        }, {
            "id": 522628,
            "label": "锦屏县",
            "level": 3,
            "pid": 522600,


        }, {
            "id": 522629,
            "label": "剑河县",
            "level": 3,
            "pid": 522600,


        }, {
            "id": 522630,
            "label": "台江县",
            "level": 3,
            "pid": 522600,


        }, {
            "id": 522631,
            "label": "黎平县",
            "level": 3,
            "pid": 522600,


        }, {
            "id": 522632,
            "label": "榕江县",
            "level": 3,
            "pid": 522600,


        }, {
            "id": 522633,
            "label": "从江县",
            "level": 3,
            "pid": 522600,


        }, {
            "id": 522634,
            "label": "雷山县",
            "level": 3,
            "pid": 522600,


        }, {
            "id": 522635,
            "label": "麻江县",
            "level": 3,
            "pid": 522600,


        }, {
            "id": 522636,
            "label": "丹寨县",
            "level": 3,
            "pid": 522600,


        }]
    }, {
        "id": 522700,
        "label": "黔南布依族苗族自治州",
        "level": 2,
        "pid": 520000,

        "children": [{
            "id": 522701,
            "label": "都匀市",
            "level": 3,
            "pid": 522700,


        }, {
            "id": 522702,
            "label": "福泉市",
            "level": 3,
            "pid": 522700,


        }, {
            "id": 522722,
            "label": "荔波县",
            "level": 3,
            "pid": 522700,


        }, {
            "id": 522723,
            "label": "贵定县",
            "level": 3,
            "pid": 522700,


        }, {
            "id": 522725,
            "label": "瓮安县",
            "level": 3,
            "pid": 522700,


        }, {
            "id": 522726,
            "label": "独山县",
            "level": 3,
            "pid": 522700,


        }, {
            "id": 522727,
            "label": "平塘县",
            "level": 3,
            "pid": 522700,


        }, {
            "id": 522728,
            "label": "罗甸县",
            "level": 3,
            "pid": 522700,


        }, {
            "id": 522729,
            "label": "长顺县",
            "level": 3,
            "pid": 522700,


        }, {
            "id": 522730,
            "label": "龙里县",
            "level": 3,
            "pid": 522700,


        }, {
            "id": 522731,
            "label": "惠水县",
            "level": 3,
            "pid": 522700,


        }, {
            "id": 522732,
            "label": "三都水族自治县",
            "level": 3,
            "pid": 522700,


        }]
    }]
}, {
    "id": 530000,
    "label": "云南省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 530100,
        "label": "昆明市",
        "level": 2,
        "pid": 530000,

        "children": [{
            "id": 530102,
            "label": "五华区",
            "level": 3,
            "pid": 530100,


        }, {
            "id": 530103,
            "label": "盘龙区",
            "level": 3,
            "pid": 530100,


        }, {
            "id": 530111,
            "label": "官渡区",
            "level": 3,
            "pid": 530100,


        }, {
            "id": 530112,
            "label": "西山区",
            "level": 3,
            "pid": 530100,


        }, {
            "id": 530113,
            "label": "东川区",
            "level": 3,
            "pid": 530100,


        }, {
            "id": 530114,
            "label": "呈贡区",
            "level": 3,
            "pid": 530100,


        }, {
            "id": 530122,
            "label": "晋宁县",
            "level": 3,
            "pid": 530100,


        }, {
            "id": 530124,
            "label": "富民县",
            "level": 3,
            "pid": 530100,


        }, {
            "id": 530125,
            "label": "宜良县",
            "level": 3,
            "pid": 530100,


        }, {
            "id": 530126,
            "label": "石林彝族自治县",
            "level": 3,
            "pid": 530100,


        }, {
            "id": 530127,
            "label": "嵩明县",
            "level": 3,
            "pid": 530100,


        }, {
            "id": 530128,
            "label": "禄劝彝族苗族自治县",
            "level": 3,
            "pid": 530100,


        }, {
            "id": 530129,
            "label": "寻甸回族彝族自治县 ",
            "level": 3,
            "pid": 530100,


        }, {
            "id": 530181,
            "label": "安宁市",
            "level": 3,
            "pid": 530100,


        }]
    }, {
        "id": 530300,
        "label": "曲靖市",
        "level": 2,
        "pid": 530000,

        "children": [{
            "id": 530302,
            "label": "麒麟区",
            "level": 3,
            "pid": 530300,


        }, {
            "id": 530321,
            "label": "马龙县",
            "level": 3,
            "pid": 530300,


        }, {
            "id": 530322,
            "label": "陆良县",
            "level": 3,
            "pid": 530300,


        }, {
            "id": 530323,
            "label": "师宗县",
            "level": 3,
            "pid": 530300,


        }, {
            "id": 530324,
            "label": "罗平县",
            "level": 3,
            "pid": 530300,


        }, {
            "id": 530325,
            "label": "富源县",
            "level": 3,
            "pid": 530300,


        }, {
            "id": 530326,
            "label": "会泽县",
            "level": 3,
            "pid": 530300,


        }, {
            "id": 530328,
            "label": "沾益县",
            "level": 3,
            "pid": 530300,


        }, {
            "id": 530381,
            "label": "宣威市",
            "level": 3,
            "pid": 530300,


        }]
    }, {
        "id": 530400,
        "label": "玉溪市",
        "level": 2,
        "pid": 530000,

        "children": [{
            "id": 530402,
            "label": "红塔区",
            "level": 3,
            "pid": 530400,


        }, {
            "id": 530421,
            "label": "江川县",
            "level": 3,
            "pid": 530400,


        }, {
            "id": 530422,
            "label": "澄江县",
            "level": 3,
            "pid": 530400,


        }, {
            "id": 530423,
            "label": "通海县",
            "level": 3,
            "pid": 530400,


        }, {
            "id": 530424,
            "label": "华宁县",
            "level": 3,
            "pid": 530400,


        }, {
            "id": 530425,
            "label": "易门县",
            "level": 3,
            "pid": 530400,


        }, {
            "id": 530426,
            "label": "峨山彝族自治县",
            "level": 3,
            "pid": 530400,


        }, {
            "id": 530427,
            "label": "新平彝族傣族自治县",
            "level": 3,
            "pid": 530400,


        }, {
            "id": 530428,
            "label": "元江哈尼族彝族傣族自治县",
            "level": 3,
            "pid": 530400,


        }]
    }, {
        "id": 530500,
        "label": "保山市",
        "level": 2,
        "pid": 530000,

        "children": [{
            "id": 530502,
            "label": "隆阳区",
            "level": 3,
            "pid": 530500,


        }, {
            "id": 530521,
            "label": "施甸县",
            "level": 3,
            "pid": 530500,


        }, {
            "id": 530522,
            "label": "腾冲县",
            "level": 3,
            "pid": 530500,


        }, {
            "id": 530523,
            "label": "龙陵县",
            "level": 3,
            "pid": 530500,


        }, {
            "id": 530524,
            "label": "昌宁县",
            "level": 3,
            "pid": 530500,


        }]
    }, {
        "id": 530600,
        "label": "昭通市",
        "level": 2,
        "pid": 530000,

        "children": [{
            "id": 530602,
            "label": "昭阳区",
            "level": 3,
            "pid": 530600,


        }, {
            "id": 530621,
            "label": "鲁甸县",
            "level": 3,
            "pid": 530600,


        }, {
            "id": 530622,
            "label": "巧家县",
            "level": 3,
            "pid": 530600,


        }, {
            "id": 530623,
            "label": "盐津县",
            "level": 3,
            "pid": 530600,


        }, {
            "id": 530624,
            "label": "大关县",
            "level": 3,
            "pid": 530600,


        }, {
            "id": 530625,
            "label": "永善县",
            "level": 3,
            "pid": 530600,


        }, {
            "id": 530626,
            "label": "绥江县",
            "level": 3,
            "pid": 530600,


        }, {
            "id": 530627,
            "label": "镇雄县",
            "level": 3,
            "pid": 530600,


        }, {
            "id": 530628,
            "label": "彝良县",
            "level": 3,
            "pid": 530600,


        }, {
            "id": 530629,
            "label": "威信县",
            "level": 3,
            "pid": 530600,


        }, {
            "id": 530630,
            "label": "水富县",
            "level": 3,
            "pid": 530600,


        }]
    }, {
        "id": 530700,
        "label": "丽江市",
        "level": 2,
        "pid": 530000,

        "children": [{
            "id": 530702,
            "label": "古城区",
            "level": 3,
            "pid": 530700,


        }, {
            "id": 530721,
            "label": "玉龙纳西族自治县",
            "level": 3,
            "pid": 530700,


        }, {
            "id": 530722,
            "label": "永胜县",
            "level": 3,
            "pid": 530700,


        }, {
            "id": 530723,
            "label": "华坪县",
            "level": 3,
            "pid": 530700,


        }, {
            "id": 530724,
            "label": "宁蒗彝族自治县",
            "level": 3,
            "pid": 530700,


        }]
    }, {
        "id": 530800,
        "label": "普洱市",
        "level": 2,
        "pid": 530000,

        "children": [{
            "id": 530802,
            "label": "思茅区",
            "level": 3,
            "pid": 530800,


        }, {
            "id": 530821,
            "label": "宁洱哈尼族彝族自治县",
            "level": 3,
            "pid": 530800,


        }, {
            "id": 530822,
            "label": "墨江哈尼族自治县",
            "level": 3,
            "pid": 530800,


        }, {
            "id": 530823,
            "label": "景东彝族自治县",
            "level": 3,
            "pid": 530800,


        }, {
            "id": 530824,
            "label": "景谷傣族彝族自治县",
            "level": 3,
            "pid": 530800,


        }, {
            "id": 530825,
            "label": "镇沅彝族哈尼族拉祜族自治县",
            "level": 3,
            "pid": 530800,


        }, {
            "id": 530826,
            "label": "江城哈尼族彝族自治县",
            "level": 3,
            "pid": 530800,


        }, {
            "id": 530827,
            "label": "孟连傣族拉祜族佤族自治县",
            "level": 3,
            "pid": 530800,


        }, {
            "id": 530828,
            "label": "澜沧拉祜族自治县",
            "level": 3,
            "pid": 530800,


        }, {
            "id": 530829,
            "label": "西盟佤族自治县",
            "level": 3,
            "pid": 530800,


        }]
    }, {
        "id": 530900,
        "label": "临沧市",
        "level": 2,
        "pid": 530000,

        "children": [{
            "id": 530902,
            "label": "临翔区",
            "level": 3,
            "pid": 530900,


        }, {
            "id": 530921,
            "label": "凤庆县",
            "level": 3,
            "pid": 530900,


        }, {
            "id": 530922,
            "label": "云县",
            "level": 3,
            "pid": 530900,


        }, {
            "id": 530923,
            "label": "永德县",
            "level": 3,
            "pid": 530900,


        }, {
            "id": 530924,
            "label": "镇康县",
            "level": 3,
            "pid": 530900,


        }, {
            "id": 530925,
            "label": "双江拉祜族佤族布朗族傣族自治县",
            "level": 3,
            "pid": 530900,


        }, {
            "id": 530926,
            "label": "耿马傣族佤族自治县",
            "level": 3,
            "pid": 530900,


        }, {
            "id": 530927,
            "label": "沧源佤族自治县",
            "level": 3,
            "pid": 530900,


        }]
    }, {
        "id": 532300,
        "label": "楚雄彝族自治州",
        "level": 2,
        "pid": 530000,

        "children": [{
            "id": 532301,
            "label": "楚雄市",
            "level": 3,
            "pid": 532300,


        }, {
            "id": 532322,
            "label": "双柏县",
            "level": 3,
            "pid": 532300,


        }, {
            "id": 532323,
            "label": "牟定县",
            "level": 3,
            "pid": 532300,


        }, {
            "id": 532324,
            "label": "南华县",
            "level": 3,
            "pid": 532300,


        }, {
            "id": 532325,
            "label": "姚安县",
            "level": 3,
            "pid": 532300,


        }, {
            "id": 532326,
            "label": "大姚县",
            "level": 3,
            "pid": 532300,


        }, {
            "id": 532327,
            "label": "永仁县",
            "level": 3,
            "pid": 532300,


        }, {
            "id": 532328,
            "label": "元谋县",
            "level": 3,
            "pid": 532300,


        }, {
            "id": 532329,
            "label": "武定县",
            "level": 3,
            "pid": 532300,


        }, {
            "id": 532331,
            "label": "禄丰县",
            "level": 3,
            "pid": 532300,


        }]
    }, {
        "id": 532500,
        "label": "红河哈尼族彝族自治州",
        "level": 2,
        "pid": 530000,

        "children": [{
            "id": 532501,
            "label": "个旧市",
            "level": 3,
            "pid": 532500,


        }, {
            "id": 532502,
            "label": "开远市",
            "level": 3,
            "pid": 532500,


        }, {
            "id": 532503,
            "label": "蒙自市",
            "level": 3,
            "pid": 532500,


        }, {
            "id": 532504,
            "label": "弥勒市",
            "level": 3,
            "pid": 532500,


        }, {
            "id": 532523,
            "label": "屏边苗族自治县",
            "level": 3,
            "pid": 532500,


        }, {
            "id": 532524,
            "label": "建水县",
            "level": 3,
            "pid": 532500,


        }, {
            "id": 532525,
            "label": "石屏县",
            "level": 3,
            "pid": 532500,


        }, {
            "id": 532527,
            "label": "泸西县",
            "level": 3,
            "pid": 532500,


        }, {
            "id": 532528,
            "label": "元阳县",
            "level": 3,
            "pid": 532500,


        }, {
            "id": 532529,
            "label": "红河县",
            "level": 3,
            "pid": 532500,


        }, {
            "id": 532530,
            "label": "金平苗族瑶族傣族自治县",
            "level": 3,
            "pid": 532500,


        }, {
            "id": 532531,
            "label": "绿春县",
            "level": 3,
            "pid": 532500,


        }, {
            "id": 532532,
            "label": "河口瑶族自治县",
            "level": 3,
            "pid": 532500,


        }]
    }, {
        "id": 532600,
        "label": "文山壮族苗族自治州",
        "level": 2,
        "pid": 530000,

        "children": [{
            "id": 532601,
            "label": "文山市",
            "level": 3,
            "pid": 532600,


        }, {
            "id": 532622,
            "label": "砚山县",
            "level": 3,
            "pid": 532600,


        }, {
            "id": 532623,
            "label": "西畴县",
            "level": 3,
            "pid": 532600,


        }, {
            "id": 532624,
            "label": "麻栗坡县",
            "level": 3,
            "pid": 532600,


        }, {
            "id": 532625,
            "label": "马关县",
            "level": 3,
            "pid": 532600,


        }, {
            "id": 532626,
            "label": "丘北县",
            "level": 3,
            "pid": 532600,


        }, {
            "id": 532627,
            "label": "广南县",
            "level": 3,
            "pid": 532600,


        }, {
            "id": 532628,
            "label": "富宁县",
            "level": 3,
            "pid": 532600,


        }]
    }, {
        "id": 532800,
        "label": "西双版纳傣族自治州",
        "level": 2,
        "pid": 530000,

        "children": [{
            "id": 532801,
            "label": "景洪市",
            "level": 3,
            "pid": 532800,


        }, {
            "id": 532822,
            "label": "勐海县",
            "level": 3,
            "pid": 532800,


        }, {
            "id": 532823,
            "label": "勐腊县",
            "level": 3,
            "pid": 532800,


        }]
    }, {
        "id": 532900,
        "label": "大理白族自治州",
        "level": 2,
        "pid": 530000,

        "children": [{
            "id": 532901,
            "label": "大理市",
            "level": 3,
            "pid": 532900,


        }, {
            "id": 532922,
            "label": "漾濞彝族自治县",
            "level": 3,
            "pid": 532900,


        }, {
            "id": 532923,
            "label": "祥云县",
            "level": 3,
            "pid": 532900,


        }, {
            "id": 532924,
            "label": "宾川县",
            "level": 3,
            "pid": 532900,


        }, {
            "id": 532925,
            "label": "弥渡县",
            "level": 3,
            "pid": 532900,


        }, {
            "id": 532926,
            "label": "南涧彝族自治县",
            "level": 3,
            "pid": 532900,


        }, {
            "id": 532927,
            "label": "巍山彝族回族自治县",
            "level": 3,
            "pid": 532900,


        }, {
            "id": 532928,
            "label": "永平县",
            "level": 3,
            "pid": 532900,


        }, {
            "id": 532929,
            "label": "云龙县",
            "level": 3,
            "pid": 532900,


        }, {
            "id": 532930,
            "label": "洱源县",
            "level": 3,
            "pid": 532900,


        }, {
            "id": 532931,
            "label": "剑川县",
            "level": 3,
            "pid": 532900,


        }, {
            "id": 532932,
            "label": "鹤庆县",
            "level": 3,
            "pid": 532900,


        }]
    }, {
        "id": 533100,
        "label": "德宏傣族景颇族自治州",
        "level": 2,
        "pid": 530000,

        "children": [{
            "id": 533102,
            "label": "瑞丽市",
            "level": 3,
            "pid": 533100,


        }, {
            "id": 533103,
            "label": "芒市",
            "level": 3,
            "pid": 533100,


        }, {
            "id": 533122,
            "label": "梁河县",
            "level": 3,
            "pid": 533100,


        }, {
            "id": 533123,
            "label": "盈江县",
            "level": 3,
            "pid": 533100,


        }, {
            "id": 533124,
            "label": "陇川县",
            "level": 3,
            "pid": 533100,


        }]
    }, {
        "id": 533300,
        "label": "怒江傈僳族自治州",
        "level": 2,
        "pid": 530000,

        "children": [{
            "id": 533321,
            "label": "泸水县",
            "level": 3,
            "pid": 533300,


        }, {
            "id": 533323,
            "label": "福贡县",
            "level": 3,
            "pid": 533300,


        }, {
            "id": 533324,
            "label": "贡山独龙族怒族自治县",
            "level": 3,
            "pid": 533300,


        }, {
            "id": 533325,
            "label": "兰坪白族普米族自治县",
            "level": 3,
            "pid": 533300,


        }]
    }, {
        "id": 533400,
        "label": "迪庆藏族自治州",
        "level": 2,
        "pid": 530000,

        "children": [{
            "id": 533421,
            "label": "香格里拉市",
            "level": 3,
            "pid": 533400,


        }, {
            "id": 533422,
            "label": "德钦县",
            "level": 3,
            "pid": 533400,


        }, {
            "id": 533423,
            "label": "维西傈僳族自治县",
            "level": 3,
            "pid": 533400,


        }]
    }]
}, {
    "id": 540000,
    "label": "西藏自治区",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 540100,
        "label": "拉萨市",
        "level": 2,
        "pid": 540000,

        "children": [{
            "id": 540102,
            "label": "城关区",
            "level": 3,
            "pid": 540100,


        }, {
            "id": 540121,
            "label": "林周县",
            "level": 3,
            "pid": 540100,


        }, {
            "id": 540122,
            "label": "当雄县",
            "level": 3,
            "pid": 540100,


        }, {
            "id": 540123,
            "label": "尼木县",
            "level": 3,
            "pid": 540100,


        }, {
            "id": 540124,
            "label": "曲水县",
            "level": 3,
            "pid": 540100,


        }, {
            "id": 540125,
            "label": "堆龙德庆县",
            "level": 3,
            "pid": 540100,


        }, {
            "id": 540126,
            "label": "达孜县",
            "level": 3,
            "pid": 540100,


        }, {
            "id": 540127,
            "label": "墨竹工卡县",
            "level": 3,
            "pid": 540100,


        }]
    }, {
        "id": 540200,
        "label": "日喀则市",
        "level": 2,
        "pid": 540000,

        "children": [{
            "id": 540202,
            "label": "桑珠孜区",
            "level": 3,
            "pid": 540200,


        }, {
            "id": 540221,
            "label": "南木林县",
            "level": 3,
            "pid": 540200,


        }, {
            "id": 540222,
            "label": "江孜县",
            "level": 3,
            "pid": 540200,


        }, {
            "id": 540223,
            "label": "定日县",
            "level": 3,
            "pid": 540200,


        }, {
            "id": 540224,
            "label": "萨迦县",
            "level": 3,
            "pid": 540200,


        }, {
            "id": 540225,
            "label": "拉孜县",
            "level": 3,
            "pid": 540200,


        }, {
            "id": 540226,
            "label": "昂仁县",
            "level": 3,
            "pid": 540200,


        }, {
            "id": 540227,
            "label": "谢通门县",
            "level": 3,
            "pid": 540200,


        }, {
            "id": 540228,
            "label": "白朗县",
            "level": 3,
            "pid": 540200,


        }, {
            "id": 540229,
            "label": "仁布县",
            "level": 3,
            "pid": 540200,


        }, {
            "id": 540230,
            "label": "康马县",
            "level": 3,
            "pid": 540200,


        }, {
            "id": 540231,
            "label": "定结县",
            "level": 3,
            "pid": 540200,


        }, {
            "id": 540232,
            "label": "仲巴县",
            "level": 3,
            "pid": 540200,


        }, {
            "id": 540233,
            "label": "亚东县",
            "level": 3,
            "pid": 540200,


        }, {
            "id": 540234,
            "label": "吉隆县",
            "level": 3,
            "pid": 540200,


        }, {
            "id": 540235,
            "label": "聂拉木县",
            "level": 3,
            "pid": 540200,


        }, {
            "id": 540236,
            "label": "萨嘎县",
            "level": 3,
            "pid": 540200,


        }, {
            "id": 540237,
            "label": "岗巴县",
            "level": 3,
            "pid": 540200,


        }]
    }, {
        "id": 540300,
        "label": "昌都市",
        "level": 2,
        "pid": 540000,

        "children": [{
            "id": 540302,
            "label": "卡若区",
            "level": 3,
            "pid": 540300,


        }, {
            "id": 540321,
            "label": "江达县",
            "level": 3,
            "pid": 540300,


        }, {
            "id": 540322,
            "label": "贡觉县",
            "level": 3,
            "pid": 540300,


        }, {
            "id": 540323,
            "label": "类乌齐县",
            "level": 3,
            "pid": 540300,


        }, {
            "id": 540324,
            "label": "丁青县",
            "level": 3,
            "pid": 540300,


        }, {
            "id": 540325,
            "label": "察雅县",
            "level": 3,
            "pid": 540300,


        }, {
            "id": 540326,
            "label": "八宿县",
            "level": 3,
            "pid": 540300,


        }, {
            "id": 540327,
            "label": "左贡县",
            "level": 3,
            "pid": 540300,


        }, {
            "id": 540328,
            "label": "芒康县",
            "level": 3,
            "pid": 540300,


        }, {
            "id": 540329,
            "label": "洛隆县",
            "level": 3,
            "pid": 540300,


        }, {
            "id": 540330,
            "label": "边坝县",
            "level": 3,
            "pid": 540300,


        }]
    }, {
        "id": 542200,
        "label": "山南地区",
        "level": 2,
        "pid": 540000,

        "children": [{
            "id": 542221,
            "label": "乃东县",
            "level": 3,
            "pid": 542200,


        }, {
            "id": 542222,
            "label": "扎囊县",
            "level": 3,
            "pid": 542200,


        }, {
            "id": 542223,
            "label": "贡嘎县",
            "level": 3,
            "pid": 542200,


        }, {
            "id": 542224,
            "label": "桑日县",
            "level": 3,
            "pid": 542200,


        }, {
            "id": 542225,
            "label": "琼结县",
            "level": 3,
            "pid": 542200,


        }, {
            "id": 542226,
            "label": "曲松县",
            "level": 3,
            "pid": 542200,


        }, {
            "id": 542227,
            "label": "措美县",
            "level": 3,
            "pid": 542200,


        }, {
            "id": 542228,
            "label": "洛扎县",
            "level": 3,
            "pid": 542200,


        }, {
            "id": 542229,
            "label": "加查县",
            "level": 3,
            "pid": 542200,


        }, {
            "id": 542231,
            "label": "隆子县",
            "level": 3,
            "pid": 542200,


        }, {
            "id": 542232,
            "label": "错那县",
            "level": 3,
            "pid": 542200,


        }, {
            "id": 542233,
            "label": "浪卡子县",
            "level": 3,
            "pid": 542200,


        }]
    }, {
        "id": 542400,
        "label": "那曲地区",
        "level": 2,
        "pid": 540000,

        "children": [{
            "id": 542421,
            "label": "那曲县",
            "level": 3,
            "pid": 542400,


        }, {
            "id": 542422,
            "label": "嘉黎县",
            "level": 3,
            "pid": 542400,


        }, {
            "id": 542423,
            "label": "比如县",
            "level": 3,
            "pid": 542400,


        }, {
            "id": 542424,
            "label": "聂荣县",
            "level": 3,
            "pid": 542400,


        }, {
            "id": 542425,
            "label": "安多县",
            "level": 3,
            "pid": 542400,


        }, {
            "id": 542426,
            "label": "申扎县",
            "level": 3,
            "pid": 542400,


        }, {
            "id": 542427,
            "label": "索县",
            "level": 3,
            "pid": 542400,


        }, {
            "id": 542428,
            "label": "班戈县",
            "level": 3,
            "pid": 542400,


        }, {
            "id": 542429,
            "label": "巴青县",
            "level": 3,
            "pid": 542400,


        }, {
            "id": 542430,
            "label": "尼玛县",
            "level": 3,
            "pid": 542400,


        }, {
            "id": 542431,
            "label": "双湖县",
            "level": 3,
            "pid": 542400,


        }]
    }, {
        "id": 542500,
        "label": "阿里地区",
        "level": 2,
        "pid": 540000,

        "children": [{
            "id": 542521,
            "label": "普兰县",
            "level": 3,
            "pid": 542500,


        }, {
            "id": 542522,
            "label": "札达县",
            "level": 3,
            "pid": 542500,


        }, {
            "id": 542523,
            "label": "噶尔县",
            "level": 3,
            "pid": 542500,


        }, {
            "id": 542524,
            "label": "日土县",
            "level": 3,
            "pid": 542500,


        }, {
            "id": 542525,
            "label": "革吉县",
            "level": 3,
            "pid": 542500,


        }, {
            "id": 542526,
            "label": "改则县",
            "level": 3,
            "pid": 542500,


        }, {
            "id": 542527,
            "label": "措勤县",
            "level": 3,
            "pid": 542500,


        }]
    }, {
        "id": 542600,
        "label": "林芝地区",
        "level": 2,
        "pid": 540000,

        "children": [{
            "id": 542621,
            "label": "林芝县",
            "level": 3,
            "pid": 542600,


        }, {
            "id": 542622,
            "label": "工布江达县",
            "level": 3,
            "pid": 542600,


        }, {
            "id": 542623,
            "label": "米林县",
            "level": 3,
            "pid": 542600,


        }, {
            "id": 542624,
            "label": "墨脱县",
            "level": 3,
            "pid": 542600,


        }, {
            "id": 542625,
            "label": "波密县",
            "level": 3,
            "pid": 542600,


        }, {
            "id": 542626,
            "label": "察隅县",
            "level": 3,
            "pid": 542600,


        }, {
            "id": 542627,
            "label": "朗县",
            "level": 3,
            "pid": 542600,


        }]
    }]
}, {
    "id": 610000,
    "label": "陕西省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 610100,
        "label": "西安市",
        "level": 2,
        "pid": 610000,

        "children": [{
            "id": 610102,
            "label": "新城区",
            "level": 3,
            "pid": 610100,


        }, {
            "id": 610103,
            "label": "碑林区",
            "level": 3,
            "pid": 610100,


        }, {
            "id": 610104,
            "label": "莲湖区",
            "level": 3,
            "pid": 610100,


        }, {
            "id": 610111,
            "label": "灞桥区",
            "level": 3,
            "pid": 610100,


        }, {
            "id": 610112,
            "label": "未央区",
            "level": 3,
            "pid": 610100,


        }, {
            "id": 610113,
            "label": "雁塔区",
            "level": 3,
            "pid": 610100,


        }, {
            "id": 610114,
            "label": "阎良区",
            "level": 3,
            "pid": 610100,


        }, {
            "id": 610115,
            "label": "临潼区",
            "level": 3,
            "pid": 610100,


        }, {
            "id": 610116,
            "label": "长安区",
            "level": 3,
            "pid": 610100,


        }, {
            "id": 610122,
            "label": "蓝田县",
            "level": 3,
            "pid": 610100,


        }, {
            "id": 610124,
            "label": "周至县",
            "level": 3,
            "pid": 610100,


        }, {
            "id": 610125,
            "label": "户县",
            "level": 3,
            "pid": 610100,


        }, {
            "id": 610126,
            "label": "高陵区",
            "level": 3,
            "pid": 610100,


        }]
    }, {
        "id": 610200,
        "label": "铜川市",
        "level": 2,
        "pid": 610000,

        "children": [{
            "id": 610202,
            "label": "王益区",
            "level": 3,
            "pid": 610200,


        }, {
            "id": 610203,
            "label": "印台区",
            "level": 3,
            "pid": 610200,


        }, {
            "id": 610204,
            "label": "耀州区",
            "level": 3,
            "pid": 610200,


        }, {
            "id": 610222,
            "label": "宜君县",
            "level": 3,
            "pid": 610200,


        }]
    }, {
        "id": 610300,
        "label": "宝鸡市",
        "level": 2,
        "pid": 610000,

        "children": [{
            "id": 610302,
            "label": "渭滨区",
            "level": 3,
            "pid": 610300,


        }, {
            "id": 610303,
            "label": "金台区",
            "level": 3,
            "pid": 610300,


        }, {
            "id": 610304,
            "label": "陈仓区",
            "level": 3,
            "pid": 610300,


        }, {
            "id": 610322,
            "label": "凤翔县",
            "level": 3,
            "pid": 610300,


        }, {
            "id": 610323,
            "label": "岐山县",
            "level": 3,
            "pid": 610300,


        }, {
            "id": 610324,
            "label": "扶风县",
            "level": 3,
            "pid": 610300,


        }, {
            "id": 610326,
            "label": "眉县",
            "level": 3,
            "pid": 610300,


        }, {
            "id": 610327,
            "label": "陇县",
            "level": 3,
            "pid": 610300,


        }, {
            "id": 610328,
            "label": "千阳县",
            "level": 3,
            "pid": 610300,


        }, {
            "id": 610329,
            "label": "麟游县",
            "level": 3,
            "pid": 610300,


        }, {
            "id": 610330,
            "label": "凤县",
            "level": 3,
            "pid": 610300,


        }, {
            "id": 610331,
            "label": "太白县",
            "level": 3,
            "pid": 610300,


        }]
    }, {
        "id": 610400,
        "label": "咸阳市",
        "level": 2,
        "pid": 610000,

        "children": [{
            "id": 610402,
            "label": "秦都区",
            "level": 3,
            "pid": 610400,


        }, {
            "id": 610403,
            "label": "杨陵区",
            "level": 3,
            "pid": 610400,


        }, {
            "id": 610404,
            "label": "渭城区",
            "level": 3,
            "pid": 610400,


        }, {
            "id": 610422,
            "label": "三原县",
            "level": 3,
            "pid": 610400,


        }, {
            "id": 610423,
            "label": "泾阳县",
            "level": 3,
            "pid": 610400,


        }, {
            "id": 610424,
            "label": "乾县",
            "level": 3,
            "pid": 610400,


        }, {
            "id": 610425,
            "label": "礼泉县",
            "level": 3,
            "pid": 610400,


        }, {
            "id": 610426,
            "label": "永寿县",
            "level": 3,
            "pid": 610400,


        }, {
            "id": 610427,
            "label": "彬县",
            "level": 3,
            "pid": 610400,


        }, {
            "id": 610428,
            "label": "长武县",
            "level": 3,
            "pid": 610400,


        }, {
            "id": 610429,
            "label": "旬邑县",
            "level": 3,
            "pid": 610400,


        }, {
            "id": 610430,
            "label": "淳化县",
            "level": 3,
            "pid": 610400,


        }, {
            "id": 610431,
            "label": "武功县",
            "level": 3,
            "pid": 610400,


        }, {
            "id": 610481,
            "label": "兴平市",
            "level": 3,
            "pid": 610400,


        }]
    }, {
        "id": 610500,
        "label": "渭南市",
        "level": 2,
        "pid": 610000,

        "children": [{
            "id": 610502,
            "label": "临渭区",
            "level": 3,
            "pid": 610500,


        }, {
            "id": 610521,
            "label": "华县",
            "level": 3,
            "pid": 610500,


        }, {
            "id": 610522,
            "label": "潼关县",
            "level": 3,
            "pid": 610500,


        }, {
            "id": 610523,
            "label": "大荔县",
            "level": 3,
            "pid": 610500,


        }, {
            "id": 610524,
            "label": "合阳县",
            "level": 3,
            "pid": 610500,


        }, {
            "id": 610525,
            "label": "澄城县",
            "level": 3,
            "pid": 610500,


        }, {
            "id": 610526,
            "label": "蒲城县",
            "level": 3,
            "pid": 610500,


        }, {
            "id": 610527,
            "label": "白水县",
            "level": 3,
            "pid": 610500,


        }, {
            "id": 610528,
            "label": "富平县",
            "level": 3,
            "pid": 610500,


        }, {
            "id": 610581,
            "label": "韩城市",
            "level": 3,
            "pid": 610500,


        }, {
            "id": 610582,
            "label": "华阴市",
            "level": 3,
            "pid": 610500,


        }]
    }, {
        "id": 610600,
        "label": "延安市",
        "level": 2,
        "pid": 610000,

        "children": [{
            "id": 610602,
            "label": "宝塔区",
            "level": 3,
            "pid": 610600,


        }, {
            "id": 610621,
            "label": "延长县",
            "level": 3,
            "pid": 610600,


        }, {
            "id": 610622,
            "label": "延川县",
            "level": 3,
            "pid": 610600,


        }, {
            "id": 610623,
            "label": "子长县",
            "level": 3,
            "pid": 610600,


        }, {
            "id": 610624,
            "label": "安塞县",
            "level": 3,
            "pid": 610600,


        }, {
            "id": 610625,
            "label": "志丹县",
            "level": 3,
            "pid": 610600,


        }, {
            "id": 610626,
            "label": "吴起县",
            "level": 3,
            "pid": 610600,


        }, {
            "id": 610627,
            "label": "甘泉县",
            "level": 3,
            "pid": 610600,


        }, {
            "id": 610628,
            "label": "富县",
            "level": 3,
            "pid": 610600,


        }, {
            "id": 610629,
            "label": "洛川县",
            "level": 3,
            "pid": 610600,


        }, {
            "id": 610630,
            "label": "宜川县",
            "level": 3,
            "pid": 610600,


        }, {
            "id": 610631,
            "label": "黄龙县",
            "level": 3,
            "pid": 610600,


        }, {
            "id": 610632,
            "label": "黄陵县",
            "level": 3,
            "pid": 610600,


        }]
    }, {
        "id": 610700,
        "label": "汉中市",
        "level": 2,
        "pid": 610000,

        "children": [{
            "id": 610702,
            "label": "汉台区",
            "level": 3,
            "pid": 610700,


        }, {
            "id": 610721,
            "label": "南郑县",
            "level": 3,
            "pid": 610700,


        }, {
            "id": 610722,
            "label": "城固县",
            "level": 3,
            "pid": 610700,


        }, {
            "id": 610723,
            "label": "洋县",
            "level": 3,
            "pid": 610700,


        }, {
            "id": 610724,
            "label": "西乡县",
            "level": 3,
            "pid": 610700,


        }, {
            "id": 610725,
            "label": "勉县",
            "level": 3,
            "pid": 610700,


        }, {
            "id": 610726,
            "label": "宁强县",
            "level": 3,
            "pid": 610700,


        }, {
            "id": 610727,
            "label": "略阳县",
            "level": 3,
            "pid": 610700,


        }, {
            "id": 610728,
            "label": "镇巴县",
            "level": 3,
            "pid": 610700,


        }, {
            "id": 610729,
            "label": "留坝县",
            "level": 3,
            "pid": 610700,


        }, {
            "id": 610730,
            "label": "佛坪县",
            "level": 3,
            "pid": 610700,


        }]
    }, {
        "id": 610800,
        "label": "榆林市",
        "level": 2,
        "pid": 610000,

        "children": [{
            "id": 610802,
            "label": "榆阳区",
            "level": 3,
            "pid": 610800,


        }, {
            "id": 610821,
            "label": "神木县",
            "level": 3,
            "pid": 610800,


        }, {
            "id": 610822,
            "label": "府谷县",
            "level": 3,
            "pid": 610800,


        }, {
            "id": 610823,
            "label": "横山县",
            "level": 3,
            "pid": 610800,


        }, {
            "id": 610824,
            "label": "靖边县",
            "level": 3,
            "pid": 610800,


        }, {
            "id": 610825,
            "label": "定边县",
            "level": 3,
            "pid": 610800,


        }, {
            "id": 610826,
            "label": "绥德县",
            "level": 3,
            "pid": 610800,


        }, {
            "id": 610827,
            "label": "米脂县",
            "level": 3,
            "pid": 610800,


        }, {
            "id": 610828,
            "label": "佳县",
            "level": 3,
            "pid": 610800,


        }, {
            "id": 610829,
            "label": "吴堡县",
            "level": 3,
            "pid": 610800,


        }, {
            "id": 610830,
            "label": "清涧县",
            "level": 3,
            "pid": 610800,


        }, {
            "id": 610831,
            "label": "子洲县",
            "level": 3,
            "pid": 610800,


        }]
    }, {
        "id": 610900,
        "label": "安康市",
        "level": 2,
        "pid": 610000,

        "children": [{
            "id": 610902,
            "label": "汉滨区",
            "level": 3,
            "pid": 610900,


        }, {
            "id": 610921,
            "label": "汉阴县",
            "level": 3,
            "pid": 610900,


        }, {
            "id": 610922,
            "label": "石泉县",
            "level": 3,
            "pid": 610900,


        }, {
            "id": 610923,
            "label": "宁陕县",
            "level": 3,
            "pid": 610900,


        }, {
            "id": 610924,
            "label": "紫阳县",
            "level": 3,
            "pid": 610900,


        }, {
            "id": 610925,
            "label": "岚皋县",
            "level": 3,
            "pid": 610900,


        }, {
            "id": 610926,
            "label": "平利县",
            "level": 3,
            "pid": 610900,


        }, {
            "id": 610927,
            "label": "镇坪县",
            "level": 3,
            "pid": 610900,


        }, {
            "id": 610928,
            "label": "旬阳县",
            "level": 3,
            "pid": 610900,


        }, {
            "id": 610929,
            "label": "白河县",
            "level": 3,
            "pid": 610900,


        }]
    }, {
        "id": 611000,
        "label": "商洛市",
        "level": 2,
        "pid": 610000,

        "children": [{
            "id": 611002,
            "label": "商州区",
            "level": 3,
            "pid": 611000,


        }, {
            "id": 611021,
            "label": "洛南县",
            "level": 3,
            "pid": 611000,


        }, {
            "id": 611022,
            "label": "丹凤县",
            "level": 3,
            "pid": 611000,


        }, {
            "id": 611023,
            "label": "商南县",
            "level": 3,
            "pid": 611000,


        }, {
            "id": 611024,
            "label": "山阳县",
            "level": 3,
            "pid": 611000,


        }, {
            "id": 611025,
            "label": "镇安县",
            "level": 3,
            "pid": 611000,


        }, {
            "id": 611026,
            "label": "柞水县",
            "level": 3,
            "pid": 611000,


        }]
    }, {
        "id": 611100,
        "label": "西咸新区",
        "level": 2,
        "pid": 610000,

        "children": [{
            "id": 611101,
            "label": "空港新城",
            "level": 3,
            "pid": 611100,


        }, {
            "id": 611102,
            "label": "沣东新城",
            "level": 3,
            "pid": 611100,


        }, {
            "id": 611103,
            "label": "秦汉新城",
            "level": 3,
            "pid": 611100,


        }, {
            "id": 611104,
            "label": "沣西新城",
            "level": 3,
            "pid": 611100,


        }, {
            "id": 611105,
            "label": "泾河新城",
            "level": 3,
            "pid": 611100,


        }]
    }]
}, {
    "id": 620000,
    "label": "甘肃省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 620100,
        "label": "兰州市",
        "level": 2,
        "pid": 620000,

        "children": [{
            "id": 620102,
            "label": "城关区",
            "level": 3,
            "pid": 620100,


        }, {
            "id": 620103,
            "label": "七里河区",
            "level": 3,
            "pid": 620100,


        }, {
            "id": 620104,
            "label": "西固区",
            "level": 3,
            "pid": 620100,


        }, {
            "id": 620105,
            "label": "安宁区",
            "level": 3,
            "pid": 620100,


        }, {
            "id": 620111,
            "label": "红古区",
            "level": 3,
            "pid": 620100,


        }, {
            "id": 620121,
            "label": "永登县",
            "level": 3,
            "pid": 620100,


        }, {
            "id": 620122,
            "label": "皋兰县",
            "level": 3,
            "pid": 620100,


        }, {
            "id": 620123,
            "label": "榆中县",
            "level": 3,
            "pid": 620100,


        }]
    }, {
        "id": 620200,
        "label": "嘉峪关市",
        "level": 2,
        "pid": 620000,

        "children": [{
            "id": 620201,
            "label": "雄关区",
            "level": 3,
            "pid": 620200,


        }, {
            "id": 620202,
            "label": "长城区",
            "level": 3,
            "pid": 620200,


        }, {
            "id": 620203,
            "label": "镜铁区",
            "level": 3,
            "pid": 620200,


        }]
    }, {
        "id": 620300,
        "label": "金昌市",
        "level": 2,
        "pid": 620000,

        "children": [{
            "id": 620302,
            "label": "金川区",
            "level": 3,
            "pid": 620300,


        }, {
            "id": 620321,
            "label": "永昌县",
            "level": 3,
            "pid": 620300,


        }]
    }, {
        "id": 620400,
        "label": "白银市",
        "level": 2,
        "pid": 620000,

        "children": [{
            "id": 620402,
            "label": "白银区",
            "level": 3,
            "pid": 620400,


        }, {
            "id": 620403,
            "label": "平川区",
            "level": 3,
            "pid": 620400,


        }, {
            "id": 620421,
            "label": "靖远县",
            "level": 3,
            "pid": 620400,


        }, {
            "id": 620422,
            "label": "会宁县",
            "level": 3,
            "pid": 620400,


        }, {
            "id": 620423,
            "label": "景泰县",
            "level": 3,
            "pid": 620400,


        }]
    }, {
        "id": 620500,
        "label": "天水市",
        "level": 2,
        "pid": 620000,

        "children": [{
            "id": 620502,
            "label": "秦州区",
            "level": 3,
            "pid": 620500,


        }, {
            "id": 620503,
            "label": "麦积区",
            "level": 3,
            "pid": 620500,


        }, {
            "id": 620521,
            "label": "清水县",
            "level": 3,
            "pid": 620500,


        }, {
            "id": 620522,
            "label": "秦安县",
            "level": 3,
            "pid": 620500,


        }, {
            "id": 620523,
            "label": "甘谷县",
            "level": 3,
            "pid": 620500,


        }, {
            "id": 620524,
            "label": "武山县",
            "level": 3,
            "pid": 620500,


        }, {
            "id": 620525,
            "label": "张家川回族自治县",
            "level": 3,
            "pid": 620500,


        }]
    }, {
        "id": 620600,
        "label": "武威市",
        "level": 2,
        "pid": 620000,

        "children": [{
            "id": 620602,
            "label": "凉州区",
            "level": 3,
            "pid": 620600,


        }, {
            "id": 620621,
            "label": "民勤县",
            "level": 3,
            "pid": 620600,


        }, {
            "id": 620622,
            "label": "古浪县",
            "level": 3,
            "pid": 620600,


        }, {
            "id": 620623,
            "label": "天祝藏族自治县",
            "level": 3,
            "pid": 620600,


        }]
    }, {
        "id": 620700,
        "label": "张掖市",
        "level": 2,
        "pid": 620000,

        "children": [{
            "id": 620702,
            "label": "甘州区",
            "level": 3,
            "pid": 620700,


        }, {
            "id": 620721,
            "label": "肃南裕固族自治县",
            "level": 3,
            "pid": 620700,


        }, {
            "id": 620722,
            "label": "民乐县",
            "level": 3,
            "pid": 620700,


        }, {
            "id": 620723,
            "label": "临泽县",
            "level": 3,
            "pid": 620700,


        }, {
            "id": 620724,
            "label": "高台县",
            "level": 3,
            "pid": 620700,


        }, {
            "id": 620725,
            "label": "山丹县",
            "level": 3,
            "pid": 620700,


        }]
    }, {
        "id": 620800,
        "label": "平凉市",
        "level": 2,
        "pid": 620000,

        "children": [{
            "id": 620802,
            "label": "崆峒区",
            "level": 3,
            "pid": 620800,


        }, {
            "id": 620821,
            "label": "泾川县",
            "level": 3,
            "pid": 620800,


        }, {
            "id": 620822,
            "label": "灵台县",
            "level": 3,
            "pid": 620800,


        }, {
            "id": 620823,
            "label": "崇信县",
            "level": 3,
            "pid": 620800,


        }, {
            "id": 620824,
            "label": "华亭县",
            "level": 3,
            "pid": 620800,


        }, {
            "id": 620825,
            "label": "庄浪县",
            "level": 3,
            "pid": 620800,


        }, {
            "id": 620826,
            "label": "静宁县",
            "level": 3,
            "pid": 620800,


        }]
    }, {
        "id": 620900,
        "label": "酒泉市",
        "level": 2,
        "pid": 620000,

        "children": [{
            "id": 620902,
            "label": "肃州区",
            "level": 3,
            "pid": 620900,


        }, {
            "id": 620921,
            "label": "金塔县",
            "level": 3,
            "pid": 620900,


        }, {
            "id": 620922,
            "label": "瓜州县",
            "level": 3,
            "pid": 620900,


        }, {
            "id": 620923,
            "label": "肃北蒙古族自治县",
            "level": 3,
            "pid": 620900,


        }, {
            "id": 620924,
            "label": "阿克塞哈萨克族自治县",
            "level": 3,
            "pid": 620900,


        }, {
            "id": 620981,
            "label": "玉门市",
            "level": 3,
            "pid": 620900,


        }, {
            "id": 620982,
            "label": "敦煌市",
            "level": 3,
            "pid": 620900,


        }]
    }, {
        "id": 621000,
        "label": "庆阳市",
        "level": 2,
        "pid": 620000,

        "children": [{
            "id": 621002,
            "label": "西峰区",
            "level": 3,
            "pid": 621000,


        }, {
            "id": 621021,
            "label": "庆城县",
            "level": 3,
            "pid": 621000,


        }, {
            "id": 621022,
            "label": "环县",
            "level": 3,
            "pid": 621000,


        }, {
            "id": 621023,
            "label": "华池县",
            "level": 3,
            "pid": 621000,


        }, {
            "id": 621024,
            "label": "合水县",
            "level": 3,
            "pid": 621000,


        }, {
            "id": 621025,
            "label": "正宁县",
            "level": 3,
            "pid": 621000,


        }, {
            "id": 621026,
            "label": "宁县",
            "level": 3,
            "pid": 621000,


        }, {
            "id": 621027,
            "label": "镇原县",
            "level": 3,
            "pid": 621000,


        }]
    }, {
        "id": 621100,
        "label": "定西市",
        "level": 2,
        "pid": 620000,

        "children": [{
            "id": 621102,
            "label": "安定区",
            "level": 3,
            "pid": 621100,


        }, {
            "id": 621121,
            "label": "通渭县",
            "level": 3,
            "pid": 621100,


        }, {
            "id": 621122,
            "label": "陇西县",
            "level": 3,
            "pid": 621100,


        }, {
            "id": 621123,
            "label": "渭源县",
            "level": 3,
            "pid": 621100,


        }, {
            "id": 621124,
            "label": "临洮县",
            "level": 3,
            "pid": 621100,


        }, {
            "id": 621125,
            "label": "漳县",
            "level": 3,
            "pid": 621100,


        }, {
            "id": 621126,
            "label": "岷县",
            "level": 3,
            "pid": 621100,


        }]
    }, {
        "id": 621200,
        "label": "陇南市",
        "level": 2,
        "pid": 620000,

        "children": [{
            "id": 621202,
            "label": "武都区",
            "level": 3,
            "pid": 621200,


        }, {
            "id": 621221,
            "label": "成县",
            "level": 3,
            "pid": 621200,


        }, {
            "id": 621222,
            "label": "文县",
            "level": 3,
            "pid": 621200,


        }, {
            "id": 621223,
            "label": "宕昌县",
            "level": 3,
            "pid": 621200,


        }, {
            "id": 621224,
            "label": "康县",
            "level": 3,
            "pid": 621200,


        }, {
            "id": 621225,
            "label": "西和县",
            "level": 3,
            "pid": 621200,


        }, {
            "id": 621226,
            "label": "礼县",
            "level": 3,
            "pid": 621200,


        }, {
            "id": 621227,
            "label": "徽县",
            "level": 3,
            "pid": 621200,


        }, {
            "id": 621228,
            "label": "两当县",
            "level": 3,
            "pid": 621200,


        }]
    }, {
        "id": 622900,
        "label": "临夏回族自治州",
        "level": 2,
        "pid": 620000,

        "children": [{
            "id": 622901,
            "label": "临夏市",
            "level": 3,
            "pid": 622900,


        }, {
            "id": 622921,
            "label": "临夏县",
            "level": 3,
            "pid": 622900,


        }, {
            "id": 622922,
            "label": "康乐县",
            "level": 3,
            "pid": 622900,


        }, {
            "id": 622923,
            "label": "永靖县",
            "level": 3,
            "pid": 622900,


        }, {
            "id": 622924,
            "label": "广河县",
            "level": 3,
            "pid": 622900,


        }, {
            "id": 622925,
            "label": "和政县",
            "level": 3,
            "pid": 622900,


        }, {
            "id": 622926,
            "label": "东乡族自治县",
            "level": 3,
            "pid": 622900,


        }, {
            "id": 622927,
            "label": "积石山保安族东乡族撒拉族自治县",
            "level": 3,
            "pid": 622900,


        }]
    }, {
        "id": 623000,
        "label": "甘南藏族自治州",
        "level": 2,
        "pid": 620000,

        "children": [{
            "id": 623001,
            "label": "合作市",
            "level": 3,
            "pid": 623000,


        }, {
            "id": 623021,
            "label": "临潭县",
            "level": 3,
            "pid": 623000,


        }, {
            "id": 623022,
            "label": "卓尼县",
            "level": 3,
            "pid": 623000,


        }, {
            "id": 623023,
            "label": "舟曲县",
            "level": 3,
            "pid": 623000,


        }, {
            "id": 623024,
            "label": "迭部县",
            "level": 3,
            "pid": 623000,


        }, {
            "id": 623025,
            "label": "玛曲县",
            "level": 3,
            "pid": 623000,


        }, {
            "id": 623026,
            "label": "碌曲县",
            "level": 3,
            "pid": 623000,


        }, {
            "id": 623027,
            "label": "夏河县",
            "level": 3,
            "pid": 623000,


        }]
    }]
}, {
    "id": 630000,
    "label": "青海省",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 630100,
        "label": "西宁市",
        "level": 2,
        "pid": 630000,

        "children": [{
            "id": 630102,
            "label": "城东区",
            "level": 3,
            "pid": 630100,


        }, {
            "id": 630103,
            "label": "城中区",
            "level": 3,
            "pid": 630100,


        }, {
            "id": 630104,
            "label": "城西区",
            "level": 3,
            "pid": 630100,


        }, {
            "id": 630105,
            "label": "城北区",
            "level": 3,
            "pid": 630100,


        }, {
            "id": 630121,
            "label": "大通回族土族自治县",
            "level": 3,
            "pid": 630100,


        }, {
            "id": 630122,
            "label": "湟中县",
            "level": 3,
            "pid": 630100,


        }, {
            "id": 630123,
            "label": "湟源县",
            "level": 3,
            "pid": 630100,


        }]
    }, {
        "id": 630200,
        "label": "海东市",
        "level": 2,
        "pid": 630000,

        "children": [{
            "id": 630202,
            "label": "乐都区",
            "level": 3,
            "pid": 630200,


        }, {
            "id": 630221,
            "label": "平安县",
            "level": 3,
            "pid": 630200,


        }, {
            "id": 630222,
            "label": "民和回族土族自治县",
            "level": 3,
            "pid": 630200,


        }, {
            "id": 630223,
            "label": "互助土族自治县",
            "level": 3,
            "pid": 630200,


        }, {
            "id": 630224,
            "label": "化隆回族自治县",
            "level": 3,
            "pid": 630200,


        }, {
            "id": 630225,
            "label": "循化撒拉族自治县",
            "level": 3,
            "pid": 630200,


        }]
    }, {
        "id": 632200,
        "label": "海北藏族自治州",
        "level": 2,
        "pid": 630000,

        "children": [{
            "id": 632221,
            "label": "门源回族自治县",
            "level": 3,
            "pid": 632200,


        }, {
            "id": 632222,
            "label": "祁连县",
            "level": 3,
            "pid": 632200,


        }, {
            "id": 632223,
            "label": "海晏县",
            "level": 3,
            "pid": 632200,


        }, {
            "id": 632224,
            "label": "刚察县",
            "level": 3,
            "pid": 632200,


        }]
    }, {
        "id": 632300,
        "label": "黄南藏族自治州",
        "level": 2,
        "pid": 630000,

        "children": [{
            "id": 632321,
            "label": "同仁县",
            "level": 3,
            "pid": 632300,


        }, {
            "id": 632322,
            "label": "尖扎县",
            "level": 3,
            "pid": 632300,


        }, {
            "id": 632323,
            "label": "泽库县",
            "level": 3,
            "pid": 632300,


        }, {
            "id": 632324,
            "label": "河南蒙古族自治县",
            "level": 3,
            "pid": 632300,


        }]
    }, {
        "id": 632500,
        "label": "海南藏族自治州",
        "level": 2,
        "pid": 630000,

        "children": [{
            "id": 632521,
            "label": "共和县",
            "level": 3,
            "pid": 632500,


        }, {
            "id": 632522,
            "label": "同德县",
            "level": 3,
            "pid": 632500,


        }, {
            "id": 632523,
            "label": "贵德县",
            "level": 3,
            "pid": 632500,


        }, {
            "id": 632524,
            "label": "兴海县",
            "level": 3,
            "pid": 632500,


        }, {
            "id": 632525,
            "label": "贵南县",
            "level": 3,
            "pid": 632500,


        }]
    }, {
        "id": 632600,
        "label": "果洛藏族自治州",
        "level": 2,
        "pid": 630000,

        "children": [{
            "id": 632621,
            "label": "玛沁县",
            "level": 3,
            "pid": 632600,


        }, {
            "id": 632622,
            "label": "班玛县",
            "level": 3,
            "pid": 632600,


        }, {
            "id": 632623,
            "label": "甘德县",
            "level": 3,
            "pid": 632600,


        }, {
            "id": 632624,
            "label": "达日县",
            "level": 3,
            "pid": 632600,


        }, {
            "id": 632625,
            "label": "久治县",
            "level": 3,
            "pid": 632600,


        }, {
            "id": 632626,
            "label": "玛多县",
            "level": 3,
            "pid": 632600,


        }]
    }, {
        "id": 632700,
        "label": "玉树藏族自治州",
        "level": 2,
        "pid": 630000,

        "children": [{
            "id": 632701,
            "label": "玉树市",
            "level": 3,
            "pid": 632700,


        }, {
            "id": 632722,
            "label": "杂多县",
            "level": 3,
            "pid": 632700,


        }, {
            "id": 632723,
            "label": "称多县",
            "level": 3,
            "pid": 632700,


        }, {
            "id": 632724,
            "label": "治多县",
            "level": 3,
            "pid": 632700,


        }, {
            "id": 632725,
            "label": "囊谦县",
            "level": 3,
            "pid": 632700,


        }, {
            "id": 632726,
            "label": "曲麻莱县",
            "level": 3,
            "pid": 632700,


        }]
    }, {
        "id": 632800,
        "label": "海西蒙古族藏族自治州",
        "level": 2,
        "pid": 630000,

        "children": [{
            "id": 632801,
            "label": "格尔木市",
            "level": 3,
            "pid": 632800,


        }, {
            "id": 632802,
            "label": "德令哈市",
            "level": 3,
            "pid": 632800,


        }, {
            "id": 632821,
            "label": "乌兰县",
            "level": 3,
            "pid": 632800,


        }, {
            "id": 632822,
            "label": "都兰县",
            "level": 3,
            "pid": 632800,


        }, {
            "id": 632823,
            "label": "天峻县",
            "level": 3,
            "pid": 632800,


        }]
    }]
}, {
    "id": 640000,
    "label": "宁夏回族自治区",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 640100,
        "label": "银川市",
        "level": 2,
        "pid": 640000,

        "children": [{
            "id": 640104,
            "label": "兴庆区",
            "level": 3,
            "pid": 640100,


        }, {
            "id": 640105,
            "label": "西夏区",
            "level": 3,
            "pid": 640100,


        }, {
            "id": 640106,
            "label": "金凤区",
            "level": 3,
            "pid": 640100,


        }, {
            "id": 640121,
            "label": "永宁县",
            "level": 3,
            "pid": 640100,


        }, {
            "id": 640122,
            "label": "贺兰县",
            "level": 3,
            "pid": 640100,


        }, {
            "id": 640181,
            "label": "灵武市",
            "level": 3,
            "pid": 640100,


        }]
    }, {
        "id": 640200,
        "label": "石嘴山市",
        "level": 2,
        "pid": 640000,

        "children": [{
            "id": 640202,
            "label": "大武口区",
            "level": 3,
            "pid": 640200,


        }, {
            "id": 640205,
            "label": "惠农区",
            "level": 3,
            "pid": 640200,


        }, {
            "id": 640221,
            "label": "平罗县",
            "level": 3,
            "pid": 640200,


        }]
    }, {
        "id": 640300,
        "label": "吴忠市",
        "level": 2,
        "pid": 640000,

        "children": [{
            "id": 640302,
            "label": "利通区",
            "level": 3,
            "pid": 640300,


        }, {
            "id": 640303,
            "label": "红寺堡区",
            "level": 3,
            "pid": 640300,


        }, {
            "id": 640323,
            "label": "盐池县",
            "level": 3,
            "pid": 640300,


        }, {
            "id": 640324,
            "label": "同心县",
            "level": 3,
            "pid": 640300,


        }, {
            "id": 640381,
            "label": "青铜峡市",
            "level": 3,
            "pid": 640300,


        }]
    }, {
        "id": 640400,
        "label": "固原市",
        "level": 2,
        "pid": 640000,

        "children": [{
            "id": 640402,
            "label": "原州区",
            "level": 3,
            "pid": 640400,


        }, {
            "id": 640422,
            "label": "西吉县",
            "level": 3,
            "pid": 640400,


        }, {
            "id": 640423,
            "label": "隆德县",
            "level": 3,
            "pid": 640400,


        }, {
            "id": 640424,
            "label": "泾源县",
            "level": 3,
            "pid": 640400,


        }, {
            "id": 640425,
            "label": "彭阳县",
            "level": 3,
            "pid": 640400,


        }]
    }, {
        "id": 640500,
        "label": "中卫市",
        "level": 2,
        "pid": 640000,

        "children": [{
            "id": 640502,
            "label": "沙坡头区",
            "level": 3,
            "pid": 640500,


        }, {
            "id": 640521,
            "label": "中宁县",
            "level": 3,
            "pid": 640500,


        }, {
            "id": 640522,
            "label": "海原县",
            "level": 3,
            "pid": 640500,


        }]
    }]
}, {
    "id": 650000,
    "label": "新疆维吾尔自治区",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 650100,
        "label": "乌鲁木齐市",
        "level": 2,
        "pid": 650000,

        "children": [{
            "id": 650102,
            "label": "天山区",
            "level": 3,
            "pid": 650100,


        }, {
            "id": 650103,
            "label": "沙依巴克区",
            "level": 3,
            "pid": 650100,


        }, {
            "id": 650104,
            "label": "新市区",
            "level": 3,
            "pid": 650100,


        }, {
            "id": 650105,
            "label": "水磨沟区",
            "level": 3,
            "pid": 650100,


        }, {
            "id": 650106,
            "label": "头屯河区",
            "level": 3,
            "pid": 650100,


        }, {
            "id": 650107,
            "label": "达坂城区",
            "level": 3,
            "pid": 650100,


        }, {
            "id": 650109,
            "label": "米东区",
            "level": 3,
            "pid": 650100,


        }, {
            "id": 650121,
            "label": "乌鲁木齐县",
            "level": 3,
            "pid": 650100,


        }]
    }, {
        "id": 650200,
        "label": "克拉玛依市",
        "level": 2,
        "pid": 650000,

        "children": [{
            "id": 650202,
            "label": "独山子区",
            "level": 3,
            "pid": 650200,


        }, {
            "id": 650203,
            "label": "克拉玛依区",
            "level": 3,
            "pid": 650200,


        }, {
            "id": 650204,
            "label": "白碱滩区",
            "level": 3,
            "pid": 650200,


        }, {
            "id": 650205,
            "label": "乌尔禾区",
            "level": 3,
            "pid": 650200,


        }]
    }, {
        "id": 652100,
        "label": "吐鲁番地区",
        "level": 2,
        "pid": 650000,

        "children": [{
            "id": 652101,
            "label": "吐鲁番市",
            "level": 3,
            "pid": 652100,


        }, {
            "id": 652122,
            "label": "鄯善县",
            "level": 3,
            "pid": 652100,


        }, {
            "id": 652123,
            "label": "托克逊县",
            "level": 3,
            "pid": 652100,


        }]
    }, {
        "id": 652200,
        "label": "哈密地区",
        "level": 2,
        "pid": 650000,

        "children": [{
            "id": 652201,
            "label": "哈密市",
            "level": 3,
            "pid": 652200,


        }, {
            "id": 652222,
            "label": "巴里坤哈萨克自治县",
            "level": 3,
            "pid": 652200,


        }, {
            "id": 652223,
            "label": "伊吾县",
            "level": 3,
            "pid": 652200,


        }]
    }, {
        "id": 652300,
        "label": "昌吉回族自治州",
        "level": 2,
        "pid": 650000,

        "children": [{
            "id": 652301,
            "label": "昌吉市",
            "level": 3,
            "pid": 652300,


        }, {
            "id": 652302,
            "label": "阜康市",
            "level": 3,
            "pid": 652300,


        }, {
            "id": 652323,
            "label": "呼图壁县",
            "level": 3,
            "pid": 652300,


        }, {
            "id": 652324,
            "label": "玛纳斯县",
            "level": 3,
            "pid": 652300,


        }, {
            "id": 652325,
            "label": "奇台县",
            "level": 3,
            "pid": 652300,


        }, {
            "id": 652327,
            "label": "吉木萨尔县",
            "level": 3,
            "pid": 652300,


        }, {
            "id": 652328,
            "label": "木垒哈萨克自治县",
            "level": 3,
            "pid": 652300,


        }]
    }, {
        "id": 652700,
        "label": "博尔塔拉蒙古自治州",
        "level": 2,
        "pid": 650000,

        "children": [{
            "id": 652701,
            "label": "博乐市",
            "level": 3,
            "pid": 652700,


        }, {
            "id": 652702,
            "label": "阿拉山口市",
            "level": 3,
            "pid": 652700,


        }, {
            "id": 652722,
            "label": "精河县",
            "level": 3,
            "pid": 652700,


        }, {
            "id": 652723,
            "label": "温泉县",
            "level": 3,
            "pid": 652700,


        }]
    }, {
        "id": 652800,
        "label": "巴音郭楞蒙古自治州",
        "level": 2,
        "pid": 650000,

        "children": [{
            "id": 652801,
            "label": "库尔勒市",
            "level": 3,
            "pid": 652800,


        }, {
            "id": 652822,
            "label": "轮台县",
            "level": 3,
            "pid": 652800,


        }, {
            "id": 652823,
            "label": "尉犁县",
            "level": 3,
            "pid": 652800,


        }, {
            "id": 652824,
            "label": "若羌县",
            "level": 3,
            "pid": 652800,


        }, {
            "id": 652825,
            "label": "且末县",
            "level": 3,
            "pid": 652800,


        }, {
            "id": 652826,
            "label": "焉耆回族自治县",
            "level": 3,
            "pid": 652800,


        }, {
            "id": 652827,
            "label": "和静县",
            "level": 3,
            "pid": 652800,


        }, {
            "id": 652828,
            "label": "和硕县",
            "level": 3,
            "pid": 652800,


        }, {
            "id": 652829,
            "label": "博湖县",
            "level": 3,
            "pid": 652800,


        }]
    }, {
        "id": 652900,
        "label": "阿克苏地区",
        "level": 2,
        "pid": 650000,

        "children": [{
            "id": 652901,
            "label": "阿克苏市",
            "level": 3,
            "pid": 652900,


        }, {
            "id": 652922,
            "label": "温宿县",
            "level": 3,
            "pid": 652900,


        }, {
            "id": 652923,
            "label": "库车县",
            "level": 3,
            "pid": 652900,


        }, {
            "id": 652924,
            "label": "沙雅县",
            "level": 3,
            "pid": 652900,


        }, {
            "id": 652925,
            "label": "新和县",
            "level": 3,
            "pid": 652900,


        }, {
            "id": 652926,
            "label": "拜城县",
            "level": 3,
            "pid": 652900,


        }, {
            "id": 652927,
            "label": "乌什县",
            "level": 3,
            "pid": 652900,


        }, {
            "id": 652928,
            "label": "阿瓦提县",
            "level": 3,
            "pid": 652900,


        }, {
            "id": 652929,
            "label": "柯坪县",
            "level": 3,
            "pid": 652900,


        }]
    }, {
        "id": 653000,
        "label": "克孜勒苏柯尔克孜自治州",
        "level": 2,
        "pid": 650000,

        "children": [{
            "id": 653001,
            "label": "阿图什市",
            "level": 3,
            "pid": 653000,


        }, {
            "id": 653022,
            "label": "阿克陶县",
            "level": 3,
            "pid": 653000,


        }, {
            "id": 653023,
            "label": "阿合奇县",
            "level": 3,
            "pid": 653000,


        }, {
            "id": 653024,
            "label": "乌恰县",
            "level": 3,
            "pid": 653000,


        }]
    }, {
        "id": 653100,
        "label": "喀什地区",
        "level": 2,
        "pid": 650000,

        "children": [{
            "id": 653101,
            "label": "喀什市",
            "level": 3,
            "pid": 653100,


        }, {
            "id": 653121,
            "label": "疏附县",
            "level": 3,
            "pid": 653100,


        }, {
            "id": 653122,
            "label": "疏勒县",
            "level": 3,
            "pid": 653100,


        }, {
            "id": 653123,
            "label": "英吉沙县",
            "level": 3,
            "pid": 653100,


        }, {
            "id": 653124,
            "label": "泽普县",
            "level": 3,
            "pid": 653100,


        }, {
            "id": 653125,
            "label": "莎车县",
            "level": 3,
            "pid": 653100,


        }, {
            "id": 653126,
            "label": "叶城县",
            "level": 3,
            "pid": 653100,


        }, {
            "id": 653127,
            "label": "麦盖提县",
            "level": 3,
            "pid": 653100,


        }, {
            "id": 653128,
            "label": "岳普湖县",
            "level": 3,
            "pid": 653100,


        }, {
            "id": 653129,
            "label": "伽师县",
            "level": 3,
            "pid": 653100,


        }, {
            "id": 653130,
            "label": "巴楚县",
            "level": 3,
            "pid": 653100,


        }, {
            "id": 653131,
            "label": "塔什库尔干塔吉克自治县",
            "level": 3,
            "pid": 653100,


        }]
    }, {
        "id": 653200,
        "label": "和田地区",
        "level": 2,
        "pid": 650000,

        "children": [{
            "id": 653201,
            "label": "和田市",
            "level": 3,
            "pid": 653200,


        }, {
            "id": 653221,
            "label": "和田县",
            "level": 3,
            "pid": 653200,


        }, {
            "id": 653222,
            "label": "墨玉县",
            "level": 3,
            "pid": 653200,


        }, {
            "id": 653223,
            "label": "皮山县",
            "level": 3,
            "pid": 653200,


        }, {
            "id": 653224,
            "label": "洛浦县",
            "level": 3,
            "pid": 653200,


        }, {
            "id": 653225,
            "label": "策勒县",
            "level": 3,
            "pid": 653200,


        }, {
            "id": 653226,
            "label": "于田县",
            "level": 3,
            "pid": 653200,


        }, {
            "id": 653227,
            "label": "民丰县",
            "level": 3,
            "pid": 653200,


        }]
    }, {
        "id": 654000,
        "label": "伊犁哈萨克自治州",
        "level": 2,
        "pid": 650000,

        "children": [{
            "id": 654002,
            "label": "伊宁市",
            "level": 3,
            "pid": 654000,


        }, {
            "id": 654003,
            "label": "奎屯市",
            "level": 3,
            "pid": 654000,


        }, {
            "id": 654004,
            "label": "霍尔果斯市",
            "level": 3,
            "pid": 654000,


        }, {
            "id": 654021,
            "label": "伊宁县",
            "level": 3,
            "pid": 654000,


        }, {
            "id": 654022,
            "label": "察布查尔锡伯自治县",
            "level": 3,
            "pid": 654000,


        }, {
            "id": 654023,
            "label": "霍城县",
            "level": 3,
            "pid": 654000,


        }, {
            "id": 654024,
            "label": "巩留县",
            "level": 3,
            "pid": 654000,


        }, {
            "id": 654025,
            "label": "新源县",
            "level": 3,
            "pid": 654000,


        }, {
            "id": 654026,
            "label": "昭苏县",
            "level": 3,
            "pid": 654000,


        }, {
            "id": 654027,
            "label": "特克斯县",
            "level": 3,
            "pid": 654000,


        }, {
            "id": 654028,
            "label": "尼勒克县",
            "level": 3,
            "pid": 654000,


        }]
    }, {
        "id": 654200,
        "label": "塔城地区",
        "level": 2,
        "pid": 650000,

        "children": [{
            "id": 654201,
            "label": "塔城市",
            "level": 3,
            "pid": 654200,


        }, {
            "id": 654202,
            "label": "乌苏市",
            "level": 3,
            "pid": 654200,


        }, {
            "id": 654221,
            "label": "额敏县",
            "level": 3,
            "pid": 654200,


        }, {
            "id": 654223,
            "label": "沙湾县",
            "level": 3,
            "pid": 654200,


        }, {
            "id": 654224,
            "label": "托里县",
            "level": 3,
            "pid": 654200,


        }, {
            "id": 654225,
            "label": "裕民县",
            "level": 3,
            "pid": 654200,


        }, {
            "id": 654226,
            "label": "和布克赛尔蒙古自治县",
            "level": 3,
            "pid": 654200,


        }]
    }, {
        "id": 654300,
        "label": "阿勒泰地区",
        "level": 2,
        "pid": 650000,

        "children": [{
            "id": 654301,
            "label": "阿勒泰市",
            "level": 3,
            "pid": 654300,


        }, {
            "id": 654321,
            "label": "布尔津县",
            "level": 3,
            "pid": 654300,


        }, {
            "id": 654322,
            "label": "富蕴县",
            "level": 3,
            "pid": 654300,


        }, {
            "id": 654323,
            "label": "福海县",
            "level": 3,
            "pid": 654300,


        }, {
            "id": 654324,
            "label": "哈巴河县",
            "level": 3,
            "pid": 654300,


        }, {
            "id": 654325,
            "label": "青河县",
            "level": 3,
            "pid": 654300,


        }, {
            "id": 654326,
            "label": "吉木乃县",
            "level": 3,
            "pid": 654300,


        }]
    }, {
        "id": 659000,
        "label": "直辖县级",
        "level": 2,
        "pid": 650000,

        "children": [{
            "id": 659001,
            "label": "石河子市",
            "level": 3,
            "pid": 659000,


        }, {
            "id": 659002,
            "label": "阿拉尔市",
            "level": 3,
            "pid": 659000,


        }, {
            "id": 659003,
            "label": "图木舒克市",
            "level": 3,
            "pid": 659000,


        }, {
            "id": 659004,
            "label": "五家渠市",
            "level": 3,
            "pid": 659000,


        }, {
            "id": 659005,
            "label": "北屯市",
            "level": 3,
            "pid": 659000,


        }, {
            "id": 659006,
            "label": "铁门关市",
            "level": 3,
            "pid": 659000,


        }, {
            "id": 659007,
            "label": "双河市",
            "level": 3,
            "pid": 659000,


        }]
    }]
}, {
    "id": 710000,
    "label": "台湾",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 710100,
        "label": "台北市",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 710101,
            "label": "松山区",
            "level": 3,
            "pid": 710100,


        }, {
            "id": 710102,
            "label": "信义区",
            "level": 3,
            "pid": 710100,


        }, {
            "id": 710103,
            "label": "大安区",
            "level": 3,
            "pid": 710100,


        }, {
            "id": 710104,
            "label": "中山区",
            "level": 3,
            "pid": 710100,


        }, {
            "id": 710105,
            "label": "中正区",
            "level": 3,
            "pid": 710100,


        }, {
            "id": 710106,
            "label": "大同区",
            "level": 3,
            "pid": 710100,


        }, {
            "id": 710107,
            "label": "万华区",
            "level": 3,
            "pid": 710100,


        }, {
            "id": 710108,
            "label": "文山区",
            "level": 3,
            "pid": 710100,


        }, {
            "id": 710109,
            "label": "南港区",
            "level": 3,
            "pid": 710100,


        }, {
            "id": 710110,
            "label": "内湖区",
            "level": 3,
            "pid": 710100,


        }, {
            "id": 710111,
            "label": "士林区",
            "level": 3,
            "pid": 710100,


        }, {
            "id": 710112,
            "label": "北投区",
            "level": 3,
            "pid": 710100,


        }]
    }, {
        "id": 710200,
        "label": "高雄市",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 710201,
            "label": "盐埕区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710202,
            "label": "鼓山区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710203,
            "label": "左营区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710204,
            "label": "楠梓区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710205,
            "label": "三民区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710206,
            "label": "新兴区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710207,
            "label": "前金区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710208,
            "label": "苓雅区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710209,
            "label": "前镇区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710210,
            "label": "旗津区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710211,
            "label": "小港区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710212,
            "label": "凤山区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710213,
            "label": "林园区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710214,
            "label": "大寮区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710215,
            "label": "大树区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710216,
            "label": "大社区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710217,
            "label": "仁武区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710218,
            "label": "鸟松区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710219,
            "label": "冈山区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710220,
            "label": "桥头区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710221,
            "label": "燕巢区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710222,
            "label": "田寮区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710223,
            "label": "阿莲区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710224,
            "label": "路竹区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710225,
            "label": "湖内区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710226,
            "label": "茄萣区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710227,
            "label": "永安区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710228,
            "label": "弥陀区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710229,
            "label": "梓官区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710230,
            "label": "旗山区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710231,
            "label": "美浓区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710232,
            "label": "六龟区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710233,
            "label": "甲仙区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710234,
            "label": "杉林区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710235,
            "label": "内门区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710236,
            "label": "茂林区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710237,
            "label": "桃源区",
            "level": 3,
            "pid": 710200,


        }, {
            "id": 710238,
            "label": "那玛夏区",
            "level": 3,
            "pid": 710200,


        }]
    }, {
        "id": 710300,
        "label": "基隆市",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 710301,
            "label": "中正区",
            "level": 3,
            "pid": 710300,


        }, {
            "id": 710302,
            "label": "七堵区",
            "level": 3,
            "pid": 710300,


        }, {
            "id": 710303,
            "label": "暖暖区",
            "level": 3,
            "pid": 710300,


        }, {
            "id": 710304,
            "label": "仁爱区",
            "level": 3,
            "pid": 710300,


        }, {
            "id": 710305,
            "label": "中山区",
            "level": 3,
            "pid": 710300,


        }, {
            "id": 710306,
            "label": "安乐区",
            "level": 3,
            "pid": 710300,


        }, {
            "id": 710307,
            "label": "信义区",
            "level": 3,
            "pid": 710300,


        }]
    }, {
        "id": 710400,
        "label": "台中市",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 710401,
            "label": "中区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710402,
            "label": "东区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710403,
            "label": "南区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710404,
            "label": "西区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710405,
            "label": "北区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710406,
            "label": "西屯区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710407,
            "label": "南屯区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710408,
            "label": "北屯区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710409,
            "label": "丰原区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710410,
            "label": "东势区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710411,
            "label": "大甲区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710412,
            "label": "清水区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710413,
            "label": "沙鹿区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710414,
            "label": "梧栖区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710415,
            "label": "后里区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710416,
            "label": "神冈区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710417,
            "label": "潭子区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710418,
            "label": "大雅区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710419,
            "label": "新社区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710420,
            "label": "石冈区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710421,
            "label": "外埔区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710422,
            "label": "大安区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710423,
            "label": "乌日区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710424,
            "label": "大肚区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710425,
            "label": "龙井区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710426,
            "label": "雾峰区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710427,
            "label": "太平区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710428,
            "label": "大里区",
            "level": 3,
            "pid": 710400,


        }, {
            "id": 710429,
            "label": "和平区",
            "level": 3,
            "pid": 710400,


        }]
    }, {
        "id": 710500,
        "label": "台南市",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 710501,
            "label": "东区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710502,
            "label": "南区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710504,
            "label": "北区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710506,
            "label": "安南区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710507,
            "label": "安平区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710508,
            "label": "中西区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710509,
            "label": "新营区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710510,
            "label": "盐水区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710511,
            "label": "白河区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710512,
            "label": "柳营区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710513,
            "label": "后壁区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710514,
            "label": "东山区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710515,
            "label": "麻豆区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710516,
            "label": "下营区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710517,
            "label": "六甲区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710518,
            "label": "官田区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710519,
            "label": "大内区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710520,
            "label": "佳里区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710521,
            "label": "学甲区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710522,
            "label": "西港区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710523,
            "label": "七股区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710524,
            "label": "将军区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710525,
            "label": "北门区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710526,
            "label": "新化区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710527,
            "label": "善化区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710528,
            "label": "新市区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710529,
            "label": "安定区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710530,
            "label": "山上区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710531,
            "label": "玉井区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710532,
            "label": "楠西区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710533,
            "label": "南化区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710534,
            "label": "左镇区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710535,
            "label": "仁德区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710536,
            "label": "归仁区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710537,
            "label": "关庙区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710538,
            "label": "龙崎区",
            "level": 3,
            "pid": 710500,


        }, {
            "id": 710539,
            "label": "永康区",
            "level": 3,
            "pid": 710500,


        }]
    }, {
        "id": 710600,
        "label": "新竹市",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 710601,
            "label": "东区",
            "level": 3,
            "pid": 710600,


        }, {
            "id": 710602,
            "label": "北区",
            "level": 3,
            "pid": 710600,


        }, {
            "id": 710603,
            "label": "香山区",
            "level": 3,
            "pid": 710600,


        }]
    }, {
        "id": 710700,
        "label": "嘉义市",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 710701,
            "label": "东区",
            "level": 3,
            "pid": 710700,


        }, {
            "id": 710702,
            "label": "西区",
            "level": 3,
            "pid": 710700,


        }]
    }, {
        "id": 710800,
        "label": "新北市",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 710801,
            "label": "板桥区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710802,
            "label": "三重区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710803,
            "label": "中和区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710804,
            "label": "永和区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710805,
            "label": "新庄区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710806,
            "label": "新店区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710807,
            "label": "树林区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710808,
            "label": "莺歌区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710809,
            "label": "三峡区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710810,
            "label": "淡水区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710811,
            "label": "汐止区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710812,
            "label": "瑞芳区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710813,
            "label": "土城区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710814,
            "label": "芦洲区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710815,
            "label": "五股区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710816,
            "label": "泰山区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710817,
            "label": "林口区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710818,
            "label": "深坑区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710819,
            "label": "石碇区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710820,
            "label": "坪林区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710821,
            "label": "三芝区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710822,
            "label": "石门区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710823,
            "label": "八里区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710824,
            "label": "平溪区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710825,
            "label": "双溪区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710826,
            "label": "贡寮区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710827,
            "label": "金山区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710828,
            "label": "万里区",
            "level": 3,
            "pid": 710800,


        }, {
            "id": 710829,
            "label": "乌来区",
            "level": 3,
            "pid": 710800,


        }]
    }, {
        "id": 712200,
        "label": "宜兰县",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 712201,
            "label": "宜兰市",
            "level": 3,
            "pid": 712200,


        }, {
            "id": 712221,
            "label": "罗东镇",
            "level": 3,
            "pid": 712200,


        }, {
            "id": 712222,
            "label": "苏澳镇",
            "level": 3,
            "pid": 712200,


        }, {
            "id": 712223,
            "label": "头城镇",
            "level": 3,
            "pid": 712200,


        }, {
            "id": 712224,
            "label": "礁溪乡",
            "level": 3,
            "pid": 712200,


        }, {
            "id": 712225,
            "label": "壮围乡",
            "level": 3,
            "pid": 712200,


        }, {
            "id": 712226,
            "label": "员山乡",
            "level": 3,
            "pid": 712200,


        }, {
            "id": 712227,
            "label": "冬山乡",
            "level": 3,
            "pid": 712200,


        }, {
            "id": 712228,
            "label": "五结乡",
            "level": 3,
            "pid": 712200,


        }, {
            "id": 712229,
            "label": "三星乡",
            "level": 3,
            "pid": 712200,


        }, {
            "id": 712230,
            "label": "大同乡",
            "level": 3,
            "pid": 712200,


        }, {
            "id": 712231,
            "label": "南澳乡",
            "level": 3,
            "pid": 712200,


        }]
    }, {
        "id": 712300,
        "label": "桃园县",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 712301,
            "label": "桃园市",
            "level": 3,
            "pid": 712300,


        }, {
            "id": 712302,
            "label": "中坜市",
            "level": 3,
            "pid": 712300,


        }, {
            "id": 712303,
            "label": "平镇市",
            "level": 3,
            "pid": 712300,


        }, {
            "id": 712304,
            "label": "八德市",
            "level": 3,
            "pid": 712300,


        }, {
            "id": 712305,
            "label": "杨梅市",
            "level": 3,
            "pid": 712300,


        }, {
            "id": 712306,
            "label": "芦竹市",
            "level": 3,
            "pid": 712300,


        }, {
            "id": 712321,
            "label": "大溪镇",
            "level": 3,
            "pid": 712300,


        }, {
            "id": 712324,
            "label": "大园乡",
            "level": 3,
            "pid": 712300,


        }, {
            "id": 712325,
            "label": "龟山乡",
            "level": 3,
            "pid": 712300,


        }, {
            "id": 712327,
            "label": "龙潭乡",
            "level": 3,
            "pid": 712300,


        }, {
            "id": 712329,
            "label": "新屋乡",
            "level": 3,
            "pid": 712300,


        }, {
            "id": 712330,
            "label": "观音乡",
            "level": 3,
            "pid": 712300,


        }, {
            "id": 712331,
            "label": "复兴乡",
            "level": 3,
            "pid": 712300,


        }]
    }, {
        "id": 712400,
        "label": "新竹县",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 712401,
            "label": "竹北市",
            "level": 3,
            "pid": 712400,


        }, {
            "id": 712421,
            "label": "竹东镇",
            "level": 3,
            "pid": 712400,


        }, {
            "id": 712422,
            "label": "新埔镇",
            "level": 3,
            "pid": 712400,


        }, {
            "id": 712423,
            "label": "关西镇",
            "level": 3,
            "pid": 712400,


        }, {
            "id": 712424,
            "label": "湖口乡",
            "level": 3,
            "pid": 712400,


        }, {
            "id": 712425,
            "label": "新丰乡",
            "level": 3,
            "pid": 712400,


        }, {
            "id": 712426,
            "label": "芎林乡",
            "level": 3,
            "pid": 712400,


        }, {
            "id": 712427,
            "label": "横山乡",
            "level": 3,
            "pid": 712400,


        }, {
            "id": 712428,
            "label": "北埔乡",
            "level": 3,
            "pid": 712400,


        }, {
            "id": 712429,
            "label": "宝山乡",
            "level": 3,
            "pid": 712400,


        }, {
            "id": 712430,
            "label": "峨眉乡",
            "level": 3,
            "pid": 712400,


        }, {
            "id": 712431,
            "label": "尖石乡",
            "level": 3,
            "pid": 712400,


        }, {
            "id": 712432,
            "label": "五峰乡",
            "level": 3,
            "pid": 712400,


        }]
    }, {
        "id": 712500,
        "label": "苗栗县",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 712501,
            "label": "苗栗市",
            "level": 3,
            "pid": 712500,


        }, {
            "id": 712521,
            "label": "苑里镇",
            "level": 3,
            "pid": 712500,


        }, {
            "id": 712522,
            "label": "通霄镇",
            "level": 3,
            "pid": 712500,


        }, {
            "id": 712523,
            "label": "竹南镇",
            "level": 3,
            "pid": 712500,


        }, {
            "id": 712524,
            "label": "头份镇",
            "level": 3,
            "pid": 712500,


        }, {
            "id": 712525,
            "label": "后龙镇",
            "level": 3,
            "pid": 712500,


        }, {
            "id": 712526,
            "label": "卓兰镇",
            "level": 3,
            "pid": 712500,


        }, {
            "id": 712527,
            "label": "大湖乡",
            "level": 3,
            "pid": 712500,


        }, {
            "id": 712528,
            "label": "公馆乡",
            "level": 3,
            "pid": 712500,


        }, {
            "id": 712529,
            "label": "铜锣乡",
            "level": 3,
            "pid": 712500,


        }, {
            "id": 712530,
            "label": "南庄乡",
            "level": 3,
            "pid": 712500,


        }, {
            "id": 712531,
            "label": "头屋乡",
            "level": 3,
            "pid": 712500,


        }, {
            "id": 712532,
            "label": "三义乡",
            "level": 3,
            "pid": 712500,


        }, {
            "id": 712533,
            "label": "西湖乡",
            "level": 3,
            "pid": 712500,


        }, {
            "id": 712534,
            "label": "造桥乡",
            "level": 3,
            "pid": 712500,


        }, {
            "id": 712535,
            "label": "三湾乡",
            "level": 3,
            "pid": 712500,


        }, {
            "id": 712536,
            "label": "狮潭乡",
            "level": 3,
            "pid": 712500,


        }, {
            "id": 712537,
            "label": "泰安乡",
            "level": 3,
            "pid": 712500,


        }]
    }, {
        "id": 712700,
        "label": "彰化县",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 712701,
            "label": "彰化市",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712721,
            "label": "鹿港镇",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712722,
            "label": "和美镇",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712723,
            "label": "线西乡",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712724,
            "label": "伸港乡",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712725,
            "label": "福兴乡",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712726,
            "label": "秀水乡",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712727,
            "label": "花坛乡",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712728,
            "label": "芬园乡",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712729,
            "label": "员林镇",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712730,
            "label": "溪湖镇",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712731,
            "label": "田中镇",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712732,
            "label": "大村乡",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712733,
            "label": "埔盐乡",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712734,
            "label": "埔心乡",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712735,
            "label": "永靖乡",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712736,
            "label": "社头乡",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712737,
            "label": "二水乡",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712738,
            "label": "北斗镇",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712739,
            "label": "二林镇",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712740,
            "label": "田尾乡",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712741,
            "label": "埤头乡",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712742,
            "label": "芳苑乡",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712743,
            "label": "大城乡",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712744,
            "label": "竹塘乡",
            "level": 3,
            "pid": 712700,


        }, {
            "id": 712745,
            "label": "溪州乡",
            "level": 3,
            "pid": 712700,


        }]
    }, {
        "id": 712800,
        "label": "南投县",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 712801,
            "label": "南投市",
            "level": 3,
            "pid": 712800,


        }, {
            "id": 712821,
            "label": "埔里镇",
            "level": 3,
            "pid": 712800,


        }, {
            "id": 712822,
            "label": "草屯镇",
            "level": 3,
            "pid": 712800,


        }, {
            "id": 712823,
            "label": "竹山镇",
            "level": 3,
            "pid": 712800,


        }, {
            "id": 712824,
            "label": "集集镇",
            "level": 3,
            "pid": 712800,


        }, {
            "id": 712825,
            "label": "名间乡",
            "level": 3,
            "pid": 712800,


        }, {
            "id": 712826,
            "label": "鹿谷乡",
            "level": 3,
            "pid": 712800,


        }, {
            "id": 712827,
            "label": "中寮乡",
            "level": 3,
            "pid": 712800,


        }, {
            "id": 712828,
            "label": "鱼池乡",
            "level": 3,
            "pid": 712800,


        }, {
            "id": 712829,
            "label": "国姓乡",
            "level": 3,
            "pid": 712800,


        }, {
            "id": 712830,
            "label": "水里乡",
            "level": 3,
            "pid": 712800,


        }, {
            "id": 712831,
            "label": "信义乡",
            "level": 3,
            "pid": 712800,


        }, {
            "id": 712832,
            "label": "仁爱乡",
            "level": 3,
            "pid": 712800,


        }]
    }, {
        "id": 712900,
        "label": "云林县",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 712901,
            "label": "斗六市",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712921,
            "label": "斗南镇",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712922,
            "label": "虎尾镇",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712923,
            "label": "西螺镇",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712924,
            "label": "土库镇",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712925,
            "label": "北港镇",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712926,
            "label": "古坑乡",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712927,
            "label": "大埤乡",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712928,
            "label": "莿桐乡",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712929,
            "label": "林内乡",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712930,
            "label": "二仑乡",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712931,
            "label": "仑背乡",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712932,
            "label": "麦寮乡",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712933,
            "label": "东势乡",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712934,
            "label": "褒忠乡",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712935,
            "label": "台西乡",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712936,
            "label": "元长乡",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712937,
            "label": "四湖乡",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712938,
            "label": "口湖乡",
            "level": 3,
            "pid": 712900,


        }, {
            "id": 712939,
            "label": "水林乡",
            "level": 3,
            "pid": 712900,


        }]
    }, {
        "id": 713000,
        "label": "嘉义县",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 713001,
            "label": "太保市",
            "level": 3,
            "pid": 713000,


        }, {
            "id": 713002,
            "label": "朴子市",
            "level": 3,
            "pid": 713000,


        }, {
            "id": 713023,
            "label": "布袋镇",
            "level": 3,
            "pid": 713000,


        }, {
            "id": 713024,
            "label": "大林镇",
            "level": 3,
            "pid": 713000,


        }, {
            "id": 713025,
            "label": "民雄乡",
            "level": 3,
            "pid": 713000,


        }, {
            "id": 713026,
            "label": "溪口乡",
            "level": 3,
            "pid": 713000,


        }, {
            "id": 713027,
            "label": "新港乡",
            "level": 3,
            "pid": 713000,


        }, {
            "id": 713028,
            "label": "六脚乡",
            "level": 3,
            "pid": 713000,


        }, {
            "id": 713029,
            "label": "东石乡",
            "level": 3,
            "pid": 713000,


        }, {
            "id": 713030,
            "label": "义竹乡",
            "level": 3,
            "pid": 713000,


        }, {
            "id": 713031,
            "label": "鹿草乡",
            "level": 3,
            "pid": 713000,


        }, {
            "id": 713032,
            "label": "水上乡",
            "level": 3,
            "pid": 713000,


        }, {
            "id": 713033,
            "label": "中埔乡",
            "level": 3,
            "pid": 713000,


        }, {
            "id": 713034,
            "label": "竹崎乡",
            "level": 3,
            "pid": 713000,


        }, {
            "id": 713035,
            "label": "梅山乡",
            "level": 3,
            "pid": 713000,


        }, {
            "id": 713036,
            "label": "番路乡",
            "level": 3,
            "pid": 713000,


        }, {
            "id": 713037,
            "label": "大埔乡",
            "level": 3,
            "pid": 713000,


        }, {
            "id": 713038,
            "label": "阿里山乡",
            "level": 3,
            "pid": 713000,


        }]
    }, {
        "id": 713300,
        "label": "屏东县",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 713301,
            "label": "屏东市",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713321,
            "label": "潮州镇",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713322,
            "label": "东港镇",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713323,
            "label": "恒春镇",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713324,
            "label": "万丹乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713325,
            "label": "长治乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713326,
            "label": "麟洛乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713327,
            "label": "九如乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713328,
            "label": "里港乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713329,
            "label": "盐埔乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713330,
            "label": "高树乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713331,
            "label": "万峦乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713332,
            "label": "内埔乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713333,
            "label": "竹田乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713334,
            "label": "新埤乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713335,
            "label": "枋寮乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713336,
            "label": "新园乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713337,
            "label": "崁顶乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713338,
            "label": "林边乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713339,
            "label": "南州乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713340,
            "label": "佳冬乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713341,
            "label": "琉球乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713342,
            "label": "车城乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713343,
            "label": "满州乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713344,
            "label": "枋山乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713345,
            "label": "三地门乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713346,
            "label": "雾台乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713347,
            "label": "玛家乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713348,
            "label": "泰武乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713349,
            "label": "来义乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713350,
            "label": "春日乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713351,
            "label": "狮子乡",
            "level": 3,
            "pid": 713300,


        }, {
            "id": 713352,
            "label": "牡丹乡",
            "level": 3,
            "pid": 713300,


        }]
    }, {
        "id": 713400,
        "label": "台东县",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 713401,
            "label": "台东市",
            "level": 3,
            "pid": 713400,


        }, {
            "id": 713421,
            "label": "成功镇",
            "level": 3,
            "pid": 713400,


        }, {
            "id": 713422,
            "label": "关山镇",
            "level": 3,
            "pid": 713400,


        }, {
            "id": 713423,
            "label": "卑南乡",
            "level": 3,
            "pid": 713400,


        }, {
            "id": 713424,
            "label": "鹿野乡",
            "level": 3,
            "pid": 713400,


        }, {
            "id": 713425,
            "label": "池上乡",
            "level": 3,
            "pid": 713400,


        }, {
            "id": 713426,
            "label": "东河乡",
            "level": 3,
            "pid": 713400,


        }, {
            "id": 713427,
            "label": "长滨乡",
            "level": 3,
            "pid": 713400,


        }, {
            "id": 713428,
            "label": "太麻里乡",
            "level": 3,
            "pid": 713400,


        }, {
            "id": 713429,
            "label": "大武乡",
            "level": 3,
            "pid": 713400,


        }, {
            "id": 713430,
            "label": "绿岛乡",
            "level": 3,
            "pid": 713400,


        }, {
            "id": 713431,
            "label": "海端乡",
            "level": 3,
            "pid": 713400,


        }, {
            "id": 713432,
            "label": "延平乡",
            "level": 3,
            "pid": 713400,


        }, {
            "id": 713433,
            "label": "金峰乡",
            "level": 3,
            "pid": 713400,


        }, {
            "id": 713434,
            "label": "达仁乡",
            "level": 3,
            "pid": 713400,


        }, {
            "id": 713435,
            "label": "兰屿乡",
            "level": 3,
            "pid": 713400,


        }]
    }, {
        "id": 713500,
        "label": "花莲县",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 713501,
            "label": "花莲市",
            "level": 3,
            "pid": 713500,


        }, {
            "id": 713521,
            "label": "凤林镇",
            "level": 3,
            "pid": 713500,


        }, {
            "id": 713522,
            "label": "玉里镇",
            "level": 3,
            "pid": 713500,


        }, {
            "id": 713523,
            "label": "新城乡",
            "level": 3,
            "pid": 713500,


        }, {
            "id": 713524,
            "label": "吉安乡",
            "level": 3,
            "pid": 713500,


        }, {
            "id": 713525,
            "label": "寿丰乡",
            "level": 3,
            "pid": 713500,


        }, {
            "id": 713526,
            "label": "光复乡",
            "level": 3,
            "pid": 713500,


        }, {
            "id": 713527,
            "label": "丰滨乡",
            "level": 3,
            "pid": 713500,


        }, {
            "id": 713528,
            "label": "瑞穗乡",
            "level": 3,
            "pid": 713500,


        }, {
            "id": 713529,
            "label": "富里乡",
            "level": 3,
            "pid": 713500,


        }, {
            "id": 713530,
            "label": "秀林乡",
            "level": 3,
            "pid": 713500,


        }, {
            "id": 713531,
            "label": "万荣乡",
            "level": 3,
            "pid": 713500,


        }, {
            "id": 713532,
            "label": "卓溪乡",
            "level": 3,
            "pid": 713500,


        }]
    }, {
        "id": 713600,
        "label": "澎湖县",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 713601,
            "label": "马公市",
            "level": 3,
            "pid": 713600,


        }, {
            "id": 713621,
            "label": "湖西乡",
            "level": 3,
            "pid": 713600,


        }, {
            "id": 713622,
            "label": "白沙乡",
            "level": 3,
            "pid": 713600,


        }, {
            "id": 713623,
            "label": "西屿乡",
            "level": 3,
            "pid": 713600,


        }, {
            "id": 713624,
            "label": "望安乡",
            "level": 3,
            "pid": 713600,


        }, {
            "id": 713625,
            "label": "七美乡",
            "level": 3,
            "pid": 713600,


        }]
    }, {
        "id": 713700,
        "label": "金门县",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 713701,
            "label": "金城镇",
            "level": 3,
            "pid": 713700,


        }, {
            "id": 713702,
            "label": "金湖镇",
            "level": 3,
            "pid": 713700,


        }, {
            "id": 713703,
            "label": "金沙镇",
            "level": 3,
            "pid": 713700,


        }, {
            "id": 713704,
            "label": "金宁乡",
            "level": 3,
            "pid": 713700,


        }, {
            "id": 713705,
            "label": "烈屿乡",
            "level": 3,
            "pid": 713700,


        }, {
            "id": 713706,
            "label": "乌丘乡",
            "level": 3,
            "pid": 713700,


        }]
    }, {
        "id": 713800,
        "label": "连江县",
        "level": 2,
        "pid": 710000,

        "children": [{
            "id": 713801,
            "label": "南竿乡",
            "level": 3,
            "pid": 713800,


        }, {
            "id": 713802,
            "label": "北竿乡",
            "level": 3,
            "pid": 713800,


        }, {
            "id": 713803,
            "label": "莒光乡",
            "level": 3,
            "pid": 713800,


        }, {
            "id": 713804,
            "label": "东引乡",
            "level": 3,
            "pid": 713800,


        }]
    }]
}, {
    "id": 810000,
    "label": "香港特别行政区",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 810100,
        "label": "香港岛",
        "level": 2,
        "pid": 810000,

        "children": [{
            "id": 810101,
            "label": "中西区",
            "level": 3,
            "pid": 810100,


        }, {
            "id": 810102,
            "label": "湾仔区",
            "level": 3,
            "pid": 810100,


        }, {
            "id": 810103,
            "label": "东区",
            "level": 3,
            "pid": 810100,


        }, {
            "id": 810104,
            "label": "南区",
            "level": 3,
            "pid": 810100,


        }]
    }, {
        "id": 810200,
        "label": "九龙",
        "level": 2,
        "pid": 810000,

        "children": [{
            "id": 810201,
            "label": "油尖旺区",
            "level": 3,
            "pid": 810200,


        }, {
            "id": 810202,
            "label": "深水埗区",
            "level": 3,
            "pid": 810200,


        }, {
            "id": 810203,
            "label": "九龙城区",
            "level": 3,
            "pid": 810200,


        }, {
            "id": 810204,
            "label": "黄大仙区",
            "level": 3,
            "pid": 810200,


        }, {
            "id": 810205,
            "label": "观塘区",
            "level": 3,
            "pid": 810200,


        }]
    }, {
        "id": 810300,
        "label": "新界",
        "level": 2,
        "pid": 810000,

        "children": [{
            "id": 810301,
            "label": "荃湾区",
            "level": 3,
            "pid": 810300,


        }, {
            "id": 810302,
            "label": "屯门区",
            "level": 3,
            "pid": 810300,


        }, {
            "id": 810303,
            "label": "元朗区",
            "level": 3,
            "pid": 810300,


        }, {
            "id": 810304,
            "label": "北区",
            "level": 3,
            "pid": 810300,


        }, {
            "id": 810305,
            "label": "大埔区",
            "level": 3,
            "pid": 810300,


        }, {
            "id": 810306,
            "label": "西贡区",
            "level": 3,
            "pid": 810300,


        }, {
            "id": 810307,
            "label": "沙田区",
            "level": 3,
            "pid": 810300,


        }, {
            "id": 810308,
            "label": "葵青区",
            "level": 3,
            "pid": 810300,


        }, {
            "id": 810309,
            "label": "离岛区",
            "level": 3,
            "pid": 810300,


        }]
    }]
}, {
    "id": 820000,
    "label": "澳门特别行政区",
    "level": 1,
    "pid": 100000,

    "children": [{
        "id": 820100,
        "label": "澳门半岛",
        "level": 2,
        "pid": 820000,

        "children": [{
            "id": 820101,
            "label": "花地玛堂区",
            "level": 3,
            "pid": 820100,


        }, {
            "id": 820102,
            "label": "圣安多尼堂区",
            "level": 3,
            "pid": 820100,


        }, {
            "id": 820103,
            "label": "大堂区",
            "level": 3,
            "pid": 820100,


        }, {
            "id": 820104,
            "label": "望德堂区",
            "level": 3,
            "pid": 820100,


        }, {
            "id": 820105,
            "label": "风顺堂区",
            "level": 3,
            "pid": 820100,


        }]
    }, {
        "id": 820200,
        "label": "氹仔岛",
        "level": 2,
        "pid": 820000,

        "children": [{
            "id": 820201,
            "label": "嘉模堂区",
            "level": 3,
            "pid": 820200,


        }]
    }, {
        "id": 820300,
        "label": "路环岛",
        "level": 2,
        "pid": 820000,

        "children": [{
            "id": 820301,
            "label": "圣方济各堂区",
            "level": 3,
            "pid": 820300,


        }]
    }]
}]
